{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":229827793,"authorName":"Steve Loughran","from":"&quot;Steve Loughran&quot; &lt;steve.loughran.soapbuilders@...&gt;","profile":"steve_loughran","replyTo":"SENDER","senderId":"cFdf9ZP39dfIDDYNnfpcj_t6Nk1BvLNyQgHUtPlCYqlWSkg3QdOZT71IEL9M9nIYVofR5v5XOvCHF3_IrcvkY5V1HOC6gdIKr2VOT8eb03mM3UAYBh0PVzVockfMxzo","spamInfo":{"isSpam":false,"reason":"12"},"subject":"enterprise adoption of REST and amazon services","postDate":"1198099676","msgId":10021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkYzc4ZDdiMDcxMjE5MTMyN3QxZDEyYTIxOG44ODQ1MjBkNGJmMGJmN2E4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":10024,"prevInTime":10020,"nextInTime":10022,"topicId":10021,"numMessagesInTopic":7,"msgSnippet":"... I would point you at my recent slideware on infrastructure evolution: http://people.apache.org/~stevel/slides/farms_fabrics_and_clouds.pdf -the enterprises","rawEmail":"Return-Path: &lt;steve.loughran.soapbuilders@...&gt;\r\nX-Sender: steve.loughran.soapbuilders@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 63975 invoked from network); 19 Dec 2007 21:27:57 -0000\r\nX-Received: from unknown (66.218.67.95)\n  by m55.grp.scd.yahoo.com with QMQP; 19 Dec 2007 21:27:57 -0000\r\nX-Received: from unknown (HELO ag-out-0708.google.com) (72.14.246.243)\n  by mta16.grp.scd.yahoo.com with SMTP; 19 Dec 2007 21:27:57 -0000\r\nX-Received: by ag-out-0708.google.com with SMTP id 5so2234728agb.11\n        for &lt;rest-discuss@yahoogroups.com&gt;; Wed, 19 Dec 2007 13:27:56 -0800 (PST)\r\nX-Received: by 10.150.195.21 with SMTP id s21mr3812198ybf.114.1198099676630;\n        Wed, 19 Dec 2007 13:27:56 -0800 (PST)\r\nX-Received: by 10.35.85.14 with HTTP; Wed, 19 Dec 2007 13:27:56 -0800 (PST)\r\nMessage-ID: &lt;9dc78d7b0712191327t1d12a218n884520d4bf0bf7a8@...&gt;\r\nDate: Wed, 19 Dec 2007 13:27:56 -0800\r\nCc: rest-discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Steve Loughran&quot; &lt;steve.loughran.soapbuilders@...&gt;\r\nSubject: enterprise adoption of REST and amazon services\r\nX-Yahoo-Group-Post: member; u=229827793; y=Eh0ZV-TYxGOGmeAsOa-sixE_pyJ1Zji1EQ_DtEL4WTFidOYFr7K4NuU\r\nX-Yahoo-Profile: steve_loughran\r\n\r\nOn Dec 17, 2007 7:08 PM, David Sidlinger &lt;david.sidlinger@...&gt; wrote:\n&gt; On 17 Dec, 2007, at 3:19 PM, Assaf Arkin wrote:\n&gt;\n&gt; &gt; Because for any given service it&#39;s quite likely to find consumes who\n&gt; &gt; will appreciate one and not the other, and adding a checklist is\n&gt; &gt; easier than taking a stand.\n&gt;\n&gt;\n&gt; We&#39;ve seen this behavior before with competing, proprietary technology\n&gt; stacks and distributed-object approaches.  A vendor was much more\n&gt; likely to get an &quot;enterprise&quot; sale if they supported a whole slew of\n&gt; acronyms.  Quality tends to suffer, though, when products try to\n&gt; please everyone.  Components and systems ended up being either\n&gt; mediocre all around or supporting one stack/language/protocol well and\n&gt; the others horribly.\n&gt;\n&gt; It appears, in this case, that Amazon started with a SOAP API and\n&gt; attempted to bolt on a &quot;RESTful&quot; (even with quotation marks, I&#39;m being\n&gt; generous) one with minimal additional code.  I think this is a large\n&gt; miscalculation on Amazon&#39;s part, because:\n&gt;\n&gt; a) Most of the people that are excited about the services they are\n&gt; rolling out are comfortable with REST in both philosophy and\n&gt; implementation.\n&gt;\n&gt; b) The only customers that would demand a SOAP interface are\n&gt; &quot;enterprises&quot; (there are those quotes again) that aren&#39;t looking to\n&gt; externalize their infrastructure to Amazon.\n&gt;\n\nI would point you at my recent slideware on infrastructure evolution:\nhttp://people.apache.org/~stevel/slides/farms_fabrics_and_clouds.pdf\n\n-the enterprises are adopting virtualisation, primarily as a way of\nconsolidating existing web sites onto less physical hardware, with\ncorresponding savings in hardware and energy; plus the ability to gain\nsome reliability without massive hardware duplication.\n\nwhat I have no evidence of is pickup of ec2/s3 infrastructure by the\nenterprises. remember, these are organisations that pay for oracle\ndatabases and have full time oracle-certified DBA&#39;s prepared to argue\nthe merits of oracle over everything else. Adopting things like\npostgres or mysql is still hard, let alone moving to simpledb.\n\n&gt; I could be completely missing the mark.  As a SOAP victim, I still\n&gt; bear the scars of former and present run-ins with WS-*.  Is anyone\n&gt; seeing a high level of enthusiasm for Big Web Services that I&#39;m just\n&gt; missing?\n\n\n1. this mail list is self-selecting of people who&#39;ve been burned by\nsoap stack pain too often to go near it. me, I&#39;m happier with CORBA or\nRMI than WS-*, as at least things marshall well, and the Distributed\nObject architecture can be managed if you can roll out code updates to\nall nodes simultaneously.\n\n2. WS-* is pretty deep  in the enterprise, especially as the glue\nbetween &quot;both&quot; platforms, Windows and Java. Hence Sun&#39;s investment in\nbetter WS-* interop. In in-house, single vendor systems, WS-* can be\nmade to work over space -but not necessarily time. Again, with a\ndecent deployment infrastructure when you can roll out code everywhere\nsimultaneously, then you can stay in control.\n\nThe WS-* tooling has set up enterprise developers with certain expectations\n -you dont need to know WSDL or XSD\n -you dont need to work with raw XML\n -you can take the WSDL and have the client code generated for you\nThere&#39;s probably also the implicit expectation that remote services\nlook like synchronous remote method calls.\n\nAs we on this list know, it is these assumptions that lead to so many\nproblems -machine generated classes that can&#39;t handle changes in the\nXML, blocking rpc operations that cant handle failures, etc. But out\nthere in the field, the stuff does work on a single version of an app,\nusing the same toolkit at both ends, so people can easily roll out\nsomething big -because the computing world (esp. MS and IBM) say Ws-*\nis good. Its only later that they discover problems with\n -attempts to connect new clients\n -attempts to change the interface\nFailures at these point may be blamed on the new clients or their\ntooling, rather than fundamental flaws in the whole development\nmethology of WS-* applications.\n\n\nReturning to amazon services\n\n1. S3 is beautiful. Though I think their metadata stuff looks a bit\ntacked on...they should have had a special metadata/ resource for\neverything from the outset. If amazon released an official WADL\ndescription it may even get takeup in the tooling. Also, as S3 has a\nruby clone, you can host all of S3 -bar DNS tricks- in house. Their\nauthentication model is a bit complex, but restlets do it so I dont\nhave to, and it lets you delegate rights to others for controlled\nperiods of time.\n\n2. I believe EC2 was built on axis 1.x, as that was initially the only\nSOAP client that could talk reliably to it using WS-security. Perhaps\ninside amazon they use(d) axis1.x everywhere. Interestingly, their\nHTTP QUERY API has more features than the SOAP one; like the ability\nto publish context information. the ability to provide such info was\n(initially) restricted to the HTTP API, and the way to retrieve this\ninfo is from a GET.\n\n3. SimpleDB is underwhelming. I wouldn&#39;t commit to using it as my only\ndatastore. Whoever owns your database owns you, as they say, usually\nin relation to DB2. The fact that you can&#39;t use mysql or postgres on\nEC2 is a limitation of their architecture (And the fact that the sole\npersistence model of EC2 is S3). I&#39;m not convinced that simpleDB is\nthe solution. I&#39;d rather something that adopted GData.\n\n-steve\n\n"}}