{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"szL88ndwiJ4TYAMihNWLDh_ShYgQety1VkjPPPLkYh4HswiDzUnH06KJbq685RUXbaU1wwhNEfKiRrZLXAxiqo6dxqQQVaHO-g3CCJ2l_g","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [rest-discuss] RESTful design for Articles & Tags?","postDate":"1199400512","msgId":10179,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBmNjMwMWM4NGU1YSRjODIwYjhmMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","inReplyToHeader":"PFc4MTE3OTEzOTExMzA1MDIxMTk5Mzg1NTUzQG1haWwubWFpbHNuYXJlLm5ldD4=","referencesHeader":"PFc4MTE3OTEzOTExMzA1MDIxMTk5Mzg1NTUzQG1haWwubWFpbHNuYXJlLm5ldD4="},"prevInTopic":10177,"nextInTopic":10180,"prevInTime":10178,"nextInTime":10180,"topicId":9891,"numMessagesInTopic":99,"msgSnippet":"... I regretted adding that the moment I sent the email, but didn t want to call attention to it by sending another email.  My apologies, it was written is a ","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 39571 invoked from network); 3 Jan 2008 22:48:41 -0000\r\nX-Received: from unknown (66.218.67.95)\n  by m43.grp.scd.yahoo.com with QMQP; 3 Jan 2008 22:48:41 -0000\r\nX-Received: from unknown (HELO rv-out-0910.google.com) (209.85.198.185)\n  by mta16.grp.scd.yahoo.com with SMTP; 3 Jan 2008 22:48:41 -0000\r\nX-Received: by rv-out-0910.google.com with SMTP id c24so4878507rvf.16\n        for &lt;rest-discuss@yahoogroups.com&gt;; Thu, 03 Jan 2008 14:48:40 -0800 (PST)\r\nX-Received: by 10.141.177.2 with SMTP id e2mr8422917rvp.268.1199400520505;\n        Thu, 03 Jan 2008 14:48:40 -0800 (PST)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nX-Received: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTPS id 3sm10178761wrs.7.2008.01.03.14.48.36\n        (version=SSLv3 cipher=RC4-MD5);\n        Thu, 03 Jan 2008 14:48:39 -0800 (PST)\r\nTo: &lt;eric@...&gt;,\n\t&lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;W8117913911305021199385553@...&gt;\r\nDate: Thu, 3 Jan 2008 17:48:32 -0500\r\nKeywords: Archived\r\nMessage-ID: &lt;0f6301c84e5a$c820b8f0$0702a8c0@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nThread-Index: AchOOAITYethxTd9SxGUNoWhi94H0QAG+xlw\r\nIn-Reply-To: &lt;W8117913911305021199385553@...&gt;\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.3198\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: [rest-discuss] RESTful design for Articles & Tags?\r\nX-Yahoo-Group-Post: member; u=228155998; y=D7hzTFT6xpNr12ejO60vZFlHnbLDMHx-OSq61nVUVzWn1hS0yW6e\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\nEric J. Bowman wrote:\n&gt; Once again, whatever point you&#39;re trying to make will most \n&gt; likely be lost on others when you resort to name-calling of \n&gt; those who disagree with you, i.e. &quot;elitists&quot; ...\n\nI regretted adding that the moment I sent the email, but didn&#39;t want to call\nattention to it by sending another email.  My apologies, it was written is a\nmoment of frustration much of which should not have been aimed at you.\n\n&gt; ...who don&#39;t do \n&gt; &quot;real work&quot; or &quot;lead real lives&quot;.  \n\nThis I&#39;ll defend, because I think I meant it different than you took it\nalthough I guess I could drop the &quot;real&quot; part.  What I was referring to\npeople who are not &quot;craftsmen&quot; such as you and even I (hopefully you take no\noffense at this?) but instead people who don&#39;t care about web technologies,\nthey just want to get something done so they can quit thinking about it and\ngo on to do other things in life that are unrelated to web technology.  BTW,\nwhere I really ran into the feeling of dealing with &quot;elitist&quot; was the time I\nspent on the HTMLWG where people said things like &quot;Well, if people can&#39;t\nfully understand how to use CSS they have no business creating HTML content&quot;\nwhich is just so, so wrong on so many levels.  I think some of my angst over\nthe reality that HTML5 is explictly moving away from empowering the common\nman spilled over into this discussion.\n\n&gt; You have not backed up your claim that \n&gt; using XML &quot;puts a burden of conservatism on others.&quot;\n\nThe problem is we are discussing too many fine points as if they are one.\nBerand went on a rant about how things being imprecise was a problem and I\nresponded with Postel&#39;s Law after which it became intertwined with the\ndiscussion of XML.\n\nHowever, specifically regarding XML if for example you had it in your power\nto require people to have their websites serve only valid XML or not be\nrendered, even just for those who think they are serving XHTML, you&#39;d have a\nvasty broken world wide web, especially considering all the non-technical\nbloggers and user-generated content being added as of late. And those latter\npeople are probably not all going to fall inline and become precise.\n\n&gt; Thus, the service is being liberal in what it accepts and \n&gt; conservative in what it produces, without &quot;burdening others \n&gt; with conservatism&quot; despite my insistence on using valid XML.  \n&gt; I fail to see how this use of valid XML puts interacting \n&gt; with, or maintaining, my service beyond the reach of non- experts.\n\nIf you only serve XML you are being more conservative than if you also serve\nJSON and HTML+Microformats you&#39;ve disempowered those who can consume the\nlatter two but have difficulty consuming the former, especially those such\nas myself you now admitted just don&#39;t &quot;get&quot; XSLT (and I know I&#39;m in the\nminority if you could all possible consumers of data.)\n\nFrankly, as someone who doesn&#39;t program full time for a living (though I\nonce did, even wrote a book on programming) but I am still extremely\ninterested in programming. I have found that I simply don&#39;t have the time to\nfigure out how to get all the XML to work but I can easily get JSON to work\nin the time I have allotted to working with related projects.  So if you\nwant to limit consumption of your services to only those professional\nprogrammers who have fully spent the time to come up to speed parsing XML\nproperly then okay, but if you&#39;d like to open your services to the broader\ngroup of people who program to achieve a business goal using programming,\nthen XML is more constraining.  Can we agree on that?\n\n&gt; My service outputs valid XML, but accepts a wide variety of \n&gt; input.  For example, you can use &quot;BBcode&quot; (or even wiki-code) \n&gt; if you&#39;d like, to make a post -- it doesn&#39;t have to be \n&gt; perfect.  You can even [b]nest [i]improperly[/b][/i], when \n&gt; the server accepts that input it will be transformed to \n&gt; &quot;&lt;strong&gt;nest &lt;em&gt;improperly&lt;/em&gt;&lt;/strong&gt;&quot; before the post \n&gt; is stored, or published.\n\nAnd in your case for input, you are being liberal in what you accept, so no\nargument there.\n\n&gt; Anyone with the ability to make a post on a wiki, weblog or \n&gt; forum -- and a Web browser with forms capability -- can use \n&gt; it.  \n\nYou mean use it to post content?  But not about consuming it, right?\n\n&gt; Anyone who has even a passing familiarity with Web \n&gt; development can work *with* it, even if they don&#39;t know XSLT. \n\nDo you using the DOM or some other approach to consume it?\n\n&gt;  Or JavaScript, as would be required with JSON.\n\nMy belief is that using Javascript is a lower bar than using XML because of\ntools like Firebug and the availablity of working examples to view and learn\nfrom, i.e the entire web of apps that use Javascript.  Ease of learning is\npart of it.\n\n&gt; Your point seems to be that, in and of itself, the use of XML \n&gt; is somehow limiting.  \n\nNot exactly, but partially.  It limits the set of people who can effectly\nconsume it.  It that were not true, then JSON would not have sprouted as\nthere would have been no need. The mere fact that JSON has proliferated\ngives credence to my assertion that XML is too hard for many people to\nconsume either from a cost, time, or learning perspective.\n\n&gt; I&#39;m sorry, but that just isn&#39;t the case.  \n\nYou&#39;ve not proven that any more than I could prove what you claimed I\ndidn&#39;t. I&#39;ll try to avoid unprovables moving forward if you do.\n\n&gt; In my experience the opposite is true -- appropriate \n&gt; use of XML is quite liberating, and within reach of the \n&gt; majority of Web developers out there due to its simplicity.  \n\nBut isn&#39;t your experience too small a sample set to be statistically valid?\nIsn&#39;t it possible your preference for it finds you validating your own\nassertion?  You could say the same for my belief that JSON is more\napproachable but I&#39;m taking my cue from all the people who are promoting it\nas of late. Actually, I didn&#39;t discover on my own; I&#39;d still be trying to\nuse XML if it wasn&#39;t for the groundswell of people suggesting JSON.\nObviously there is something to that and a reason why XML is not a be-all\nend-all for everyone.\n\nSo I&#39;m not saying XML has no value, just that it isn&#39;t the solution for\nevery problem.\n\n&gt; Nothing dogmatic about it, just pragmatic.\n\nSo here&#39;s a question for you; why not add value for those who would prefer\nto consume JSON by serving that too?  If you are being pragmatic then it\nwould make sense, no?  I hear you can do it server-side with an XSL\ntransform...\n\n-- \n-Mike Schinkel\nhttp://www.mikeschinkel.com/blogs/\nhttp://www.welldesignedurls.org\nhttp://atlanta-web.org \n\n\n"}}