{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":319607554,"authorName":"Assaf Arkin","from":"&quot;Assaf Arkin&quot; &lt;assaf@...&gt;","profile":"assafarkin","replyTo":"SENDER","senderId":"ovfv--Ks9hL5Yn4j-1J1w_te8r5ZVnItt59fichc7MKMSA3yUnH6Rgh9_cb7ms3Q00-S80FFRkAZHNIcG23SN4N1ym-DnguluA","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] bootstrapping","postDate":"1200683106","msgId":10267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMzdiNmU0MDgwMTE4MTEwNXkyMGQ3OGQ5MHNkNjJmOTFiNGNiNjYwZjUxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDEyYzgwMWM4NTljZiRkODQzOTgzMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","referencesHeader":"PGZta3M3OCtrMTVrQGVHcm91cHMuY29tPgkgPDUwMzdiNmU0MDgwMTE2MTA0OHE0MGViYWQ4NGkzOGY3YzhhMmQ5MmU3MDA1QG1haWwuZ21haWwuY29tPgkgPDBmM2UwMWM4NTg3ZiQ5ZDhhY2Y3MCQwNzAyYThjMEBHdWlkZXMubG9jYWw+CSA8NTAzN2I2ZTQwODAxMTYyMjM5Zzc3N2I0NjdkcTY0YjEzNzMzMDAwOTg4YWNAbWFpbC5nbWFpbC5jb20+CSA8MTA1NDAxYzg1OGU3JDQ4ZmNiNWYwJDA3MDJhOGMwQEd1aWRlcy5sb2NhbD4JIDw1MDM3YjZlNDA4MDExNzE5MTdoMmQzNmU0ODBuNzYwMzc2NTk4NWQwYzc1NkBtYWlsLmdtYWlsLmNvbT4JIDwxMjUxMDFjODU5YTYkNDBhYTg3YTAkMDcwMmE4YzBAR3VpZGVzLmxvY2FsPgkgPDUwMzdiNmU0MDgwMTE4MDE0NGoyMGVkMGYzZmliZjZmZTIwNWI1OTFkMmNiQG1haWwuZ21haWwuY29tPgkgPDEyYzgwMWM4NTljZiRkODQzOTgzMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+"},"prevInTopic":10261,"nextInTopic":10269,"prevInTime":10266,"nextInTime":10268,"topicId":10201,"numMessagesInTopic":65,"msgSnippet":"... I do accept that.  I m not strictly in the market for solutions requiring my skill sets.  I blog, but I don t write my own blog software, I self-host a","rawEmail":"Return-Path: &lt;assaf@...&gt;\r\nX-Sender: assaf@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 91014 invoked from network); 18 Jan 2008 19:05:08 -0000\r\nX-Received: from unknown (66.218.67.97)\n  by m56.grp.scd.yahoo.com with QMQP; 18 Jan 2008 19:05:08 -0000\r\nX-Received: from unknown (HELO fg-out-1718.google.com) (72.14.220.159)\n  by mta18.grp.scd.yahoo.com with SMTP; 18 Jan 2008 19:05:07 -0000\r\nX-Received: by fg-out-1718.google.com with SMTP id l27so1212578fgb.42\n        for &lt;rest-discuss@yahoogroups.com&gt;; Fri, 18 Jan 2008 11:05:07 -0800 (PST)\r\nX-Received: by 10.86.25.17 with SMTP id 17mr3394866fgy.15.1200683106808;\n        Fri, 18 Jan 2008 11:05:06 -0800 (PST)\r\nX-Received: by 10.86.71.6 with HTTP; Fri, 18 Jan 2008 11:05:06 -0800 (PST)\r\nMessage-ID: &lt;5037b6e40801181105y20d78d90sd62f91b4cb660f51@...&gt;\r\nDate: Fri, 18 Jan 2008 11:05:06 -0800\r\nTo: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nIn-Reply-To: &lt;12c801c859cf$d8439830$0702a8c0@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;fmks78+k15k@...&gt;\n\t &lt;5037b6e40801161048q40ebad84i38f7c8a2d92e7005@...&gt;\n\t &lt;0f3e01c8587f$9d8acf70$0702a8c0@...&gt;\n\t &lt;5037b6e40801162239g777b467dq64b13733000988ac@...&gt;\n\t &lt;105401c858e7$48fcb5f0$0702a8c0@...&gt;\n\t &lt;5037b6e40801171917h2d36e480n7603765985d0c756@...&gt;\n\t &lt;125101c859a6$40aa87a0$0702a8c0@...&gt;\n\t &lt;5037b6e40801180144j20ed0f3fibf6fe205b591d2cb@...&gt;\n\t &lt;12c801c859cf$d8439830$0702a8c0@...&gt;\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Assaf Arkin&quot; &lt;assaf@...&gt;\r\nSubject: Re: [rest-discuss] bootstrapping\r\nX-Yahoo-Group-Post: member; u=319607554; y=ji_xBAXZsyryGhK4uk4zBsi7QJSBTai2g9BV1LvNKWa-QyFkSQ\r\nX-Yahoo-Profile: assafarkin\r\n\r\nOn Jan 18, 2008 4:44 AM, Mike Schinkel &lt;mikeschinkel@...&gt; wrote:\n&gt; Your knowledge and skill is obviously making it nearly impossible for you to\n&gt; recognize what it is like not to have your knowledge and skill (that&#39;s not a\n&gt; criticism, it&#39;s well-documented human psychology.)\n\nI do accept that.  I&#39;m not strictly in the market for solutions\nrequiring my skill sets.  I blog, but I don&#39;t write my own blog\nsoftware, I self-host a couple but mostly I prefer them to be\nservices, I don&#39;t care to install and maintain them.  Just because I\nhave the skills doesn&#39;t mean I want to use them all the time.  So\nthings that are dead simple are very appealing to me.\n\n\n&gt; &gt; &gt; Occupational Programmers don&#39;t need a spec, they don&#39;t even\n&gt; &gt; think in\n&gt; &gt; &gt; those terms.  They instead need to be slapped in the face with the\n&gt; &gt; &gt; fact that something is possible before they even consider\n&gt; &gt; it because\n&gt; &gt; &gt; they otherwise assume it is not.\n&gt; &gt;\n&gt; &gt; Which is exactly what a spec does.  A spec tells you what&#39;s\n&gt; &gt; available and how to use it.  Don&#39;t confuse that with the\n&gt; &gt; cryptic, over-generic, formal style we employ in various\n&gt; &gt; working groups, that&#39;s particularly appealing to a small set\n&gt; &gt; of people.  Specs can take many forms, ideally one that&#39;s\n&gt; &gt; readable to a lot of people.\n&gt;\n&gt; You are manipulating my metaphor to be used in a manner which was not how I\n&gt; intended. My reference to being slapped in the face was not to slap with the\n&gt; set of rules but instead to slap them in the face with what&#39;s possible. And\n&gt; when someone assumes things are not possible by default they don&#39;t go\n&gt; looking for specs no matter how readable they are.  OTOH, if they were\n&gt; browsing the web and discovered the Google Chart API by accident, for\n&gt; example, they might just have an &quot;Aha!&quot; moment and realize they *can* use it\n&gt; to implement something.  But if they have to first read a spec, it ain&#39;t\n&gt; gonna happen, or at least not nearly as often.\n\nOnce you learn something exists, what happens next?  I&#39;m concerned\nwith going from &quot;I know I want to use it&quot; to &quot;I&#39;m using it&quot;.  I&#39;m not\nconcerned here with how people find a service exists to begin with,\nthat&#39;s definitely important, but not relevant or specific to REST.  If\nsomeone has a need to include charts in their blog, and they found out\nGoogle Charts makes that possible, through whatever channel, what do\nthey need for the next step?\n\n\n&gt; &gt; &gt; &gt; The problem with WSDL, and from what I&#39;ve seen also WADL, is that\n&gt; &gt; &gt; &gt; neither one provides a map.\n&gt; &gt; &gt;\n&gt; &gt; &gt; WSDL and WADL are two orders of magnitude more complexity than any\n&gt; &gt; &gt; occupational programmer will ever attempt.\n&gt; &gt;\n&gt; &gt; The WS-* people will beg to differ, a lot of companies are\n&gt; &gt; pursing exactly that market with visual tools that alleviate\n&gt; &gt; the cognitive workload and designed to appeal to people who\n&gt; &gt; can&#39;t program their way out of a for loop.\n&gt;\n&gt; Jeesh!  Those tools you mention are for *Professional programmers*, not\n&gt; people whose job titles do not contain the words &quot;Programmer&quot; or &quot;Developer&quot;\n&gt; but who could gain benefit in their job from being able to easily interact\n&gt; with REST-based services; mashups for example.  You tell those people they\n&gt; are programmers and they will scoff at you, many feeling somewhat offended,\n&gt; but those same people need to do some of the same work that programmers need\n&gt; to do.\n\nThe WS-* landscape is not all stacks and stubs.\n\nI know a lot of companies who put their weight behind this space\nbecause of a very simple value proposition.  Let&#39;s make tools that\nordinary people can use.  You can make a great tool for business\npeople to control how orders are processed,or create dashboards with\nKPI, without having to know anything about programming.  These tools\ncan work at their level of understanding, metaphors and skills, be\nmore like Excel and nothing like Eclipse.\n\nWhich happens if you allow small startups, system integrators and IT\nto play in this space.  But here&#39;s the thing, you can build and sell\nsuch a wonderful tool for helping you manage order, only if you don&#39;t\nhave to build and sell the order management system along with it.\nDoing the later puts you in competition with SAP or any of the other\nestablished players.  So you want to build something that can use an\nexisting SAP (or insert your favorite) system.  SAP uses their\nproprietary RFC protocol; if you also need to integrate with Siebel,\nthat&#39;s another proprietary protocol; PeopleSoft have their own, and so\nforth.  So now you have an EAI problem to solve, which is expensive to\ndevelop, and licensing one will shrink your market and eat your\nprofits.\n\nNot so if all the plumbing was talking one language.  So let&#39;s say you\nbuild a wonderful tool that lets business people customize how orders\nare entered into the system, at the level of abstraction they\nunderstand, and the engine (which they never see) uses XForms to\nproduce XML which gets wrapped in a SOAP envelope and sent to a known\nport, which ends up being an IDoc function in SAP R/3, and you&#39;ve got\nEDI.\n\nAnd that is appealing to a lot of companies who&#39;s sole purpose is to\ncater to people who don&#39;t care to program, intentionally or\naccidentally.  Those products are not sold because of their WS-*\ncapabilities, end-users and buyers don&#39;t care for that, they&#39;re sold\nbecause they&#39;re possible and hit the right price point.\n\n&gt; Want to solve the problem?  Don&#39;t argue that people who struggle to learn\n&gt; how to form valid HTML should be able to implement the interdirection model\n&gt; of HATEOAS because your debating it won&#39;t make it so.  Instead, work to\n&gt; develop a standard model for said interaction so that sooner than later than\n&gt; standard model of interaction can become built into browsers and the class\n&gt; of people I refer to can effectively discover web services that use HATEOAS\n&gt; and so that open-source libraries can be implemented to make calling\n&gt; services that comply with HATEOAS brain-dead easy.\n\nThe best thing you can do is give people tools that just solves the\nproblem for them.  If I want to add a del.icio.us widget on my blog, I\ndon&#39;t want to see the JavaScript code and hack it to work against my\naccount.  I go to the page which lets me configure it, and spits one\none line of code I plant in my template, without having to understand\nhow it works.  It might be putting action in the URL, or using GET to\nupdate state, or carrying the messages over SOAP.  If it just works,\ndo I care?\n\nIf I provide people with an online tool they can use to customize a\nscript, I&#39;ll use forms and links and all other good things, and it\nwill be HATEOAS.  The tool, but the script doesn&#39;t have to be.  I&#39;m\ntalking about the script here.  I think it matters indirectly, if it&#39;s\ncheap to do and resistent to change, you&#39;ll see more tools developed,\nand the more (and better) tools you have, the less people (myself\nincluded) have to bother programming.\n\n\n&gt; &gt; &gt; Just to clarify, are you saying that you think everything\n&gt; &gt; &gt; that a web service might provide can be converted into a\n&gt; &gt; &gt; pre-known finite list?\n&gt; &gt; If that wasn&#39;t possible, I wouldn&#39;t be able to implement it\n&gt; &gt; using a turing-complete language.\n&gt;\n&gt; Then tell me how you would implement today&#39;s airline flight arrival times as\n&gt; a pre-defined finite list on the server?\n\nIf I&#39;m telling you that http://travels/{flight number}/arrival\nprovides the current arrival time, then I just provided you with a\npre-defined, finite (size 1) list of the things my service provides.\nThat&#39;s something I can spec, so other people can build clients to get\nthe current arrival time on any given flight, widgets that let you\ntrack a particular flight, etc.\n\n&gt; &gt; In my analogy, a map would be exactly what Google is doing\n&gt; &gt; with their Chart API.\n&gt; &gt;\n&gt; &gt; To backtrack for a second, the three options listed for this\n&gt; &gt; discussion were:\n&gt; &gt; 1.  Give developers a URL template they can write their\n&gt; &gt; client against.\n&gt; &gt; 2.  Have the service return a URL template from a known URL\n&gt; &gt; (maybe in response to OPTIONS).\n&gt; &gt; 3.  Have a resource that can resolve a name to a URL.\n&gt; &gt;\n&gt; &gt; #1 and #2 are maps in the analogy, #1 in the form of a spec,\n&gt; &gt; #2 served dynamically.  #3 are posts.  What I&#39;m saying is,\n&gt; &gt; commit to #1 and/or #3, ignore #2.\n&gt; &gt;\n&gt; &gt; Google Chart API made its decision and went with #1.  If you\n&gt; &gt; look at other widgets on the Web, you&#39;ll notice a lot of do\n&gt; &gt; #1 and/or #3, telling you how to construct a URL to get the\n&gt; &gt; desired results, or giving you a way to resolve to a URL.\n&gt; &gt; What I&#39;ve yet to see them do successfully is offer a resource\n&gt; &gt; that serves meta-data from which a client can decide how to\n&gt; &gt; construct a URL (although some do it internally).\n&gt;\n&gt; Either I&#39;ve been completely misinterpretting your comments or you&#39;ve been\n&gt; changing your argument because #2 is what I&#39;ve been arguing against for\n&gt; externally published APIs and #2 violates the pure HATEOAS model.  I would\n&gt; especially argue against using #2 in contexts where &quot;accidental&quot; programmers\n&gt; might be using them like Google&#39;s Chart API.  BTW, I think I&#39;ll use\n&gt; &quot;accidental programmers&quot; from now on because that would capture the essense\n&gt; of a blogger who is not a programmer but programs without  realizing it.\n\nI think we were in agreement all along that #2 deviates from the pure\nHATEOAS model, and is the better choice for the Goolge Chart API, or\nat least I thought that way.  Just that I used map as analogy\nprecisely for things like the Google Chart API, and you misunderstood\nmy usage of maps to not be about things like the Google Charts API.\n\n\n&gt; And if you still choose to disagree with that, do so by finding me several\n&gt; externally published REST-based URL interfaces from companies still in\n&gt; business since they published their REST-based URL interface that have had\n&gt; to be changed and that have caused disruption. Hell, find me just one. (P.S.\n&gt; SOAP interfaces don&#39;t count; we all know how screwed up SOAP has been.)\n\n&quot;With that in mind, we&#39;re announcing the rollout of a new API server:\napi.del.icio.us. Everything passed back and forth from the machine\nwill be done over SSL. You will have to do a bit of URL rewriting, and\nwe apologize for that inconvenience, but it will be consistent across\nall the API calls&quot;\n\nhttp://blog.delicious.com/blog/2006/05/feel_secure.html\n\n&quot;The consequence of this is that pretty soon many Flash based Flickr\nwidgets that use the old urls will probably stop working until they\nhave been updated to the new api structure. So if you are a user you\nshould check out the pages where you downloaded your widget originally\nand see if the developer has already updated it.&quot;\n\nhttp://www.quasimondo.com/archives/000630.php\n\nJust a couple of examples, more can be found here:\nhttp://www.google.com/search?q={service_name}+api+change\n\n\n-- Assaf\nhttp://labnotes.org\n\n\n&gt;\n&gt; --\n&gt; -Mike Schinkel\n&gt; http://www.mikeschinkel.com/blogs/\n&gt; http://www.welldesignedurls.org\n&gt; http://atlanta-web.org\n&gt;\n&gt;\n&gt; [1] http://programmableweb.com/apis\n&gt;\n&gt;\n\n"}}