{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":319607554,"authorName":"Assaf Arkin","from":"&quot;Assaf Arkin&quot; &lt;assaf@...&gt;","profile":"assafarkin","replyTo":"SENDER","senderId":"nAuKNa-Cpz2DKCq1GkWY1HismkZ-o06JJ5yZ7YMp692nN4sIRZ9eRSEm_LNLHpUErFxQMsR63W3RM4JbF6XSMoO4oVuOLBB6wQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] bootstrapping","postDate":"1200705452","msgId":10273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMzdiNmU0MDgwMTE4MTcxN2c3NmFlOTg2YXNhYzk5MDU4OTYwZGE2ZjBlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGM4MjA0NTQzMDgwMTE4MTM1OWoyYzFkMjQwZGxkYTA3ODczMDBlYWI4YmRhQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZta3M3OCtrMTVrQGVHcm91cHMuY29tPgkgPDUwMzdiNmU0MDgwMTE2MTA0OHE0MGViYWQ4NGkzOGY3YzhhMmQ5MmU3MDA1QG1haWwuZ21haWwuY29tPgkgPDBmM2UwMWM4NTg3ZiQ5ZDhhY2Y3MCQwNzAyYThjMEBHdWlkZXMubG9jYWw+CSA8NTAzN2I2ZTQwODAxMTYyMjM5Zzc3N2I0NjdkcTY0YjEzNzMzMDAwOTg4YWNAbWFpbC5nbWFpbC5jb20+CSA8MTA1NDAxYzg1OGU3JDQ4ZmNiNWYwJDA3MDJhOGMwQEd1aWRlcy5sb2NhbD4JIDw1MDM3YjZlNDA4MDExNzE5MTdoMmQzNmU0ODBuNzYwMzc2NTk4NWQwYzc1NkBtYWlsLmdtYWlsLmNvbT4JIDxjODIwNDU0MzA4MDExODEzNTlqMmMxZDI0MGRsZGEwNzg3MzAwZWFiOGJkYUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":10272,"nextInTopic":10274,"prevInTime":10272,"nextInTime":10274,"topicId":10201,"numMessagesInTopic":65,"msgSnippet":"... Exactly. But I want to qualify something.  I think there are two separate issues here.  I m going to refer to this as specification, a specification tells","rawEmail":"Return-Path: &lt;assaf@...&gt;\r\nX-Sender: assaf@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 83490 invoked from network); 19 Jan 2008 01:17:34 -0000\r\nX-Received: from unknown (66.218.67.97)\n  by m52.grp.scd.yahoo.com with QMQP; 19 Jan 2008 01:17:34 -0000\r\nX-Received: from unknown (HELO fg-out-1718.google.com) (72.14.220.155)\n  by mta18.grp.scd.yahoo.com with SMTP; 19 Jan 2008 01:17:33 -0000\r\nX-Received: by fg-out-1718.google.com with SMTP id 22so1209534fge.18\n        for &lt;rest-discuss@yahoogroups.com&gt;; Fri, 18 Jan 2008 17:17:32 -0800 (PST)\r\nX-Received: by 10.86.53.8 with SMTP id b8mr3682713fga.32.1200705452661;\n        Fri, 18 Jan 2008 17:17:32 -0800 (PST)\r\nX-Received: by 10.86.71.6 with HTTP; Fri, 18 Jan 2008 17:17:32 -0800 (PST)\r\nMessage-ID: &lt;5037b6e40801181717g76ae986asac99058960da6f0e@...&gt;\r\nDate: Fri, 18 Jan 2008 17:17:32 -0800\r\nTo: &quot;John D. Heintz&quot; &lt;jheintz@...&gt;\r\nCc: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;, rest-discuss@yahoogroups.com\r\nIn-Reply-To: &lt;c82045430801181359j2c1d240dlda0787300eab8bda@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;fmks78+k15k@...&gt;\n\t &lt;5037b6e40801161048q40ebad84i38f7c8a2d92e7005@...&gt;\n\t &lt;0f3e01c8587f$9d8acf70$0702a8c0@...&gt;\n\t &lt;5037b6e40801162239g777b467dq64b13733000988ac@...&gt;\n\t &lt;105401c858e7$48fcb5f0$0702a8c0@...&gt;\n\t &lt;5037b6e40801171917h2d36e480n7603765985d0c756@...&gt;\n\t &lt;c82045430801181359j2c1d240dlda0787300eab8bda@...&gt;\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Assaf Arkin&quot; &lt;assaf@...&gt;\r\nSubject: Re: [rest-discuss] bootstrapping\r\nX-Yahoo-Group-Post: member; u=319607554; y=D9a692TpR2ymQKrpLLJ6mZSF6xza9a-fj4BSHPtJsAEeMGfP3w\r\nX-Yahoo-Profile: assafarkin\r\n\r\nOn Jan 18, 2008 1:59 PM, John D. Heintz &lt;jheintz@...&gt; wrote:\n&gt; Assaf,\n&gt;\n&gt; I agree very, very much. So much that I used the metaphor of\n&gt; &quot;signposts&quot; for exactly this same idea [1].\n&gt;\n&gt; My most recent thinking [2] on this is that a &quot;State Description\n&gt; Language&quot; could provide a shared set of expectations that consumers of\n&gt; a RESTful system could opportunistically take advantage of. In this\n&gt; post I also refer to several interesting papers and systems that seem\n&gt; to indicate solutions in this light.\n\nExactly.\n\nBut I want to qualify something.  I think there are two separate\nissues here.  I&#39;m going to refer to this as specification, a\nspecification tells you what the service does and how to go about\ndoing it.\n\nFirst, ignore how the specification is expressed, what would it\nexpress?  The best practices if you will.  Do you provide a URL\ntemplate for every resource? Only a select few? In which contexts?  I\ncan think up of many more questions, all of which go in this category.\n\nSecond, comes the choice of language.  And there are a lot of\ndifferent opportunities, it can be written in human form, have a\nvisual notation, have a bunch of machine processable syntaxes, etc.\n\nI fear that every discussion directed towards this goal starts out by\nbikeshedding the choice of language.  Picking a language upfront you\nrun the risk of getting bogged down in the implementation details: can\nI represent this RDF as JSON? elements or attributes? inheritence or\ncomposition?  Good intentions that end up leading to an almost good\nenough solution due to the inability to choose a color.  Some WS-*\nspecs are a good example for that, solving the problem in whichever\nway the XML syntax makes easy or elegant looking.  Let&#39;s not go there\nagain.\n\nIf we can figure out the best practices for what you intend to\ndescribe, it then becomes easier to come up with different styles for\nexpressing it, and avoid the language turf wars.\n\n\n&gt;\n&gt; Mike Schinkel: Most developers won&#39;t step up to semantic web, RDF,\n&gt; state machines languages, and so on. We&#39;ve agreed on this generally\n&gt; before. (However, I don&#39;t like the names used to describe people in\n&gt; this thread - it is just important that people can get some value with\n&gt; small effort, and more value with more effort.) Any solution to this\n&gt; should introduce the smallest possible addition to enable useful and\n&gt; flexible processing.\n&gt;\n&gt; In my opinion the example set by Microformats and GRDDL [3] together\n&gt; answer both the smallest implication and opportunity for predictive\n&gt; specification concerns.\n&gt; * Microformats are simple (one or a few additional pieces of data\n&gt; added to content)\n&gt; * GRDDL transforms HTML+microformats into a formal RDF model for any\n&gt; sophisticated processing\n&gt;\n&gt; In a uniform interface hypermedia system all of this (state transfer,\n&gt; signs, signposts, ...) is encoded into the MIME type of a\n&gt; Representation. How to build a good hypermedia system, extensible and\n&gt; machine processable hypermedia documents (and types), and process\n&gt; current documents with automation support is all very naive. Today the\n&gt; machine clients of HTTP are just starting to take advantage what could\n&gt; be done, there is a lot of opportunity.\n&gt;\n&gt; This quote from section 5.3.3 of the REST thesis points to the goal,\n&gt; but doesn&#39;t give the slightest advice on how to achieve it:\n&gt;   &quot;The model application is therefore an engine that moves from one\n&gt; state to the next by examining and choosing from among the alternative\n&gt; state transitions in the current set of representations.&quot;\n\nI also keep referencing that quote, because it clearly does not\npreclude implementations driven by specifications.\n\nAssaf\n\n&gt;\n&gt; John Heintz\n&gt;\n&gt; [1] http://johnheintz.blogspot.com/2007/05/does-rest-need-dl.html\n&gt; [2] http://johnheintz.blogspot.com/2008/01/comments-rest-interactions-and.html\n&gt; [3] http://www.w3.org/TR/grddl/\n&gt;\n&gt; On Jan 17, 2008 9:17 PM, Assaf Arkin &lt;assaf@...&gt; wrote:\n&gt;\n&gt; &gt; On Jan 17, 2008 12:59 AM, Mike Schinkel &lt;mikeschinkel@...&gt; wrote:\n&gt; &gt; &gt; However, and I explain this so you&#39;ll know why I make some of my arguments,\n&gt; &gt; &gt; I&#39;m also concerned with empowering a class of people that I think most who\n&gt; &gt; &gt; participate on these lists are not concerned with. I&#39;ll call those people\n&gt; &gt; &gt; &quot;occupational&quot; programmers (as opposed to &quot;professional&quot;) programmers.\n&gt; &gt; &gt; Occupational programmers by nature program to get a job done not because\n&gt; &gt; &gt; their job is programming. The more difficult something is the less likely an\n&gt; &gt; &gt; occupational programmers will ever be able to do it because they don&#39;t\n&gt; &gt; &gt; rarely have the time to learn more than beginner-level programming skills.\n&gt; &gt;\n&gt; &gt; I just call them developers.  Those working on the business needs like\n&gt; &gt; order fullfilment and inventory management, far outweight those\n&gt; &gt; working on infrastructure problems like how to connect any given\n&gt; &gt; server to any given client.  I belong to the smaller category of\n&gt; &gt; infrastructure developers, who worry about that stuff, but only so\n&gt; &gt; other developers won&#39;t have to.\n&gt; &gt;\n&gt; &gt; Same difference, I just think it helps in remembering that what works\n&gt; &gt; for me doesn&#39;t work for most developers.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt; IMO for the HATEOAS to be fully respected and generally used we need a\n&gt; &gt; &gt; standard way to discover and interact with REST-based web services and that\n&gt; &gt; &gt; standard way to interact need to then be built into browsers thus allowing\n&gt; &gt; &gt; people to discover and interact with them without having to write code.\n&gt; &gt; &gt; Until that happens, it&#39;s unrealistic to expect widespread use of HATEOAS for\n&gt; &gt; &gt; any but the most standards-pedantic of web service publishers much like\n&gt; &gt; &gt; people still use &lt;table&gt; elements instead of pure CSS because pure CSS\n&gt; &gt; &gt; doesn&#39;t fully meet the needs of users.  Companies that have a strategic\n&gt; &gt; &gt; reason for more people to use their externally published web services are\n&gt; &gt; &gt; foolish not to publish direct URL interfaces because given the current state\n&gt; &gt; &gt; of things HATEOAS signifcantly stunts adoption.\n&gt; &gt;\n&gt; &gt; HATEOAS, if I understand correctly, talks about links and their\n&gt; &gt; equivalence, or how you navigate from one resource to another, or\n&gt; &gt; change from one state to another.  The Web as we know it has another\n&gt; &gt; thing called discovery.  Given a resource I can discover how to use\n&gt; &gt; it, as I&#39;m using it, and use hypermedia to drive the application\n&gt; &gt; state.\n&gt; &gt;\n&gt; &gt; In my experience that doesn&#39;t work for the programmable Web.  You\n&gt; &gt; really do need to know what the states and transitions are, before you\n&gt; &gt; start coding for them.  Things like getting an order done is pursuing\n&gt; &gt; known transitions, to a desired end state, but you&#39;ll never start if\n&gt; &gt; you don&#39;t know there&#39;s a paved road leading to your destination.\n&gt; &gt;\n&gt; &gt; Working without a spec (i.e. pure discovery) has other down sides,\n&gt; &gt; like not always finding the optimal path, not being able to develop in\n&gt; &gt; parallel, QA servers on behalf of clients, or even determining what\n&gt; &gt; changes break clients.\n&gt; &gt;\n&gt; &gt; You need a map, and post signs along the way.\n&gt; &gt;\n&gt; &gt; The problem with WSDL, and from what I&#39;ve seen also WADL, is that\n&gt; &gt; neither one provides a map.  They provide blueprints.  They tell you\n&gt; &gt; exactly how to manufacture a service (and clients), but in doing so\n&gt; &gt; eliminates necessary deviations, extensions and compositions that can\n&gt; &gt; happen over time.  We need something better than that, which smartly\n&gt; &gt; divides that which belongs in the map and what which belongs on signs.\n&gt; &gt;\n&gt; &gt; In that world view, dynamically downloading a map is unnecessary.  You\n&gt; &gt; already have one, from which you&#39;re building your code.  And if the\n&gt; &gt; one you have is different from the one you download, there&#39;s little\n&gt; &gt; you can do about it.  But you pay attention to signs along the route,\n&gt; &gt; in fact you can&#39;t get to your destination without following signs.\n&gt; &gt;\n&gt; &gt; So in this particular case, I would say that for all the known places,\n&gt; &gt; you should just list them on a map, hand it to developers to build\n&gt; &gt; clients from it.  As you point out, public services like Google do\n&gt; &gt; that as a matter of practice, and that just means you have to honor\n&gt; &gt; these specifications once you publish them.  But some routes may\n&gt; &gt; change over time, in which case it&#39;s best to have the server resolve\n&gt; &gt; them, which is a simple matter of &quot;here&#39;s the data, give me back a\n&gt; &gt; URL&quot;.\n&gt; &gt;\n&gt; &gt; The inbetween case is putting something up with intent that it be a\n&gt; &gt; sign, but possibility to be used as a map.  If it&#39;s possible it will\n&gt; &gt; happen, much more than developers reading the manual.  So rather than\n&gt; &gt; hoping things will happen in a particular way, I say commit to them.\n&gt; &gt; Make something a map or a sign, and only available in one form.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt; BTW, 99% of what I&#39;m discussing in this email are web services published for\n&gt; &gt; &gt; external use, not web services that are only used by others in the same\n&gt; &gt; &gt; organization.\n&gt; &gt;\n&gt; &gt; It&#39;s been my experience that if you follow the successful practices of\n&gt; &gt; the Web, it ends up working quite well internally, if you follow\n&gt; &gt; practices only intended to work internally, they don&#39;t always work\n&gt; &gt; internally.  There&#39;s obviously a benefit to writing a service that\n&gt; &gt; only your coworker in the next room can use -- time being one of them\n&gt; &gt; -- but that&#39;s also how we acquire technical debt.\n&gt; &gt;\n&gt; &gt; I plan on every service as if it was publish on the Web, because I\n&gt; &gt; can&#39;t tell that the person who was at the design meeting today won&#39;t\n&gt; &gt; be replaced by someone else tomorrow who doesn&#39;t share our same\n&gt; &gt; understanding of doing things.\n&gt; &gt;\n&gt; &gt; -- Assaf\n&gt; &gt; http://labnotes.org\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; There are also cases where a HATEOAS requirement effectively nullifies the\n&gt; &gt; &gt; benefit fo the service, for example the published URL interfaces for\n&gt; &gt; &gt; Google&#39;s Chart API [1].  Given that the Google Chart API returns an image\n&gt; &gt; &gt; for use in a &lt;img src=&quot;...&quot;&gt; element, requiring the client to first call a\n&gt; &gt; &gt; main URL to get the specific URL before it can use it elimates potential use\n&gt; &gt; &gt; anywhere Javascript is not an option and for anyone who does not have the\n&gt; &gt; &gt; required Javascript skills (My guess is more than 10 times more people know\n&gt; &gt; &gt; HTML than Javascript.)  Again, I&#39;m advocating for accessibility for the\n&gt; &gt; &gt; lesser skilled. They, after all, are not here to advocate for themselves\n&gt; &gt; &gt; (unless you count me in that category. :-)\n&gt; &gt; &gt;\n&gt; &gt; &gt; --\n&gt; &gt; &gt; -Mike Schinkel\n&gt; &gt; &gt; http://www.mikeschinkel.com/blogs/\n&gt; &gt; &gt; http://www.welldesignedurls.org\n&gt; &gt; &gt; http://atlanta-web.org\n&gt; &gt; &gt;\n&gt; &gt; &gt; [1] http://code.google.com/apis/chart/#url_format\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Assaf\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; But even your service is public, if it is important that the URL be\n&gt; &gt; &gt; &gt; &gt; able to change then make that clear in no uncertain terms\n&gt; &gt; &gt; &gt; in the docs\n&gt; &gt; &gt; &gt; &gt; and in UPPERCASE comments in any representations returned.\n&gt; &gt; &gt; &gt; And if you\n&gt; &gt; &gt; &gt; &gt; are paranoid, literally change the URL every time with a\n&gt; &gt; &gt; &gt; validatation\n&gt; &gt; &gt; &gt; &gt; parameter so that anyone who did hard code quickly learns\n&gt; &gt; &gt; &gt; better and\n&gt; &gt; &gt; &gt; &gt; no time is given to allow hardcoded clients time is build up.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Or IMO best of all, just document it and commit to the URL\n&gt; &gt; &gt; &gt; format just\n&gt; &gt; &gt; &gt; &gt; as Google have done with their Chart service, for example.\n&gt; &gt; &gt; &gt; Yes I know,\n&gt; &gt; &gt; &gt; &gt; that violates the HATEOAS requirement but I personally don&#39;t think\n&gt; &gt; &gt; &gt; &gt; being a fundamentalist in all things is such a good idea;\n&gt; &gt; &gt; &gt; some times\n&gt; &gt; &gt; &gt; &gt; it is better just to put a stake in the ground. If\n&gt; &gt; &gt; &gt; *everything* were\n&gt; &gt; &gt; &gt; &gt; meta, we&#39;d never get anything done.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; --\n&gt; &gt; &gt; &gt; &gt; -Mike Schinkel\n&gt; &gt; &gt; &gt; &gt; http://www.mikeschinkel.com/blogs/\n&gt; &gt; &gt; &gt; &gt; http://www.welldesignedurls.org\n&gt; &gt; &gt; &gt; &gt; http://atlanta-web.org\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --\n&gt; &gt; &gt; &gt; -- Assaf\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; http://labnotes.org\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Yahoo! Groups Links\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --\n&gt; John D. Heintz\n&gt; Principal Consultant\n&gt; New Aspects of Software\n&gt; http://newaspects.com\n&gt; http://johnheintz.blogspot.com\n&gt; Austin, TX\n&gt; (512) 633-1198\n&gt;\n\n\n\n-- \n-- Assaf\n\nhttp://labnotes.org\n\n"}}