{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"OOkfMim_Kw4VwcIg1TiSoVwZApUjW8IwPThIg1I8YABXBFA3jzMdbyHPgs-zXkZ9hPjWrMbmqWQari9EvQJCgdodQEI9prLLW8tg12WD5A","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [rest-discuss] bootstrapping","postDate":"1200838233","msgId":10290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDQwMWM4NWI2ZSQzOWMyZmY3MCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","inReplyToHeader":"PDUwMzdiNmU0MDgwMTIwMDA1NnczZmVjMDJiNXBmZmVjN2M5NDlmYmNiYzM2QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGZta3M3OCtrMTVrQGVHcm91cHMuY29tPiA8MTQzMjAxYzg1YTNlJDg4MzU4NDYwJDA3MDJhOGMwQEd1aWRlcy5sb2NhbD4gPDUwMzdiNmU0MDgwMTE4MTkwOXA2ZmE5NjM2MmpjNzg4YWUwMjZlYTMxZmMyQG1haWwuZ21haWwuY29tPiA8MTQ1YzAxYzg1YTVhJDc0MmU3ZmEwJDA3MDJhOGMwQEd1aWRlcy5sb2NhbD4gPDUwMzdiNmU0MDgwMTE4MjIwNnE1NmE5YmU3M21lMGZjNGExYmU2MjZmMTYyQG1haWwuZ21haWwuY29tPiA8MTQ4NzAxYzg1YTdlJDg1NWUwNjUwJDA3MDJhOGMwQEd1aWRlcy5sb2NhbD4gPDUwMzdiNmU0MDgwMTE5MDI1NGozNGMzMThmcjI1MjA5ZDA3ZThjZDRmY2ZAbWFpbC5nbWFpbC5jb20+IDwxNTJjMDFjODVhZTUkMTFlNGZmNTAkMDcwMmE4YzBAR3VpZGVzLmxvY2FsPiA8NTAzN2I2ZTQwODAxMTkxODA0aTQ3OWY3YmQ1ZzJmZmQxZTVhNWI2ZGM1OEBtYWlsLmdtYWlsLmNvbT4gPDE1NTAwMWM4NWIxZCRkNzcyOThkMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+IDw1MDM3YjZlNDA4MDEyMDAwNTZ3M2ZlYzAyYjVwZmZlYzdjOTQ5ZmJjYmMzNkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":10289,"nextInTopic":10295,"prevInTime":10289,"nextInTime":10291,"topicId":10201,"numMessagesInTopic":65,"msgSnippet":"... Well, if it worked, then it given my concept it would be application/atom+xml/tasks but of course the spec doesn t specify matching the just first","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 13495 invoked from network); 20 Jan 2008 14:10:37 -0000\r\nX-Received: from unknown (66.218.67.94)\n  by m50.grp.scd.yahoo.com with QMQP; 20 Jan 2008 14:10:37 -0000\r\nX-Received: from unknown (HELO hs-out-2122.google.com) (64.233.178.250)\n  by mta15.grp.scd.yahoo.com with SMTP; 20 Jan 2008 14:10:37 -0000\r\nX-Received: by hs-out-2122.google.com with SMTP id k27so1612161hsc.3\n        for &lt;rest-discuss@yahoogroups.com&gt;; Sun, 20 Jan 2008 06:10:36 -0800 (PST)\r\nX-Received: by 10.150.205.13 with SMTP id c13mr1847521ybg.66.1200838236851;\n        Sun, 20 Jan 2008 06:10:36 -0800 (PST)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nX-Received: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTPS id 7sm8804499wrh.22.2008.01.20.06.10.34\n        (version=SSLv3 cipher=RC4-MD5);\n        Sun, 20 Jan 2008 06:10:35 -0800 (PST)\r\nTo: &quot;&#39;Assaf Arkin&#39;&quot; &lt;assaf@...&gt;\r\nCc: &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;fmks78+k15k@...&gt; &lt;143201c85a3e$88358460$0702a8c0@...&gt; &lt;5037b6e40801181909p6fa96362jc788ae026ea31fc2@...&gt; &lt;145c01c85a5a$742e7fa0$0702a8c0@...&gt; &lt;5037b6e40801182206q56a9be73me0fc4a1be626f162@...&gt; &lt;148701c85a7e$855e0650$0702a8c0@...&gt; &lt;5037b6e40801190254j34c318fr25209d07e8cd4fcf@...&gt; &lt;152c01c85ae5$11e4ff50$0702a8c0@...&gt; &lt;5037b6e40801191804i479f7bd5g2ffd1e5a5b6dc58@...&gt; &lt;155001c85b1d$d77298d0$0702a8c0@...&gt; &lt;5037b6e40801200056w3fec02b5pffec7c949fbcbc36@...&gt;\r\nDate: Sun, 20 Jan 2008 09:10:33 -0500\r\nKeywords: Archived\r\nMessage-ID: &lt;000401c85b6e$39c2ff70$0702a8c0@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.3198\r\nThread-Index: AchbQl04qWGmdpx/TLmz7u3Y4pZq1gAI1o9A\r\nIn-Reply-To: &lt;5037b6e40801200056w3fec02b5pffec7c949fbcbc36@...&gt;\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: [rest-discuss] bootstrapping\r\nX-Yahoo-Group-Post: member; u=228155998; y=_87ZlLFbOlNQtZ4PTHH5HEpWTXKBsIXsZTLg1p6yloM94GH2qQjK\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\nAssaf Arkin wrote:\n&gt; &gt; You ask good rhetorical questions. In reality I think that \n&gt; we should \n&gt; &gt; in fact have an &quot;application/html+task&quot; MIME type, but ideally it \n&gt; &gt; would be &quot;text/html/task&quot; where all software that could process \n&gt; &gt; &quot;text/html&quot; would still process it as such, but sofware \n&gt; that understands &quot;text/html/task&quot;\n&gt; &gt; could know to handle it specially. But we know that \n&gt; handling of MIME \n&gt; &gt; types doesn&#39;t work that way, so unfortunately that wouldn&#39;t \n&gt; work, now will it?\n&gt; &gt; Another approach would be to add a &quot;Content-subtype&quot; header to that \n&gt; &gt; could be used to identify subtypes, but then we&#39;ve split \n&gt; type into two \n&gt; &gt; values instead of just one and that&#39;s not so good (although \n&gt; it could \n&gt; &gt; be a stop-gap approach assuming we ammend the relevent \n&gt; mime-type specs \n&gt; &gt; to say that Content-type can have any level of subtypes and \n&gt; use that \n&gt; &gt; when both client and server understand and use a \n&gt; Content-subtype when they don&#39;t.\n&gt; &gt;\n&gt; &gt; So what I&#39;m seeing is a need to be able to have a content \n&gt; type seen as \n&gt; &gt; both a general type &quot;text/html&quot; and as a more specific type \n&gt; &gt; &quot;text/html/task&quot; just as an object-oriented language that supports \n&gt; &gt; inheritance can interact with an object as it is was an instance of \n&gt; &gt; the base class and as an instance of the inherited class. I \n&gt; think with \n&gt; &gt; Atom this would be especially useful because Atom really is a great \n&gt; &gt; example of a generic abstract mime-type from which specialized \n&gt; &gt; mime-types could be created but for which it would be great \n&gt; of software that understand Atom could still process as Atom.\n&gt; \n&gt; If I also decided to deliver a feed of recently completed \n&gt; tasks using Atom, would that be text/xml/atom, or \n&gt; text/xml/atom/xml/tasks?\n\nWell, if it worked, then it given my concept it would be\napplication/atom+xml/tasks but of course the spec doesn&#39;t specify matching\nthe just first characters, it matches all characters (at least that&#39;s what I\nassume it says) so what I&#39;d like to see wouldn&#39;t work, at least not without\nsome changes to the mime spec and a transition plan.\n\n&gt; &gt; But I general I don&#39;t have a perfect solution yet.  Suggestions?\n&gt; \n&gt; What&#39;s the problem it&#39;&#39;s trying to solve?\n\nEssentially, to allow subclassing of mime-types.  For example, if I have an\nHTML document that follows the HTML 4.01 spec fully and completely but I\nthen add sematic markup which for web service usage what I have is a\nspecialization of HTML, but one that ideally should have it&#39;s own mime-type.\nBut if we given it it&#39;s own mime-type then clients such as browser will no\nlonger recognize it as the legitimate HTML 4.01 document that it still is.\nMime-types have not way to subclass, but having a way to do so would be\nbeneficial.\n\n&gt; Joe points to OpenSearch, which is a generic horizontal \n&gt; content type, and like Atom and iCal deserves to have a MIME \n&gt; type.  I&#39;m putting this out as an example, hopefully a good \n&gt; use case, for a variety of services you&#39;re going to have, \n&gt; each with their own specific semantics and multiple content \n&gt; types.  I just don&#39;t see thousands of MIME types as being a \n&gt; good approach for that, I don&#39;t see what it adds.\n\nI don&#39;t see thousands of MIME types being good either.  But what I see as\nworse is a people using generic mime for specialized uses types masquerading\nas being generic so they can avoid re-using a specialized mime-type or\nregistering a new mime-type.  That&#39;s the problem with software in general;\nit&#39;s too easy to create some only slightly different implementation so most\nprogrammers create lots of only slightly different implementations rather\nthan come together to use the same.  Sure the latter does happen, but the\nformer happens far more often. If having to go through the extra effort of\nregistering a mime-type, If it can become a recognized best practice to\neither re-use existing specialized mime-type or register a new mime-type\nthen we can demonized those who don&#39;t just like the CSS-advocates have\ndemonized table users and then maybe we can solve this problem.  But for\nsomeone to just use a generic mime-type for a specialized use without\nofficially recognizing that they are dealing with a specialize use is in\nfact rationalizing that they don&#39;t want to go to the effort to do it right\nand find an existing appropriate mime type or register a new one.\n\nBTW, I find it ironic that Joe advocates for either reusing mime types\nand/or registering all new mime-types (which I think is wise) while at the\nsame time he recommends using Atom for specialized tasks which to me is the\nantithesis of what he advocates.\n\n&gt; /attachments/updated is an entry point, so there&#39;s a URL \n&gt; template for it.  In fact, I don&#39;t have a use case for \n&gt; navigating to /attachments/updated, only for using it in \n&gt; things like batch processing, so there&#39;s no way to navigate \n&gt; to it, you must start from a URL template.\n&gt; \n&gt; But still no use case for exposing a URL template for \n&gt; accessing a specific attachment directly.\n\nThe use case is from within /attachments/updated itself.\n\n&gt; Proxies are complicated to get right and setup, so I&#39;m not \n&gt; going to mix a proxy server inside the application when a \n&gt; simpler solution would do.  And I like that I can just deploy \n&gt; the app without setting up an existing proxy server, less moving part.\n\nBy proxy I didn&#39;t mean proxy server, I mean proxy within the application. On\na GET to the old URL to a curl to the new URL until the traffic approaches\nzero then retire the old URL.\n\n&gt; I&#39;m still not seeing accidental programmers using JSON in IE, \n&gt; but let&#39;s say they do, \n\nFirebug, and jQuery and things like it lower the bar significantly.  \n\n&gt; and you get the request, double-click \n&gt; the URL, copy and paste it into the address bar.  Still \n&gt; easier that copy and pasting a template, and then copy and \n&gt; pasting an ID into it.\n&gt; \n&gt; Doing things in the address bar like changing an individual \n&gt; ID or traversing the path is, IMO, useful and simple and a \n&gt; good idea for maintaining hierarchy in a lot cases, but not \n&gt; all cases fall into that. Again, going from task to owner&#39;s \n&gt; profile is easier with a link than ID.\n\nI&#39;ve repeated my point about five times but your responses tell me you still\ndon&#39;t what I&#39;ve been trying to say so rather than proving I&#39;m insane by\nexplaining it yet again and expecting a different result, I&#39;m just going to\ngive up trying to explain it.\n\n&gt; I&#39;m looking at two factors here.  Use cases, where definitely \n&gt; brain-dead trumps any conceptual integrity, which is why I \n&gt; think committing to mallable URL templates is better than \n&gt; forcing navigation from a single URL on everything.\n\nAgreed.\n\n&gt; But also cost or production.  If it&#39;s too complex it won&#39;t \n&gt; happen, and simplifying something that doesn&#39;t exist is \n&gt; pointless.  Making states accessible from multiple mallable \n&gt; URLs is some times a burden, and doing it as a matter of \n&gt; practice is premature optimization.  YAGNI.\n\nMaking the leap that it is indeed premature, then yes.\n\n&gt; If a feature has a cost, it&#39;s easier to justify adding it \n&gt; once you have enough clients as evidence for its need, then \n&gt; adding it up front possibly not completing the projects and \n&gt; having zero clients not using the non-existent feature.  \n&gt; ...\n&gt; Now, it&#39;s quite possible that a compelling use case does \n&gt; exist, it may be the one you suggest, or even one neither of \n&gt; us imagined, and then it will be added and the implementation \n&gt; will have to deal with it.  My point was to illustrate a \n&gt; place where templates are a cost and the benefit is not \n&gt; apparent.  If that&#39;s the case as a developer I would prefer \n&gt; to delay this feature until the benefit becomes apparent.\n\nFeatures and architectures are two different things.  I&#39;ve been discussing\narchitecture, not features, all along.\n\n&gt; The \n&gt; moment we have to bring up things like rewrites and proxies, \n&gt; there&#39;s a cost involved.\n\nYou don&#39;t worry about rewrites and proxies until later when you forced\nyourself to change URL paths and parameters, for which IMO most of the time\nit&#39;s not really necessary anyway.\n\nAnyway, I&#39;m really tired of debating. We&#39;ve been debating for going on 3-4\ndays now and we are really just going round-and-round wasting our own time\nand other&#39;s inbox space.  If you want to do something productive like define\nan abstract model and some implementations for services let&#39;s do it,\notherwise find something else to do with your time and I&#39;ll go off and work\non the abstract model and some implementations on my own and/or with others.\nIf you feel compelled to counterpoint me yet again, feel free but for\nother&#39;s sake I&#39;ll do my best not to reply if you do.\n\n-- \n-Mike Schinkel\nhttp://www.mikeschinkel.com/blogs/\nhttp://www.welldesignedurls.org\nhttp://atlanta-web.org \n\nP.S. You really should fix your blog to work on IE7; as is it won&#39;t display\nanything but an error.\n\n\n"}}