{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":279478415,"authorName":"amsmota","from":"amsmota &lt;amsmota@...&gt;","profile":"amsmota","replyTo":"SENDER","senderId":"0LtCcQt0IMENu7Uz56Fz2vFivApQs5YhoIRYrMzIKe7sCQUTeDCKuFSCqxiW1tm0bifY2G74xSO23jO3eVgSuYeA","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] Re: REST with non-HTTP protocols","postDate":"1201599098","msgId":10335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3OUVGMjdBLjcwOEBnb29nbGVtYWlsLmNvbT4=","inReplyToHeader":"PGZubDBuaStpNDM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGZubDBuaStpNDM3QGVHcm91cHMuY29tPg=="},"prevInTopic":10333,"nextInTopic":0,"prevInTime":10334,"nextInTime":10336,"topicId":10323,"numMessagesInTopic":5,"msgSnippet":"Hi. Thanks for your insightful answer. Note that I said I m not an architect , mainly because I think architects belongs to... architecture. I m a","rawEmail":"Return-Path: &lt;amsmota@...&gt;\r\nX-Sender: amsmota@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 36778 invoked from network); 29 Jan 2008 09:29:05 -0000\r\nX-Received: from unknown (66.218.67.97)\n  by m57.grp.scd.yahoo.com with QMQP; 29 Jan 2008 09:29:05 -0000\r\nX-Received: from unknown (HELO fg-out-1718.google.com) (72.14.220.155)\n  by mta18.grp.scd.yahoo.com with SMTP; 29 Jan 2008 09:29:05 -0000\r\nX-Received: by fg-out-1718.google.com with SMTP id d23so2097296fga.30\n        for &lt;rest-discuss@yahoogroups.com&gt;; Tue, 29 Jan 2008 01:29:04 -0800 (PST)\r\nX-Received: by 10.82.153.5 with SMTP id a5mr11040780bue.9.1201598943826;\n        Tue, 29 Jan 2008 01:29:03 -0800 (PST)\r\nReturn-Path: &lt;amsmota@...&gt;\r\nX-Received: from ?10.44.18.194? ( [62.77.174.196])\n        by mx.google.com with ESMTPS id 32sm15427295nfu.7.2008.01.29.01.29.00\n        (version=TLSv1/SSLv3 cipher=RC4-MD5);\n        Tue, 29 Jan 2008 01:29:00 -0800 (PST)\r\nMessage-ID: &lt;479EF27A.708@...&gt;\r\nDate: Tue, 29 Jan 2008 09:31:38 +0000\r\nUser-Agent: Thunderbird 2.0.0.9 (Windows/20071031)\r\nMIME-Version: 1.0\r\nTo: ddwoske &lt;don.dwoske@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nReferences: &lt;fnl0ni+i437@...&gt;\r\nIn-Reply-To: &lt;fnl0ni+i437@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: amsmota &lt;amsmota@...&gt;\r\nSubject: Re: [rest-discuss] Re: REST with non-HTTP protocols\r\nX-Yahoo-Group-Post: member; u=279478415; y=xrdG_tx7A6P32PNQK0MVj6AqcY4G6iva6W-B2tEdW4JSaQ\r\nX-Yahoo-Profile: amsmota\r\n\r\nHi.\n\nThanks for your insightful answer. Note that I said I&#39;m not an \n&quot;architect&quot;, mainly because I think &quot;architects&quot; belongs to... \narchitecture. I&#39;m a programmer in the sense that I write computer \nprograms and I&#39;m a analyst in the sense that I analyse real-world \nproblems, their processes and interactions, from a logical point of view \nand come up with solutions to those problems using logical processes \nthat are usually implemented with computers. That&#39;s all what I am.\n\nNow in trying to solve a couple of problems we have in interacting with \nour customers, I have the &quot;feeling&quot; that using a REST approach will be \nthe better solution. But although I do have experience in &quot;architecting&quot; \nsome kind solutions, in the sense of &quot;putting things together&quot;, it is \nthe first time I apply the REST principles to it. Now some of the \nprinciples behind the REST principles are nothing new, so I think I can \ngrasp it&#39;s essence. But since &quot;feeling&quot; is not enough in presenting \nsolutions to my team, I&#39;m trying to get some general &quot;use cases&quot; of how \nother people implemented the REST principles in services &quot;architecture&quot;, \nso I can take then as rules of thumb.\n\nI don&#39;t want someone to say - so you have this and want that? ok, use \nthis and this and this. If that was the case we can bring someone to do \nthat, yes. I want people to say - well, as a general rule you should do \nthis and this, and in my particular experience I&#39;ve done this and that.\n\nThat it was, in fact, what your answer does, for which I&#39;m grateful.\n\nCheers.\n\n\n \n\n\nddwoske wrote:\n&gt;\n&gt; You&#39;ve said many times that you have little experience with these\n&gt; kinds of architectures. Ditto for your boss.\n&gt;\n&gt; It sounds like you don&#39;t have the right people on your team in\n&gt; order to make this project successful. I&#39;m not sure how important\n&gt; what you&#39;re doing is - maybe you can afford to make major blunders\n&gt; along the way while you&#39;re learning. But from a business perspective,\n&gt; it doesn&#39;t sound like you have the &quot;right people on the bus&quot;, as Jim\n&gt; Collins might say.\n&gt;\n&gt; I read quickly your posts and tried to get an understanding of what\n&gt; it is you are trying to do, and I&#39;m still not entirely clear. But, \n&gt; this little\n&gt; bit says a lot :\n&gt;\n&gt; &gt;We are going to use, for sure, at least HTTP, JMS, POP and FTP. And for\n&gt; &gt; all those I have to have Monitoring and Traceability. So I don&#39;t see \n&gt; how\n&gt; &gt; can I have this without a centralized piece of software, either a \n&gt; ESB or\n&gt; &gt; at least some kind of Queue (ActiveMQ maybe).\n&gt;\n&gt; My first recommendation is to hire someone from the outside to come\n&gt; in and look at what you are trying to do and make some recommendations.\n&gt; The amount of information you&#39;ve given us is a good start, but it really\n&gt; requires more than just a few postings on a message board to figure out\n&gt; exactly what solution is best for you. What are all these services, \n&gt; what are\n&gt; they doing, why do you want them to be unified in any way, what&#39;s the\n&gt; business goal?\n&gt;\n&gt; Several different solutions come to my mind from what I&#39;ve read so\n&gt; far of your posts, and there isn&#39;t a good way to distinguish between\n&gt; them (or others) without some kind of long-running\n&gt; conversation.\n&gt;\n&gt; Basic goal of any system :\n&gt;\n&gt; 1. Keep it simple. Simple things tend to work, and\n&gt; really simple things tend to work really well. (Adam Bosworth)\n&gt;\n&gt; In my mind, REST and HTTP are pretty simple. The internet works. Just \n&gt; about\n&gt; any language can consume HTTP services, Atom or RSS feeds, XML messages.\n&gt; Start with those things and see how far you get.\n&gt;\n&gt; Tracing and monitoring of web sites is pretty clear, as others have \n&gt; said. There\n&gt; are lots of open source tools to do such things. Take a look at\n&gt; http://www.tildeslash.com/monit/ &lt;http://www.tildeslash.com/monit/&gt; \n&gt; for one such tool.\n&gt;\n&gt; You can have distributed traceability, each system uses a logging package\n&gt; which logs to a central database, or better yet (in some ways) have\n&gt; each process/service provide an atom feed of log entries which\n&gt; are then consolidated in a single stream by an aggregator.\n&gt;\n&gt; If your systems are critical and performance and uptime are very \n&gt; important,\n&gt; you may want some other kind of solution - like coding as much as\n&gt; possible in Erlang over a distributed network. Erlang has a great history\n&gt; with building fault-tolerant distributed systems, has failure notification\n&gt; of processes built-in, and many other things.\n&gt;\n&gt; An important part of REST is providing a uniform interface to all \n&gt; services.\n&gt; If you are dealing with many types of different protocols, FTP,\n&gt; POP, HTTP, etc.. you should consider providing a uniform and \n&gt; well-understood\n&gt; way of accessing *all* of those using the same interface or protocol.\n&gt;\n&gt; You may want to look at the 9P (or Styx) protocol which is in heavy use\n&gt; in Plan 9 and Inferno. It is accidentally very RESTful. Look for Plan 9\n&gt; documents on 9P or Inferno Styx. For Java, you will\n&gt; find JStyx :\n&gt;\n&gt; http://www.resc.rdg.ac.uk/jstyx/ &lt;http://www.resc.rdg.ac.uk/jstyx/&gt;\n&gt;\n&gt; You could also possibly configure all your servers as grid processes and\n&gt; use grid tools for monitoring and tracing, and perhaps workflow if\n&gt; you need it. Grids give you a central way to deploy, execute, and monitor\n&gt; a variety of processes. You&#39;ll find some grid information on that\n&gt; JStyx site, and also on the Inferno page.\n&gt;\n&gt; http://www.vitanuova.com/grid/ &lt;http://www.vitanuova.com/grid/&gt;\n&gt;\n&gt; This also brings to mind the Microsoft Robotics Platform, which is very\n&gt; RESTful, and could allow you to control and montitor your processes as\n&gt; well. Probably that&#39;s too much of a stretch for a Java-based team, and\n&gt; the Platform takes a bit of digging into.\n&gt;\n&gt; As a final note, it&#39;s my opinion that ESB products are not needed \n&gt; (usually), stick\n&gt; to commonly used protocols and data formats. As a final, final note,\n&gt; REST doesn&#39;t solve every problem elegantly, and neither does anything\n&gt; else - it depends on the problem. I just don&#39;t know your problem well\n&gt; enough to recommend one architecture over another.\n&gt;\n&gt; But, I would put forth that you use REST as a starting point and\n&gt; rule it out when you find some aspect of the problem that doesn&#39;t\n&gt; fit within it&#39;s contraints.\n&gt;\n&gt; Cheers,\n&gt; -d-\n&gt;\n&gt; --- In rest-discuss@yahoogroups.com \n&gt; &lt;mailto:rest-discuss%40yahoogroups.com&gt;, amsmota &lt;amsmota@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Following my other post about REST + ESB (or should I say REST _minus_\n&gt; &gt; ESB), I started looking for resources about creating RESTfull services\n&gt; &gt; with endpoints not based on HTTP, but I couldn&#39;t find any.\n&gt; &gt;\n&gt; &gt; Mainly, all the resources I&#39;ve seen so far says something like &quot;REST is\n&gt; &gt; protocol independent, but for the sake of simplicity let&#39;s talk about\n&gt; &gt; HTTP only&quot;...\n&gt; &gt;\n&gt; &gt; My plan now was to try to convince my team leader to give me 1.5 \n&gt; week so\n&gt; &gt; I can write a very simple application (probably in Java) and enable it\n&gt; &gt; to be invoked directly by two different kind of connectors (HTTP and\n&gt; &gt; email probably). And then try to do the same with (probably) Mule in \n&gt; the\n&gt; &gt; middle. And see what&#39;s simpler.\n&gt; &gt;\n&gt; &gt; So I know how to do it with HTTP (actually several ways come to my \n&gt; mind)\n&gt; &gt; and I know how I&#39;ll do it from some of the other protocols if it was \n&gt; RPC\n&gt; &gt; app, or a intra-VM app, but I can&#39;t understand how to do it in a\n&gt; &gt; RESTfull way and without a ESB.\n&gt; &gt;\n&gt; &gt; Probably I&#39;m not seeing this right and probably the best solution *is*\n&gt; &gt; to use a ESB?\n&gt; &gt;\n&gt; &gt; Thanks all for your cooperation.\n&gt; &gt;\n&gt;\n&gt;  \n\n\n"}}