{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":217975397,"authorName":"Tyler Close","from":"&quot;Tyler Close&quot; &lt;tyler.close@...&gt;","profile":"tjclose","replyTo":"SENDER","senderId":"ANUHpzu1U96M1v_YkOfkooWdRvTKAMw2ax4Ewdx5Ekk7513wzEb_5krBg0g76Fw6jMDPBmod61SQC1o6t2GoHN4SPEyIMl-2JuRlTQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"W3C Working Group on Cross-Domain requests needs your feedback","postDate":"1201551660","msgId":10330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2OTEzNTZmMDgwMTI4MTIyMXc1ZmU3ODdlMXE3ZGM5Y2I5YzU0NjQxMzZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":10334,"prevInTime":10329,"nextInTime":10331,"topicId":10330,"numMessagesInTopic":4,"msgSnippet":"Hi all, The Web Applications Format Working Group is currently finishing up design work on a specification for Cross-Domain requests in the browser that could","rawEmail":"Return-Path: &lt;tyler.close@...&gt;\r\nX-Sender: tyler.close@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 64659 invoked from network); 28 Jan 2008 20:21:00 -0000\r\nX-Received: from unknown (66.218.67.94)\n  by m46.grp.scd.yahoo.com with QMQP; 28 Jan 2008 20:21:00 -0000\r\nX-Received: from unknown (HELO rv-out-0910.google.com) (209.85.198.190)\n  by mta15.grp.scd.yahoo.com with SMTP; 28 Jan 2008 20:21:00 -0000\r\nX-Received: by rv-out-0910.google.com with SMTP id l15so1420571rvb.24\n        for &lt;rest-discuss@yahoogroups.com&gt;; Mon, 28 Jan 2008 12:21:00 -0800 (PST)\r\nX-Received: by 10.140.133.10 with SMTP id g10mr3738558rvd.151.1201551660100;\n        Mon, 28 Jan 2008 12:21:00 -0800 (PST)\r\nX-Received: by 10.141.37.5 with HTTP; Mon, 28 Jan 2008 12:21:00 -0800 (PST)\r\nMessage-ID: &lt;5691356f0801281221w5fe787e1q7dc9cb9c5464136@...&gt;\r\nDate: Mon, 28 Jan 2008 12:21:00 -0800\r\nTo: &quot;Rest List&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Tyler Close&quot; &lt;tyler.close@...&gt;\r\nSubject: W3C Working Group on Cross-Domain requests needs your feedback\r\nX-Yahoo-Group-Post: member; u=217975397; y=tnQpGwY-NB7Kh0qpgnuqGri2XK6BnnlvaSZFnOgrB0RD0g\r\nX-Yahoo-Profile: tjclose\r\n\r\nHi all,\n\nThe Web Applications Format Working Group is currently finishing up\ndesign work on a specification for Cross-Domain requests in the\nbrowser that could have a significant impact on the design of future\nweb applications. I believe the WG&#39;s current proposal puts REST\ndesigns at a significant disadvantage. The Working Group will be\ntaking up this issue in its weekly teleconference this Wednesday and I\nhope feedback from the members of this mailing list might help\ncommunicate the importance of this issue for web developers.\n\nCurrently, the Same Origin Policy limits the ways in which a web page\nserved by one site, Site A, can communicate with resources hosted on a\nseparate site, Site B. The WG aims to provide a way for Site B and the\nbrowser to agree on a loosening of these restrictions. For example,\ngiven the consent of Site B, the browser would allow a page from Site\nA to receive the response to a GET request on a resource hosted by\nSite B. Similarly, the page from Site A would be allowed to send an\narbitrary POST to a resource hosted by Site B and receive the\nresponse.\n\nEssentially, the WG&#39;s current proposal is for the server to express a\ncross-domain request policy (XDRP) for each hosted resource. Before\nsending a cross-domain, non-GET request to a particular resource, the\nweb browser must query that resource&#39;s XDRP and enforce any expressed\nconstraints. For more detail, please refer to the the WG&#39;s current\ndraft proposal &lt;http://dev.w3.org/2006/waf/access-control/&gt;.\n\nOne of the problems with this design is that there is a mandatory\nnetwork round-trip to fetch the XDRP for a resource before the browser\ncan begin communicating with that resource. Essentially, there&#39;s a one\nnetwork round-trip penalty for each distinct URI a web application\nuses. For example, consider the effect of this design on a mashup that\nuses the ATOM protocol to communicate with another site. When creating\na new member resource, the server sends the client a distinct URI\nidentifying the resource. In essence, the server is saying: &quot;Send your\nupdates here&quot;. But before sending a PUT request to the specified URL,\nthe mashup application must first send a request for the XDRP, in\neffect asking permission to use the resource it was just told to use.\nThe same happens for each distinct URL the client uses. The result is\na tragically comical network protocol in which the client repeatedly\nasks permission to do what the server just told the client it could\ndo.\n\nI&#39;ve pointed out this problem to the WG and the response from one of\nthe main contributors to the specification was:\n\nIan Hickson wrote:\n&gt; I do not believe that we should change the API to optimise for the one\n&gt; case of an API that involves a lot of non-GET requests to unique\n&gt; resources. It is trivial to optimise the server&#39;s protocol in\n&gt; this case\n&gt; anyway (just use one URI and put the parameters in the body), and this\n&gt; more closely matches what most people will be doing anyway.\n\nSee: &lt;http://lists.w3.org/Archives/Public/public-appformats/2008Jan/0297.html&gt;\n\nMembers of this mailing list may see a similarity between this\nproposed design advice and the long-ago discussions about the design\nof SOAP where requests are all sent to a single URL and the actual\ntarget resource is identified by arguments in the message body.\n\nI also pointed out that this design advice discourages use of URIs,\nwhereas webarch encourages use of URIs. The reply was *only*:\n\nIan Hickson wrote:\n&gt; I disagree with much of Web Arch.\n\nSee: &lt;http://lists.w3.org/Archives/Public/public-appformats/2008Jan/0299.html&gt;\n\nGoing forward, it seems likely that an important measure of the design\nquality of a web application will be how well it works in a mashup.\nMany designs that a REST proponent may favour involve heavy use of\nURIs. Under the WG&#39;s current proposal, these designs will be penalized\nwith a network round-trip for each distinct URI. The proposal&#39;s main\ndesigner dismisses this design style. The WG&#39;s editor sees this issue\nas only a &quot;quibble&quot;:\n\nSee: &lt;http://lists.w3.org/Archives/Public/public-appformats/2008Jan/0306.html&gt;\n\nMark Nottingham and I have proposed an alternate design for\ncross-domain requests that does not have these performance problems\nand negative design pressures. Essentially, the alternate proposal\nasks the host, instead of each resource, if it is willing to accept\ncross-domain requests. If so, these requests are then so labeled, in\nthe same way as the WG currently proposes. The task of enforcing a\nper-resource policy is then managed solely by the host. Under such a\ndesign, there is one network round-trip before requests begin to flow,\nbut it is one round-trip per host, not per resource. This way there is\nno penalty for heavy use of URIs. To date, the WG has rejected\npursuing such a design.\n\nThis design discussion is also taking place under the time pressure of\nthe Firefox 3 release, which plans to implement the WG&#39;s current\nproposal. Should this release happen, this topic may be a done deal.\nJonas Sicking seems to be the Mozilla representative participating on\nthis WG.\n\nIn my opinion, the WG&#39;s current proposal would have a negative impact\non the viability of REST design on the Web. I think members of this\nmailing list should consider these issues and make their voices heard\non the WG&#39;s mailing list for public feedback. Before posting to this\nlist, you must first subscribe by sending an email to:\n\nmailto:public-appformats-request@...?subject=subscribe\n\nHopefully, significant feedback from this community will positively\ninfluence the discussion of these issues in Wednesday&#39;s telecon.\n\n--Tyler\n\n"}}