{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"SZLZQayUGKPMqt51r-RN5UZhdmA8SziwAysPkjpdG6tW5oitfQKkTj-YF0s36k4lnMuFMjLtN-BrzkhiTkaVeoPDAJUE4bAx2_nEfrNIxA","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] auto-discovery of multiple representation types","postDate":"1210859158","msgId":10782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDgwNTE1MDc0NTU4Ljg5MjVhODA4LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","inReplyToHeader":"PEJMVTEwMi1EUzVDOTM0QjdGNjM1RThENzY4OThEOEI1QzkwQHBoeC5nYmw+","referencesHeader":"PGFiMDY5YWEwMDgwNTA5MTgxOXE2NzQ4MTg1M3NiYTliNmViZTU2NGE0ZDA3QG1haWwuZ21haWwuY29tPgk8Nzk5MzMwYzMwODA1MDkyMzQzbDMxYzgzMTQwc2Q2MDFjMWFhNjdjNDJjNGFAbWFpbC5nbWFpbC5jb20+CTxiNTQ4ZGY2NTA4MDUxMDA3MjloNWJiMTVmMzRnZDA0NTVlNzdmYWFiMzZmNkBtYWlsLmdtYWlsLmNvbT4JPDc5OTMzMGMzMDgwNTEwMDg0OHQ3MzJlZDgyYmsxYjVjYThhNzAxYTgxYTE1QG1haWwuZ21haWwuY29tPgk8QkxVMTAyLURTMkNBNDlDNThDMEI2OTY2RTQ5RTg5QjVDRDBAcGh4LmdibD4JPDIwMDgwNTEzMDU0MTIxLjZlOGJkZmQ0LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPEJMVTEwMi1EUzVDOTM0QjdGNjM1RThENzY4OThEOEI1QzkwQHBoeC5nYmw+"},"prevInTopic":10781,"nextInTopic":10783,"prevInTime":10781,"nextInTime":10783,"topicId":10763,"numMessagesInTopic":22,"msgSnippet":"... Your terminology is a bit confusing.  A resource is not served by a webserver, only representations are.  A resource has an identifier, which a webserver","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 42406 invoked from network); 15 May 2008 13:45:59 -0000\r\nX-Received: from unknown (66.218.67.95)\n  by m54.grp.scd.yahoo.com with QMQP; 15 May 2008 13:45:59 -0000\r\nX-Received: from unknown (HELO mxout-03.mxes.net) (216.86.168.178)\n  by mta16.grp.scd.yahoo.com with SMTP; 15 May 2008 13:45:59 -0000\r\nX-Received: from BigBison (unknown [65.117.211.162])\n\t(using TLSv1 with cipher DHE-RSA-AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\tby smtp.mxes.net (Postfix) with ESMTP id 25C7123E3EF;\n\tThu, 15 May 2008 09:45:57 -0400 (EDT)\r\nDate: Thu, 15 May 2008 07:45:58 -0600\r\nTo: &quot;Sebastien Lambla&quot; &lt;seb@...&gt;\r\nCc: &lt;rest-discuss@yahoogroups.com&gt;\r\nMessage-Id: &lt;20080515074558.8925a808.eric@...&gt;\r\nIn-Reply-To: &lt;BLU102-DS5C934B7F635E8D76898D8B5C90@...&gt;\r\nReferences: &lt;ab069aa00805091819q67481853sba9b6ebe564a4d07@...&gt;\n\t&lt;799330c30805092343l31c83140sd601c1aa67c42c4a@...&gt;\n\t&lt;b548df650805100729h5bb15f34gd0455e77faab36f6@...&gt;\n\t&lt;799330c30805100848t732ed82bk1b5ca8a701a81a15@...&gt;\n\t&lt;BLU102-DS2CA49C58C0B6966E49E89B5CD0@...&gt;\n\t&lt;20080513054121.6e8bdfd4.eric@...&gt;\n\t&lt;BLU102-DS5C934B7F635E8D76898D8B5C90@...&gt;\r\nOrganization: Bison Systems Corporation\r\nX-Mailer: Sylpheed 2.4.5 (GTK+ 2.10.14; i686-pc-mingw32)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nSubject: Re: [rest-discuss] auto-discovery of multiple representation types\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nSebastien Lambla wrote:\n&gt; \n&gt; So I&#39;d say quite clearly that no, RDF is definitely not a\n&gt; representation of a resource, but a resource about a resource.\n&gt; \n\nYour terminology is a bit confusing.  A resource is not served by a\nwebserver, only representations are.  A resource has an identifier,\nwhich a webserver maps to a set of representations.  An RDF document is\na representation of a resource, even if its content describes some other\nresource (or resources), it is still a resource in its own right if it\nhas an URL.\n\nGiven URL A file.html, URL B file.rdf, and a negotiated URI C, file.\nDepending on how the RDF is written, both A and B could easily be\nrepresentations of C (each returned in Content-Location).  Or, B may\njust make assertions about A, in which case it is not a representation\nof C and would not appear in Content-Location when C is dereferenced.\n\nIn that case, where B is a resource which makes assertions about A,\ndereferencing B returns an RDF representation of B.  If you can\ndereference it over the Web, it&#39;s a representation, even if it&#39;s RDF.\n\n&gt; \n&gt; Actually, the whole concept of an RFC is to document something at\n&gt; some point in time. Just because the authors of an RFC would have\n&gt; included something but didn&#39;t have the time, or were thinking very\n&gt; loud about it doesn&#39;t make it part of an RFC. A written law applies\n&gt; based on the text, not on what someone had in his head.\n&gt; \n\nExactly, and that&#39;s why RFC 2068 serves as the foundation of WebDAV,\nthat was the state of HTTP 1.1 at the time WebDAV was finalized.  Thus\nwere the PATCH method and Link header, etc. written into law...\n\n&gt;\n&gt; Expecting people to &quot;know&quot; what the authors were thinking in an RFC is\n&gt; fallacious and unreasonable. If something was left out of a spec for\n&gt; practical reasons or lack of time, the solution is to update the RFC\n&gt; or create a new one. \n&gt; \n\nI will grant that RFCs are an imperfect solution, but I won&#39;t argue\nwith their success either.  You realize there are errors in RFC 2616,\nright?  That doesn&#39;t mean you really MUST NOT cache 303 responses, in\nslavish devotion to the letter of the law.  Absolute law is the\nantithesis of trial by jury, and I think some folks are seeing a similar\nlevel of constraint in RFCs that was never the intent of the IETF.\n\nBut, the cachability of 303 responses despite what the spec says, is\nsomething you have to just &quot;know&quot; by reading the spec authors&#39;\nresponses to feedback concerning the issue (or by asking them outright).\nNo system is perfect.\n\n&gt; \n&gt; &gt; [...] That&#39;s why\n&gt; &gt; the debate is about *uniform* access to metadata, the whole idea is\n&gt; &gt; to _not_ restrict linking to metadata, to only a select few media\n&gt; &gt; types. I don&#39;t see that as a requirement of HTTP or REST, or of any\n&gt; &gt; pragmatic concern.  Please refer to Roy&#39;s post [1], there is a\n&gt; &gt; difference between redirected conneg and true conneg.  Whether\n&gt; &gt; we&#39;re talking about multiple languages or multiple anything else, a\n&gt; &gt; negotiated redirect makes no assertion that the target is part of\n&gt; &gt; the set of representations for the requested resource.\n&gt; \n&gt; httpRange-14 makes no such distinction: it specifies that a 200 means\n&gt; that you&#39;re faced with a document. And it says that anything that\n&gt; returns a 303 could be anything at all.\n&gt; \n\nA resource can be anything, an IR is limited to documents which may be\ndereferenced using HTTP.  A person can&#39;t be identified by the same URI\nthat identifies a document about that person.  The person is a\nresource, the document is an IR, using the same URI for both is a\ncollision because they are not the same resource.\n\nMy interpretation of httpRange-14, is that if the URI identifies a\nperson then it MUST NOT return 200 OK, at all, ever.  I do not take\nthis to mean that if a URI identifies a document it MUST NOT return\n303, at all, ever.\n\n&gt;\n&gt; Without a redirection, by httprange-14 you make the assertion that\n&gt; what you requested *is* an awww-IR, aka a document, that may have\n&gt; several representations, *because* you get a 200.\n&gt; \n\nRight.  An IR has a set of representations.  But this set is not\nrestricted to 200 OK responses, nor does httpRange-14 disallow 303\nrepresentations to be included in the set for that IR.\n\n&gt;\n&gt; So to answer your question, if when you dereference /customer with\n&gt; Accept: application/rdf+xml you get a 200, /customer is *not* a\n&gt; customer or a thing, it *is* a document. With a redirect, you make no\n&gt; assertion on /customer at all, you redirect to /customer.rdf, which\n&gt; when dereferenced returns a 200: the rdf *is* a doucument about\n&gt; something, you just don&#39;t know what about until you parse the rdf.\n&gt; \n\nIf, from my example above, B is dereferenced and responds 200 OK then\nyou know that file.rdf is a representation of resource B.  Yes, it must\nbe parsed to determine its relationship to A.  If C is dereferenced as\n&#39;application/rdf+xml&#39; and 303-redirects to B in response, it tells you\nabsolutely nothing.\n\nAnd that is a problem, ideally there would be some means of labeling a\n303 response as part of a set, instead of the only response possible,\nto disambiguate whether the resource is a document or a thing...  Ah,\nbut there is, RFC 2068&#39;s Alternates header -- if it&#39;s present then the\nresource is most likely an IR, if it&#39;s absent the resource is most\nlikely a thing.\n\n&gt;\n&gt; &gt; If we can define a resource as &quot;404 response page&quot; we can serve a\n&gt; &gt; representation of it anywhere we need to.  In which case, the\n&gt; &gt; request for a nonexistent resource returns a representation of some\n&gt; &gt; other resource, i.e. &quot;404 response page&quot;.  The 404 response message\n&gt; &gt; body isn&#39;t a representation of the requested resource, but the 404\n&gt; &gt; response itself is.\n&gt; \n&gt; I don&#39;t see the point you&#39;re making.\n&gt;\n\nThe point I&#39;m trying to make, is that the set of representations for a\nresource is not limited to 200 OK responses.  I probably should have\nused 406 and 503 as examples.  A 406 representation comes about when\nthere&#39;s no representation matching the Accept headers sent by the\nclient.  A 503 response is a temporal member of the resource&#39;s set of\nrepresentations.  Neither one may be taken to mean the resource is or\nis not a document -- reloading may yield a 200 OK.\n\n&gt; \n&gt; &gt; 303 and 404 representations of a requested URI\n&gt; &gt; indicate the value of _some other resource_.\n&gt; \n&gt; Now you&#39;re confusing me, how can a return code be considered a\n&gt; representation? It&#39;s teh result of dereferencing, it&#39;s not a\n&gt; representation of anything.\n&gt; \n\nIf you&#39;re looking at a 503 response page, you&#39;re looking at a\nrepresentation of the dereferenced resource.  The response code, is\npart of the representation.  Quoting REST again:\n\n&quot;REST components perform actions on a resource by using a\nrepresentation to capture the current or intended state of that\nresource and transferring that representation between components. A\nrepresentation is a sequence of bytes, plus representation metadata to\ndescribe those bytes.&quot;\n\nA 503 response, is a representation of the state of the dereferenced\nresource, i.e. &quot;busy - check back later&quot;.  The sequence of bytes\nreturned in response to the request, is defined as a representation of\nthe requested resource.  The set of temporally varying representations\nof the requested resource, temporarily includes a 503 response in such\na case.\n\n&gt; \n&gt; Let&#39;s put it back into context of what the original question was:\n&gt; \n&gt; =====\n&gt; It&#39;s possible to use content negotiation for an aspect of the\n&gt; exchange.  If the metadata and multimedia were considered different\n&gt; representations of the same resource, they could be distinguished by\n&gt; media type and fetched separately by using the Accept header.\n&gt; =====\n&gt; \n&gt; So I will stand by my previous explanation:\n&gt; 1. Metadata about a resource is *not* a representation of that\n&gt; resource. It&#39;s something else.\n&gt;\n&gt; 2. If you 303, you distinguish by *url* because you redirect somewhere\n&gt; \n&gt; Fundamentally, it comes down to what the url you&#39;re dereferencing is:\n&gt; a. it&#39;s a document, because you got a 200 using any combination of\n&gt; headers. You now *know* that this is a document and not an IR. So\n&gt; when you return a 303 from /customer.html because it has an Accept&quot;\n&gt; application/xml+rdf, you say that querying a document with Accept:\n&gt; application/rdf+xml has a response at another location. To me this is\n&gt; wrong, and exactly what the Link: header should cover. \n&gt;\n\nOK, I think I see what you&#39;re saying.  Responding 406 with a Link\nheader is preferable to a 303 response?  Maybe.  Maybe not.  Reasonable\npeople may disagree on this point, as allowed by the spec:\n\nhttp://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4.7\n\nI would suggest that if a client is using q=0 in the Accept headers,\nthen a 406 with a Link header is the most appropriate response.\nHowever, 4xx responses indicate failure due to an error on the client&#39;s\npart, was it really so wrong of the client to request RDF for the\nresource?  Bad client!  Very bad client!  ;-)  No, I don&#39;t think so.\n\nServers are allowed to return 303 in such a case, and a 303 response\ncould even include multiple Link headers if there are multiple\nresources which describe the requested resource.  I don&#39;t see the need\nto rule this out, &quot;confusion&quot; is far too subjective a reason to forbid\na practice which doesn&#39;t break Web architecture and accomplishes the\nsame goal, for the restrictive sake of having only one anointed method.\n\n&gt;\n&gt; b. It&#39;s a thing as far as you know, because you have no known 200\n&gt; response when dereferencing. Again it&#39;s a fragile assertion to make,\n&gt; but in that case the 303 return is more acceptable.\n&gt; \n\nIf I get a 303 response, then as far as I know it could be anything.\nIf that 303 response has an Alternates header then I&#39;m pretty sure an\nIR was dereferenced, and I have a list of URLs to check for 200 OK\nresponses to confirm that suspicion.  Without checking, or without an\nAlternates header, then I can&#39;t assume it&#39;s a thing, parsing is\nrequired.\n\n-Eric\n\n"}}