{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":175757792,"authorName":"Roy T. Fielding","from":"&quot;Roy T. Fielding&quot; &lt;fielding@...&gt;","profile":"roy_fielding","replyTo":"SENDER","senderId":"yOsDgpiQevoo8TwIUJ7d9kpycrUjlCRm6KkowOtKtq5w2FtO65VbBOG2tMhrSiE9tUYi0AMPzLJxYZ2xzhGKw1v-H9_6OW0LJbzBIQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] What REST constraint forbids centralized link servers?","postDate":"1222557088","msgId":11331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5QTNCNTExLTUwNjUtNDU5MS1BNEY1LTFGRjRCMDlCRjI5RUBnYml2LmNvbT4=","inReplyToHeader":"PGE2YTZkZjM2MDgwOTI3MTQxOGw2YjNmM2JiM3kxZmY3YTA2OTI2ZTQxNWJiQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGE2YTZkZjM2MDgwOTI2MTYyNHgzODYxYjdkZm8zMmEwODA3NjUyMTBjMzBAbWFpbC5nbWFpbC5jb20+IDw5Njg5MjFFMy1BMjE1LTQxQkEtQTE1Ny01MzI5OTVGM0U5MkJAZ2Jpdi5jb20+IDxhNmE2ZGYzNjA4MDkyNzE0MThsNmIzZjNiYjN5MWZmN2EwNjkyNmU0MTViYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":11330,"nextInTopic":11332,"prevInTime":11330,"nextInTime":11332,"topicId":11328,"numMessagesInTopic":6,"msgSnippet":"... Perhaps you should define what you mean by link servers.  The term has been variously used as a single source of unique token to location mappings and/or","rawEmail":"Return-Path: &lt;fielding@...&gt;\r\nX-Sender: fielding@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 60851 invoked from network); 27 Sep 2008 23:11:33 -0000\r\nX-Received: from unknown (66.218.67.97)\n  by m55.grp.scd.yahoo.com with QMQP; 27 Sep 2008 23:11:33 -0000\r\nX-Received: from unknown (HELO spaceymail-a1.g.dreamhost.com) (208.113.200.5)\n  by mta18.grp.scd.yahoo.com with SMTP; 27 Sep 2008 23:11:33 -0000\r\nX-Received: from [192.168.0.137] (ip72-211-200-45.oc.oc.cox.net [72.211.200.45])\n\tby spaceymail-a1.g.dreamhost.com (Postfix) with ESMTP id AB46D806C6;\n\tSat, 27 Sep 2008 16:11:32 -0700 (PDT)\r\nIn-Reply-To: &lt;a6a6df360809271418l6b3f3bb3y1ff7a06926e415bb@...&gt;\r\nReferences: &lt;a6a6df360809261624x3861b7dfo32a080765210c30@...&gt; &lt;968921E3-A215-41BA-A157-532995F3E92B@...&gt; &lt;a6a6df360809271418l6b3f3bb3y1ff7a06926e415bb@...&gt;\r\nMime-Version: 1.0 (Apple Message framework v753.1)\r\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\r\nMessage-Id: &lt;49A3B511-5065-4591-A4F5-1FF4B09BF29E@...&gt;\r\nCc: &quot;Rest Discussion Group&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nContent-Transfer-Encoding: 7bit\r\nDate: Sat, 27 Sep 2008 16:11:28 -0700\r\nTo: Nick Gall &lt;nick.gall@...&gt;\r\nX-Mailer: Apple Mail (2.753.1)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\r\nSubject: Re: [rest-discuss] What REST constraint forbids centralized link servers?\r\nX-Yahoo-Group-Post: member; u=175757792; y=p3gfhwzZygUmz4xRu2MnXRKQ0_rg2DD8kMCL69QWmpq1hNXNdJoh\r\nX-Yahoo-Profile: roy_fielding\r\n\r\nOn Sep 27, 2008, at 2:18 PM, Nick Gall wrote:\n&gt; So does this mean, in a nutshell, that the architectural  \n&gt; constraints that comprise the REST architectural style do NOT rule  \n&gt; out centralized link servers?\n\nPerhaps you should define what you mean by link servers.  The term\nhas been variously used as a single source of unique token to location\nmappings and/or active editing of content to replace relations.\n\nREST constrains that there is a single system for identification of\nresources and that said system identifies resources as a conceptual\nmapping rather than a fixed content mapping.  I am pretty sure one could\nbuild a link server within that constraint, but I doubt that it would\nbe worth the investment.\n\n&gt; If so, I don&#39;t understand locutions such as &quot;REST relies instead&quot;  \n&gt; and &quot;REST designs around&quot;. REST is not an agent (a source of  \n&gt; agency) with a will of its own. Only a (human) designer can &quot;rely&quot;  \n&gt; or &quot;design around&quot;. Correct?\n\nREST is a set of design decisions made at many junctures along\nthe path of the Web.  Most of them were not made by me in any sense\nother than protecting those that worked and discarding those that did\nnot. So, aside from those parts of the architecture that I did design,\nI prefer not to say that &quot;I designed around ...&quot;.  If you have a name\nfor the collective agent that reared its multitude of heads on the\nwww-talk mailing list and other private discussions surrounding the\ncore development teams from 92-95, then be my guest.  We used to call\nthat collective the WWW Project, but it was really more of a loose\ncommunity of like-minded souls with stubborn opinions.\n\nIn any case, REST is an architectural style, which make REST an\nagent of change when adherence to that style is self-imposed.\nYou will find the same grammatical usage in traditional architecture.\n\n&gt; For example, a designer attempting to rigorously follow REST&#39;s  \n&gt; architectural constraints might  nonetheless decide to build a  \n&gt; scalable centralized link server. Such a designer would still  \n&gt; deserve the appellation &quot;RESTful designer&quot; (ie one who faithfully  \n&gt; follows the architectural constraints of REST). Correct?\n\nMaybe (that&#39;s a rather small part of the overall architecture).\nIn any case, it is kind of pointless because the definition of\nresource in REST is specifically designed to reduce the need for\nlink servers [which, traditionally, were intended to maintain\nstrict content relationships and not the abstract resource relations\nthat are found on the Web].\n\n&gt; Or the RESTful designer might try to build a decentralized link  \n&gt; server in the style of DNS. Or finally, the RESTful designer may  \n&gt; leave it up to each DNS-domain owner to maintain the integrity of  \n&gt; links (the approach the thesis recommends).\n\nDNS is not a link server.  A link server manages both endpoints of a\nlink.  A link server that only manages the end point of a link is just\na name resolution server, which is equivalent DNS and a subset of HTTP.\n\n&gt; All of these options are open to one faithfully following the  \n&gt; architectural constraints of REST. A critic of one approach would  \n&gt; have no right to say, &quot;Your centralized link server approach is not  \n&gt; RESTful.&quot; The worst one could say about such a design is, &quot;Well,  \n&gt; while you&#39;ve faithfully followed the architectural constraints of  \n&gt; REST, given the environmental constraints of the actual Web circa  \n&gt; 2008, your approach turns out to be less scalable than the approach  \n&gt; of leaving link forwarding up to the domain owners.&quot;\n&gt;\n&gt; Agreed?\n\nI honestly don&#39;t give a rat&#39;s ass about architectural purity unless\nit achieves a pure purpose.  The purpose of REST is to explain why you\nwant to build it in a certain way given the Web&#39;s own context.  If that\ncontext doesn&#39;t exactly match a new application&#39;s context, then the  \ngoal of\nmy dissertation is to teach people how to think about the problem in  \nterms\nof trade-offs, not in terms of rigid repetition of what works for the  \nWeb.\n\n&gt; Finally, given all this why NOT add a constraint to REST that rules  \n&gt; out centralized link serving (and perhaps other centralized  \n&gt; approaches)? Was the omission of such a constraint intentional?\n\nIt was intentional.  More accurately, the specific change that I made to\nthe definition of resource (and in this case I really do mean &quot;I&quot;) so  \nthat\nit emphasized a conceptual mapping instead of identifying the  \nrepresentation\n(the document returned at some past time) was specifically to obviate  \nthe\nneed (or even desire) for hypertext link servers as described by the\nprevailing hypertext research at the time.  UCI was on the leading  \nedge of\nhypertext research and I was well aware of those systems,  \nparticularly when\nthey claimed they were better than the Web.  The new definition also  \nmatched\nhow people used URIs in practice, which is something I learned in my  \nearly\nresearch with MOMspider when I codified all of the ways that a link  \ncould\n&quot;break&quot; on the Web.\n\nI think you will find that &quot;A resource can map to the empty set, which\nallows references to be made to a concept before any realization of that\nconcept exists&quot; is rather difficult to provide with a link server unless\nyou also remove the integrity provisions (the entire point of having a\nlink server).\n\n&gt; It seems odd that an architectural style so associated with  \n&gt; decentralization does not in fact explicitly constrain against  \n&gt; centralized implementations. I for one was surprise to find that  \n&gt; centralized approaches such as a centralized link server is NOT  \n&gt; ruled out by REST.\n\nIt didn&#39;t have to.  Seriously, it is hard enough defending the  \nconstraints\nthat needed to exist.  There is no reason to include additional stuff  \nlike\n&quot;should not be used as a process control system inside a nuclear  \nreactor.&quot;\n\n....Roy\n\n"}}