{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":210067383,"authorName":"Nick Gall","from":"Nick Gall &lt;nick.gall@...&gt;","profile":"nick_gall_1117","replyTo":"SENDER","senderId":"qLXOFYMvumn7QoRB0OgWNq-Cr4IcMxF6uxl3BQ6HHrSv2tJ8KVUXcm7XOYWyIhEuWqIuSSksVSEaUGIpWkgbzyYB7M8N4g","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] Re: YAATRTA HATEOAS","postDate":"1244516355","msgId":12830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE2YTZkZjM2MDkwNjA4MTk1OXYyM2M3NmEwNnkzNzNjNTdmZjgyYmEyZTU3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEIyMkEwQjEyLUU3OTgtNDMzQi05MTMzLTI5REZGNUU5NTBEMEBnYml2LmNvbT4=","referencesHeader":"PGE2YTZkZjM2MDkwNjA0MDMwMHU1YTBiMjc0MnBkMTdjYmMyNjA3NjQ1MGNiQG1haWwuZ21haWwuY29tPiAJPDRBNjZGM0Y3LTZDMTgtNDRFMi05RDIyLUUyRUYwOUM2N0EzNkB3ZWJiZXIubmFtZT4gPGE2YTZkZjM2MDkwNjA1MDMzM3RjMTE5NDY5djFiNjAyZWJjZWZiMTJkMjFAbWFpbC5nbWFpbC5jb20+IAk8NEEyOEY5MUUuNTA5MDEwOUBnbWFpbC5jb20+IDxCQTBFQkE2Qi00QUY2LTQ5OTYtOEE1NS04M0I1MTkzMTQ0RTRAd2ViYmVyLm5hbWU+IAk8NEEyOTBDRDAuNTA2MDcwNkBnbWFpbC5jb20+IDxhNmE2ZGYzNjA5MDYwNTExMTlqMWUyZDRlZDd3MmI5M2U1ZWQyOGRmNGZjY0BtYWlsLmdtYWlsLmNvbT4gCTw1MzJCRTE1OC0yMTQyLTQ0RUMtQUM1Mi1FODg3RDRBNkI1MDBAZ2Jpdi5jb20+IDxhNmE2ZGYzNjA5MDYwNjAzNDBqNTc3ZmQwMWZ4ZTE2MDdkODQyY2I1YjlhYUBtYWlsLmdtYWlsLmNvbT4gCTxCMjJBMEIxMi1FNzk4LTQzM0ItOTEzMy0yOURGRjVFOTUwRDBAZ2Jpdi5jb20+"},"prevInTopic":12821,"nextInTopic":0,"prevInTime":12829,"nextInTime":12831,"topicId":12730,"numMessagesInTopic":56,"msgSnippet":"... is substyle of the hypermedia style? ... discover that you don t. AFAICT there is only one definition constraining hypermedia in your thesis: Hypermedia is","rawEmail":"Return-Path: &lt;nick.gall@...&gt;\r\nX-Sender: nick.gall@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 56352 invoked from network); 9 Jun 2009 03:00:01 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m1.grp.re1.yahoo.com with QMQP; 9 Jun 2009 03:00:01 -0000\r\nX-Received: from unknown (HELO fg-out-1718.google.com) (72.14.220.153)\n  by mta3.grp.sp2.yahoo.com with SMTP; 9 Jun 2009 03:00:00 -0000\r\nX-Received: by fg-out-1718.google.com with SMTP id 22so1314965fge.19\n        for &lt;rest-discuss@yahoogroups.com&gt;; Mon, 08 Jun 2009 19:59:36 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.86.31.19 with SMTP id e19mr7899485fge.24.1244516376166; Mon, \n\t08 Jun 2009 19:59:36 -0700 (PDT)\r\nIn-Reply-To: &lt;B22A0B12-E798-433B-9133-29DFF5E950D0@...&gt;\r\nReferences: &lt;a6a6df360906040300u5a0b2742pd17cbc26076450cb@...&gt; \n\t&lt;4A66F3F7-6C18-44E2-9D22-E2EF09C67A36@...&gt; &lt;a6a6df360906050333tc119469v1b602ebcefb12d21@...&gt; \n\t&lt;4A28F91E.5090109@...&gt; &lt;BA0EBA6B-4AF6-4996-8A55-83B5193144E4@...&gt; \n\t&lt;4A290CD0.5060706@...&gt; &lt;a6a6df360906051119j1e2d4ed7w2b93e5ed28df4fcc@...&gt; \n\t&lt;532BE158-2142-44EC-AC52-E887D4A6B500@...&gt; &lt;a6a6df360906060340j577fd01fxe1607d842cb5b9aa@...&gt; \n\t&lt;B22A0B12-E798-433B-9133-29DFF5E950D0@...&gt;\r\nDate: Mon, 8 Jun 2009 22:59:15 -0400\r\nMessage-ID: &lt;a6a6df360906081959v23c76a06y373c57ff82ba2e57@...&gt;\r\nTo: Rest List &lt;rest-discuss@yahoogroups.com&gt;\r\nContent-Type: multipart/alternative; boundary=000e0cd2c05284c30f046be18c9e\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Nick Gall &lt;nick.gall@...&gt;\r\nSubject: Re: [rest-discuss] Re: YAATRTA HATEOAS\r\nX-Yahoo-Group-Post: member; u=210067383; y=QyaEofmrbmkH8KuuhR13K20B86OolYB8qHwaP9AuiWS_w_81bE4xdX8\r\nX-Yahoo-Profile: nick_gall_1117\r\n\r\n\r\n--000e0cd2c05284c30f046be18c9e\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\n\r\nOn Sat, Jun 6, 2009 at 8:39 AM, Roy T. Fielding &lt;fielding@...&gt; wrote:\n&gt;\n&gt; On Jun 6, 2009, at 12:40 PM, Nick Gall wrote:\n&gt;&gt;\n&gt;&gt; I thought REST was the STYLE! Now we have the style of a style? I.e, REST\nis substyle of the hypermedia style?\n&gt;\n&gt; REST is a composition of constraints that come from many styles.\n&gt;\n&gt;&gt; So I went back to the thesis to see how you defined hypermedia only to\ndiscover that you don&#39;t. AFAICT there is only one definition constraining\nhypermedia in your thesis: Hypermedia is defined by the presence of\napplication control information embedded within, or as a layer above, the\npresentation of information. (I notice that assertion is not footnoted.)\n&gt;&gt;\n&gt;&gt; This sentence really doesn&#39;t help since it uses the phrase defined by not\ndefined as.Thus, the sentence doesn&#39;t say what hypermedia is, it merely\nimposes a constraint on the concept of hypermedia -- whatever it may be.\nNowhere in the thesis is hypermedia (style) ever cited or defined. Or is\nhypermedia not a style but the single architectural constraint provided by\nthe quoted sentence? All this kind of makes it a moving target.\n&gt;\n&gt; *shrug*  I didn&#39;t think it needed to be &quot;defined as&quot; (at the time).\n&gt; Too many of my friends are experts in hypertext research and they\n&gt; probably would have poked mercilessly at my final defense.\n&gt;\n&gt;&gt; [Current debate aside, I&#39;d be really interested to hear your definition\nof hypermedia, or even just see some pointers to others&#39; definitions that\ndefine it as an interaction style. All the definitions I&#39;ve ever seen define\nhypermedia as a kind of media. Even Ted Nelson defined hypermedia as simply\nthe medium, not the style.]\n&gt;\n&gt; See slide 35 (pp. 50-53) of\n&gt;\n&gt; http://roy.gbiv.com/talks/200804_REST_ApacheCon.pdf\n\nThanks for the pointer. It was immensely useful. I recommend EVERYONE\ninterested in REST read it. Is there audio of this talk anywhere? I&#39;d love\nto hear the details about these slides.\n\nOne question I was about to ask you is apparently answered in this pitch.\nHATEOAS can be replaced with HITEOAS:\n\n&quot;Hypermedia IS the Engine of Application State.&quot; (see slide 75)\n\nI find IS far clearer than AS. I think others will as well.\n\n&gt;&gt; All that being said, my argument still holds. Even if hypermedia is\ndefined as an interaction style (or something like a style) as opposed to a\nparticular kind of media (data), a style is no more an engine than a set of\nHTML documents is an engine.\n&gt;\n&gt; Oh, really?  I wonder what you think engine means.\n&gt;\n&gt;  http://en.wikipedia.org/wiki/The_Engine\n&gt;\n&gt; An engine is a system for transforming input into some form\n&gt; of output.  The engine in a car is a system for transforming\n&gt; gasoline into torque that can be applied to a drive axle.\n&gt;\n&gt; My little bullet of a constraint\n&gt;\n&gt;  &quot;hypermedia as the engine of application state&quot;\n&gt;\n&gt; does not say that the engine is a hypertext document.  It describes\n&gt; the engine as being a hypermedia system, much like a car&#39;s engine\n&gt; would be described as an internal combustion system.\n\nI think its fair to say that your thesis is vague regarding what hypermedia\nrefers to. When &quot;hypermedia&quot; is used as a noun and not as an adjective (eg\nhypermedia document, hypermedia link) it is not clear what it refers to. The\nsame thing is true in the presentation you link to above. On pages 50-53,\nyou highlight three different definitions of &quot;hypertext&quot;, none of which\nspecifically refer to a system. The first two (Nelson&#39;s and Conklin&#39;s)\nspecifically refer to hypermedia being a &quot;text&quot; and a &quot;medium&quot; -- not the\ncomplete system surrounding such text/media. So even if YOU mean\nhypertext/hypermedia=complete system (not just the media of the system),\nmost people won&#39;t know that -- hence the confusion I&#39;ve been alluding to\nfrom the beginning of this thread.\n\nEven your definition can be read as referring to just the\ndocuments/text/media:\n\nWhen I say Hypertext, I mean ...\n\n\n   - The simultaneous presentation of information and controls such that the\n      information becomes the affordance through which the user obtains choices\n      and selects actions.\n      - Hypertext does not need to be HTML on a browser\n   - machines can follow links when they understand the data format and\n         relationship types\n\nThere is NO mention of the entire system. The focus is on blending controls\ninto information, aka a medium. &quot;Hypertext does not need to be HTML&quot;\nsuggests that hypertext can be another kind of document (eg XML document).\nRoy, you have to admit that most people (even most developers) think of\nhypermedia as a kind of document or media -- not the entire system\nsurrounding such media. Even wikipedia defines\nhypertext&lt;http://en.wikipedia.org/wiki/Hypertext&gt;as the text, not the\nsystem. Thus, when they first hear &quot;hypermedia is/as\nthe engine of application state&quot;, they&#39;re going to think that a document or\nset of documents is the engine. Yes, this initial misunderstanding can be\ncorrected by further explanation, but why cause the confusion in the first\nplace by using a term &quot;hypermedia&quot; that most people interpret as referring\nto the documents/media. Why not at least change the term to\n*\n*\n*Hypermedia System IS The Engine of Application State*?\n\nYou use the term &quot;hypermedia system&quot; extensively in your thesis so there\nshouldn&#39;t be a problem with adding &quot;system&quot; to the term to clarify your\nintent. (BTW, One would think that if &quot;hypermedia&quot; alone referred to the\nsystem, that &quot;hypermedia system&quot; would be redundant.)\n\n&gt;\n&gt; I did not cite any specific reference for that because (AFAIK)\n&gt; there doesn&#39;t exist any specific reference.  I was doing synthesis.\n&gt; Nelson&#39;s definition is tied to what he cared about -- non-linear\n&gt; writing as a form of poetry.  Conklin was entirely focused on\n&gt; graphical user interfaces, so his definition is tied directly to\n&gt; GUI affordances.  My observation is something that I considered\n&gt; to be inherent in the design largely because the Web was based\n&gt; on Engelbart&#39;s view of hypertext, but AFAIK Engelbart never actually\n&gt; defined the term other than by how it was used in Augment/NLS\n&gt;\n&gt;&gt; To support this claim, let me quote further from the paragraph in which\nthe above quoted sentence appears (4.1.3):\n&gt;&gt;\n&gt;&gt; Hypermedia is defined by the presence of application control information\nembedded within, or as a layer above, the presentation of information.\nDistributed hypermedia allows the presentation and control information to be\nstored at remote locations. By its nature, user actions within a distributed\nhypermedia system require the transfer of large amounts of data from where\nthe data is stored to where it is used.\n&gt;&gt;\n&gt;&gt; Yet again, we see that it is user actions (powered by the browser\nsoftware) that singled out as driving the application (&quot;user actions ...\nrequire the transfer of ... data&quot;) -- the system does not drive itself.\n&gt;\n&gt; User actions are part of the system being designed.  That paragraph\n&gt; is talking about a design constraint imposed by the requirement that\n&gt; the information be distributed all around the world.  Aside from using\n&gt; the same term in two different ways, I don&#39;t see how that has anything\n&gt; to do with your point.  Whether or not the system drives itself is\n&gt; irrelevant.\n&gt;\n&gt;&gt; Saying that hypermedia (the entire system or style) is the engine is like\nsaying the entire automobile (or the architectural style called\n&quot;automobile&quot;) is the engine. It may be true in a Zen-like way (and believe\nme, I LOVE mystical philosophies), but it is utterly confusing to 99% of\nhumanity.\n&gt;\n&gt; 99% of humanity was not my audience, and I&#39;ll hasten to bet that less\n&gt; than 1% of humanity knows what an engine means even for something as\n&gt; mundane as an automobile.\n&gt;\n&gt;&gt; It is far clearer to the rest of humanity to say that the browser (or\nmore generally user agent) is the engine of state, the user is the driver of\nstate, and hypermedia is the representation of state.\n&gt;\n&gt; The only reason that is clearer to the rest of humanity is\n&gt; because it is wrong.  It&#39;s like saying the Web is defined by\n&gt; what a user sees in MSIE.  I don&#39;t care how easy it may be for\n&gt; a non-educated user to understand that definition: it is wrong\n&gt; and I have no interest in peddling simplified forms.\n\nI shouldn&#39;t have referred to 99% of humanity. I should have said 99% of\ndevelopers are confused by HATEOAS and would be utterly confused by the\nstatement that the entire hypermedia system, including the user, the\nbrowser, the server, etc. is the engine. If the entire set of components,\nconnectors, and data that constitute a hypermedia system are collectively\nthe engine, that doesn&#39;t really help us deal with where state should be\nstored or processed. State could be diffused throughout the entire system.\nSince the entire system is the engine, then the application state it is\ntransforming exist anywhere in the system. But we know that REST does not\nallow that, since all application state must be on the client.\n\nLet&#39;s look at how you describe HITEOAS on slide 49 to see if that helps the\ncurrent discussion:\n\nREST Uniform Interface\nHypertext as the engine of application state\n\n   - A successful response indicates (or contains) a current *representation\n   * of the state of the identified resource; the *resource remains\nhidden*behind the interface.\n   - Some *representations contain links* to potential next application\n   states, including *direction on how to transition* to those states when a\n   transition is selected.\n   - Each steady-state (Web page) embodies the current *application state*\n      - simple, visible, scalable, reliable, reusable, and cacheable\n   - All application state (not resource state) is kept on client\n   - All shared state (not session state) is kept on origin server\n\nAllow me to tease out some possible implications of these assertions (do you\nagree with these?):\n\n   1. Not all representations must contain links to next possible\n   application states -- contrary to some descriptions of HATEOAS by others\n   2. Besides links to next states, the representation may (must?) contain\n   metadata on how to transition to those states\n   3. The current application state is completely embodied in the set of\n   representations that constitute a web page (eg including inline\n   representations)\n   4. No resource state is kept on the client\n   5. Only representations of the resource state are kept on the client\n   6. No application state is kept on the server\n   7. Potential application states are generated on the server and returned\n   in resource representations\n   8. Since all application state is kept on the client, only the client can\n   initiate a state change\n   9. The server generates state transition options and the client selects\n   them\n   10. The server can never initiate a change in application state\n   11. The server can provide potential application state changes to the\n   client\n   12. The server can only initiate a change to a resource&#39;s state\n   13. The client can only initiate a change to a resource by requesting the\n   server initiate the change\n   14. Application state is not shared state\n   15. Application state is private to the client\n\nOne thing I love about implication (9) is that it calls to mind the old\nadage &quot;Man proposes but God disposes.&quot; In the case of REST, &quot;the server\nproposes (application state transition options), but the client disposes (by\nselecting among the options).&quot; Ted Nelson even refers to this adage in an\ninterview &lt;http://news.bbc.co.uk/1/hi/sci/tech/1581891.stm&gt;: &quot;I think of it\nas a form of writing - and writing is essentially what I would call a\ntwo-God system, because God the author proposes and God the reader disposes.\nThe author is completely free to do anything on the page that he likes.&quot;\nThus the server guides but does not control the client.\n\nSince it is always the client that initiates application state changes by\nsending a new request to the server, it seems completely intuitive to me to\nview the client as the engine. Just as the engine in a car initiates the\nstate change of the axle. Thus, for those who prefer an acronym with\n&quot;engine&quot; in it, I think the following convey more clearly what is going on:\n\n\n   1. Client is the Engine of Application State Transitions Represented as\n   Hypermedia Links (CEASTRAHL)\n   2. Client Traversal of Hypermedia Links Is the Engine of Application\n   State (CTOHLIEAS)\n   3. Client is an Engine Driving a Hypermedia Representation Of a Protocol\n   (CEDHROP)\n   4. The Engine of Application State: Server Generating Representations\n   With Data-Guided Controls & Client Selecting Them\n\nThis discussion clarified HATEOAS a lot for me. Thanks Roy and everyone\nelse.\n\n-- Nick\n\n--\nNick Gall\nPhone: +1.781.608.5871\nAOL IM: Nicholas Gall\nYahoo IM: nick_gall_1117\nMSN IM: (same as email)\nGoogle Talk: (same as email)\nEmail: nick.gall AT-SIGN gmail DOT com\nWeblog: http://ironick.typepad.com/ironick/\n\r\n--000e0cd2c05284c30f046be18c9e\r\nContent-Type: text/html; charset=ISO-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nOn Sat, Jun 6, 2009 at 8:39 AM, Roy T. Fielding &lt;&lt;a href=3D&quot;mailto:field=\r\ning@...&quot; target=3D&quot;_blank&quot;&gt;fielding@...&lt;/a&gt;&gt; wrote:&lt;br&gt;&gt;&lt;br=\r\n&gt;&gt; On Jun 6, 2009, at 12:40 PM, Nick Gall wrote:&lt;br&gt;&gt;&gt;&lt;br&gt;&gt;&gt;=\r\n I thought REST was the STYLE! Now we have the style of a style? I.e, REST =\r\nis substyle of the hypermedia style?&lt;br&gt;\n\n\n\n&gt;&lt;br&gt;&gt; REST is a composit=\r\nion of constraints that come from many styles.&lt;br&gt;&gt;&lt;br&gt;&gt;&gt; So I wen=\r\nt back to the thesis to see how you defined hypermedia only to discover tha=\r\nt you don&#39;t. AFAICT there is only one definition constraining hypermedi=\r\na in your thesis: Hypermedia is defined by the presence of application cont=\r\nrol information embedded within, or as a layer above, the presentation of i=\r\nnformation. (I notice that assertion is not footnoted.)&lt;br&gt;\n\n\n\n&gt;&gt;&lt;br&gt;=\r\n&gt;&gt; This sentence really doesn&#39;t help since it uses the phrase def=\r\nined by not defined as.Thus, the sentence doesn&#39;t say what hypermedia i=\r\ns, it merely imposes a constraint on the concept of hypermedia -- whatever =\r\nit may be. Nowhere in the thesis is hypermedia (style) ever cited or define=\r\nd. Or is hypermedia not a style but the single architectural constraint pro=\r\nvided by the quoted sentence? All this kind of makes it a moving target.&lt;br=\r\n&gt;\n\n\n\n&gt;&lt;br&gt;&gt; *shrug* =A0I didn&#39;t think it needed to be &quot;defin=\r\ned as&quot; (at the time).&lt;br&gt;&gt; Too many of my friends are experts in hy=\r\npertext research and they&lt;br&gt;&gt; probably would have poked mercilessly at =\r\nmy final defense.&lt;br&gt;\n\n\n\n&gt;&lt;br&gt;&gt;&gt; [Current debate aside, I&#39;d be=\r\n really interested to hear your definition of hypermedia, or even just see =\r\nsome pointers to others&#39; definitions that define it as an interaction s=\r\ntyle. All the definitions I&#39;ve ever seen define hypermedia as a kind of=\r\n media. Even Ted Nelson defined hypermedia as simply the medium, not the st=\r\nyle.]&lt;br&gt;\n\n\n\n&gt;&lt;br&gt;&gt; See slide 35 (pp. 50-53) of&lt;br&gt;&gt;&lt;br&gt;&gt; &lt;a hr=\r\nef=3D&quot;http://roy.gbiv.com/talks/200804_REST_ApacheCon.pdf&quot; target=3D&quot;_blank=\r\n&quot;&gt;http://roy.gbiv.com/talks/200804_REST_ApacheCon.pdf&lt;/a&gt;&lt;br&gt;&lt;br&gt;&lt;div&gt;Thank=\r\ns for the pointer. It was immensely useful. I recommend EVERYONE interested=\r\n in REST read it. Is there audio of this talk anywhere? I&#39;d love to hea=\r\nr the details about these slides.&lt;/div&gt;\n\n\n\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;One question=\r\n I was about to ask you is apparently answered in this pitch. HATEOAS can b=\r\ne replaced with HITEOAS:&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&quot;Hypermedia IS the E=\r\nngine of Application State.&quot; (see slide 75)&lt;/div&gt;\n\n\n\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;d=\r\niv&gt;I find IS far clearer than AS. I think others will as well.&lt;/div&gt;&lt;div&gt;&lt;b=\r\nr&gt;&lt;/div&gt;&lt;div&gt;&gt;&gt; All that being said, my argument still holds. Even if=\r\n hypermedia is defined as an interaction style (or something like a style) =\r\nas opposed to a particular kind of media (data), a style is no more an engi=\r\nne than a set of HTML documents is an engine.&lt;/div&gt;\n\n\n\n&lt;div&gt;&gt;&lt;br&gt;&gt; Oh=\r\n, really? =A0I wonder what you think engine means.&lt;br&gt;&gt;&lt;br&gt;&gt; =A0&lt;a hr=\r\nef=3D&quot;http://en.wikipedia.org/wiki/The_Engine&quot; target=3D&quot;_blank&quot;&gt;http://en.=\r\nwikipedia.org/wiki/The_Engine&lt;/a&gt;&lt;br&gt;&gt;&lt;br&gt;&gt; An engine is a system for=\r\n transforming input into some form&lt;br&gt;\n\n\n\n&gt; of output. =A0The engine in =\r\na car is a system for transforming&lt;br&gt;&gt; gasoline into torque that can be=\r\n applied to a drive axle.&lt;br&gt;&gt;&lt;br&gt;&gt; My little bullet of a constraint&lt;=\r\nbr&gt;&gt;&lt;br&gt;&gt; =A0&quot;hypermedia as the engine of application state&quot=\r\n;&lt;br&gt;\n\n\n\n&gt;&lt;br&gt;&gt; does not say that the engine is a hypertext document.=\r\n =A0It describes&lt;br&gt;&gt; the engine as being a hypermedia system, much like=\r\n a car&#39;s engine&lt;br&gt;&gt; would be described as an internal combustion sy=\r\nstem.&lt;/div&gt;\n\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I think its fair to say that your thesis i=\r\ns vague regarding what hypermedia refers to. When &quot;hypermedia&quot; is=\r\n used as a noun and not as an adjective (eg hypermedia document, hypermedia=\r\n link) it is not clear what it refers to. The same thing is true in the pre=\r\nsentation you link to above. On pages 50-53, you highlight three different =\r\ndefinitions of &quot;hypertext&quot;, none of which specifically refer to a=\r\n system. The first two (Nelson&#39;s and Conklin&#39;s) specifically refer =\r\nto hypermedia being a &quot;text&quot; and a &quot;medium&quot; -- not the =\r\ncomplete system surrounding such text/media. So even if YOU mean hypertext/=\r\nhypermedia=3Dcomplete system (not just the media of the system), most peopl=\r\ne won&#39;t know that -- hence the confusion I&#39;ve been alluding to from=\r\n the beginning of this thread.&lt;/div&gt;\n\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Even your definit=\r\nion can be read as referring to just the documents/text/media:&lt;/div&gt;&lt;div&gt;&lt;b=\r\nr&gt;&lt;/div&gt;&lt;blockquote class=3D&quot;webkit-indent-blockquote&quot; style=3D&quot;margin: 0 0=\r\n 0 40px; border: none; padding: 0px;&quot;&gt;\n\nWhen I say Hypertext, I mean ...&lt;/b=\r\nlockquote&gt;&lt;div&gt;&lt;div&gt;&lt;ul&gt;&lt;ul&gt;&lt;li&gt;The simultaneous presentation of informatio=\r\nn and controls=A0such that the information becomes the affordance through=\r\n=A0which the user obtains choices and selects actions.&lt;/li&gt;\n\n&lt;li&gt;Hypertext =\r\ndoes not need to be HTML on a browser&lt;/li&gt;&lt;/ul&gt;&lt;ul&gt;&lt;ul&gt;&lt;li&gt;machines can fol=\r\nlow links when they understand=A0the data format and relationship types&lt;/li=\r\n&gt;&lt;/ul&gt;&lt;/ul&gt;&lt;/ul&gt;&lt;/div&gt;&lt;div&gt;There is NO mention of the entire system. The fo=\r\ncus is on blending controls into information, aka a medium. &quot;Hypertext=\r\n does not need to be HTML&quot; suggests that hypertext can be another kind=\r\n of document (eg XML document). Roy, you have to admit that most people (ev=\r\nen most developers) think of hypermedia as a kind of document or media -- n=\r\not the entire system surrounding such media. Even wikipedia defines &lt;a href=\r\n=3D&quot;http://en.wikipedia.org/wiki/Hypertext&quot;&gt;hypertext&lt;/a&gt; as the text, not =\r\nthe system. Thus, when they first hear &quot;hypermedia is/as the engine of=\r\n application state&quot;, they&#39;re going to think that a document or set=\r\n of documents is the engine. Yes, this initial misunderstanding can be corr=\r\nected by further explanation, but why cause the confusion in the first plac=\r\ne by using a term &quot;hypermedia&quot; that most people interpret as refe=\r\nrring to the documents/media. Why not at least change the term to=A0&lt;/div&gt;\n=\r\n\n&lt;div&gt;&lt;i&gt;&lt;br&gt;&lt;/i&gt;&lt;/div&gt;&lt;div&gt;&lt;i&gt;Hypermedia System IS The Engine of Applicati=\r\non State&lt;/i&gt;?&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;You use the term &quot;hypermedia sy=\r\nstem&quot; extensively in your thesis so there shouldn&#39;t be a problem w=\r\nith adding &quot;system&quot; to the term to clarify your intent. (BTW, One=\r\n would think that if &quot;hypermedia&quot; alone referred to the system, t=\r\nhat &quot;hypermedia system&quot; would be redundant.)&lt;/div&gt;\n\n&lt;div&gt;&lt;br&gt;&lt;/di=\r\nv&gt;\n\n&gt;&lt;br&gt;&gt; I did not cite any specific reference for that because (AF=\r\nAIK)&lt;br&gt;&gt; there doesn&#39;t exist any specific reference. =A0I was doing=\r\n synthesis.&lt;br&gt;&gt; Nelson&#39;s definition is tied to what he cared about =\r\n-- non-linear&lt;br&gt;\n\n\n\n&gt; writing as a form of poetry. =A0Conklin was entir=\r\nely focused on&lt;br&gt;&gt; graphical user interfaces, so his definition is tied=\r\n directly to&lt;br&gt;&gt; GUI affordances. =A0My observation is something that I=\r\n considered&lt;br&gt;&gt; to be inherent in the design largely because the Web wa=\r\ns based&lt;br&gt;\n\n\n\n&gt; on Engelbart&#39;s view of hypertext, but AFAIK Engelba=\r\nrt never actually&lt;br&gt;&gt; defined the term other than by how it was used in=\r\n Augment/NLS&lt;br&gt;&gt;&lt;br&gt;&gt;&gt; To support this claim, let me quote furthe=\r\nr from the paragraph in which the above quoted sentence appears (4.1.3):&lt;br=\r\n&gt;\n\n\n\n&gt;&gt;&lt;br&gt;&gt;&gt; Hypermedia is defined by the presence of applicat=\r\nion control information embedded within, or as a layer above, the presentat=\r\nion of information. Distributed hypermedia allows the presentation and cont=\r\nrol information to be stored at remote locations. By its nature, user actio=\r\nns within a distributed hypermedia system require the transfer of large amo=\r\nunts of data from where the data is stored to where it is used.&lt;br&gt;\n\n\n\n&gt;=\r\n&gt;&lt;br&gt;&gt;&gt; Yet again, we see that it is user actions (powered by the =\r\nbrowser software) that singled out as driving the application (&quot;user a=\r\nctions ... require the transfer of ... data&quot;) -- the system does not d=\r\nrive itself.&lt;br&gt;\n\n\n\n&gt;&lt;br&gt;&gt; User actions are part of the system being =\r\ndesigned. =A0That paragraph&lt;br&gt;&gt; is talking about a design constraint im=\r\nposed by the requirement that&lt;br&gt;&gt; the information be distributed all ar=\r\nound the world. =A0Aside from using&lt;br&gt;\n\n\n\n&gt; the same term in two differ=\r\nent ways, I don&#39;t see how that has anything&lt;br&gt;&gt; to do with your poi=\r\nnt. =A0Whether or not the system drives itself is&lt;br&gt;&gt; irrelevant.&lt;br&gt;&g=\r\nt;&lt;br&gt;&gt;&gt; Saying that hypermedia (the entire system or style) is the e=\r\nngine is like saying the entire automobile (or the architectural style call=\r\ned &quot;automobile&quot;) is the engine. It may be true in a Zen-like way =\r\n(and believe me, I LOVE mystical philosophies), but it is utterly confusing=\r\n to 99% of humanity.&lt;br&gt;\n\n\n\n&gt;&lt;br&gt;&gt; 99% of humanity was not my audienc=\r\ne, and I&#39;ll hasten to bet that less&lt;br&gt;&gt; than 1% of humanity knows w=\r\nhat an engine means even for something as&lt;br&gt;&gt; mundane as an automobile.=\r\n&lt;br&gt;&gt;&lt;br&gt;&gt;&gt; It is far clearer to the rest of humanity to say that =\r\nthe browser (or more generally user agent) is the engine of state, the user=\r\n is the driver of state, and hypermedia is the representation of state.&lt;br&gt;=\r\n\n\n\n\n&gt;&lt;br&gt;&gt; The only reason that is clearer to the rest of humanity is=\r\n&lt;br&gt;&gt; because it is wrong. =A0It&#39;s like saying the Web is defined by=\r\n&lt;br&gt;&gt; what a user sees in MSIE. =A0I don&#39;t care how easy it may be f=\r\nor&lt;br&gt;\n\n\n\n&gt; a non-educated user to understand that definition: it is wro=\r\nng&lt;br&gt;&gt; and I have no interest in peddling simplified forms.&lt;br&gt;&lt;br&gt;&lt;/di=\r\nv&gt;&lt;div&gt;I shouldn&#39;t have referred to 99% of humanity. I should have said=\r\n 99% of developers are confused by HATEOAS and would be utterly confused by=\r\n the statement that the entire hypermedia system, including the user, the b=\r\nrowser, the server, etc. is the engine. If the entire set of components, co=\r\nnnectors, and data that constitute a hypermedia system are collectively the=\r\n engine, that doesn&#39;t really help us deal with where state should be st=\r\nored or processed. State could be diffused throughout the entire system. Si=\r\nnce the entire system is the engine, then the application state it is trans=\r\nforming exist anywhere in the system. But we know that REST does not allow =\r\nthat, since all application state must be on the client.&lt;/div&gt;\n\n\n\n&lt;div&gt;&lt;br&gt;=\r\n&lt;/div&gt;&lt;div&gt;Let&#39;s look at how you describe HITEOAS on slide 49 to see if=\r\n that helps the current discussion:&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;REST Uniform I=\r\nnterface&lt;/div&gt;&lt;div&gt;Hypertext as the engine of application state&lt;/div&gt;\n\n\n\n&lt;d=\r\niv&gt;&lt;ul&gt;&lt;li&gt;A successful response indicates (or contains) a current &lt;b&gt;repre=\r\nsentation&lt;/b&gt; of the state of the identified resource; the &lt;b&gt;resource rema=\r\nins hidden&lt;/b&gt; behind the interface.&lt;/li&gt;&lt;li&gt;Some &lt;b&gt;representations contai=\r\nn links&lt;/b&gt; to potential next application states, including &lt;b&gt;direction on=\r\n how to transition&lt;/b&gt; to those states when a transition is selected.&lt;/li&gt;\n=\r\n\n\n\n&lt;li&gt;Each steady-state (Web page) embodies the current &lt;b&gt;application sta=\r\nte&lt;/b&gt;&lt;/li&gt;&lt;ul&gt;&lt;li&gt;simple, visible, scalable, reliable, reusable, and cache=\r\nable&lt;/li&gt;&lt;/ul&gt;&lt;li&gt;All application state (not resource state) is kept on cli=\r\nent&lt;/li&gt;\n\n\n\n&lt;li&gt;All shared state (not session state) is kept on origin serv=\r\ner&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;div&gt;Allow me to tease out some possible implications of =\r\nthese assertions (do you agree with these?):&lt;/div&gt;&lt;div&gt;&lt;ol&gt;&lt;li&gt;Not &lt;span st=\r\nyle=3D&quot;text-decoration:underline&quot;&gt;all&lt;/span&gt; representations must contain l=\r\ninks to next possible application states -- contrary to some descriptions o=\r\nf HATEOAS by others&lt;/li&gt;\n\n\n\n&lt;li&gt;Besides links to next states, the represent=\r\nation may (must?) contain metadata on how to transition to those states&lt;/li=\r\n&gt;&lt;li&gt;The current application state is completely embodied in the set of rep=\r\nresentations that constitute a web page (eg including inline representation=\r\ns)&lt;/li&gt;\n\n\n\n&lt;li&gt;No resource state is kept on the client&lt;/li&gt;&lt;li&gt;Only represe=\r\nntations of the resource state are kept on the client&lt;/li&gt;&lt;li&gt;No applicatio=\r\nn state is kept on the server&lt;/li&gt;&lt;li&gt;Potential application states are gene=\r\nrated on the server and returned in resource representations&lt;/li&gt;\n\n\n\n&lt;li&gt;Si=\r\nnce all application state is kept on the client, only the client can &lt;span =\r\nstyle=3D&quot;text-decoration:underline&quot;&gt;initiate&lt;/span&gt; a state change&lt;/li&gt;&lt;li&gt;=\r\nThe server generates state transition options and the client selects them&lt;/=\r\nli&gt;\n\n&lt;li&gt;The server can never &lt;span style=3D&quot;text-decoration:underline&quot;&gt;ini=\r\ntiate&lt;/span&gt; a change in application state&lt;/li&gt;\n\n&lt;li&gt;The server can provide=\r\n potential application state changes to the client&lt;/li&gt;&lt;li&gt;The server can o=\r\nnly &lt;span style=3D&quot;text-decoration:underline&quot;&gt;initiate&lt;/span&gt; a change to a=\r\n resource&#39;s state&lt;/li&gt;\n&lt;li&gt;The client can only initiate a change to a r=\r\nesource by requesting the server initiate the change&lt;/li&gt;&lt;li&gt;Application st=\r\nate is not shared state&lt;/li&gt;&lt;li&gt;Application state is private to the client&lt;=\r\n/li&gt;&lt;/ol&gt;&lt;div&gt;One thing I love about implication (9) is that it calls to mi=\r\nnd the old adage &quot;Man proposes but God disposes.&quot; In the case of =\r\nREST, &quot;the server proposes (application state transition options), but=\r\n the client disposes (by selecting among the options).&quot; Ted Nelson eve=\r\nn refers to this adage in an=A0&lt;a href=3D&quot;http://news.bbc.co.uk/1/hi/sci/te=\r\nch/1581891.stm&quot;&gt;interview&lt;/a&gt;: &quot;&lt;span class=3D&quot;Apple-style-span&quot; style=\r\n=3D&quot;font-family: Verdana; &quot;&gt;I think of it as a form of writing - and writin=\r\ng is essentially what I would call a two-God system, because God the author=\r\n proposes and God the reader disposes. The author is completely free to do =\r\nanything on the page that he likes.&quot; Thus the server guides but does n=\r\not control the client.&lt;/span&gt;&lt;/div&gt;\n\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;span class=3D&quot;App=\r\nle-style-span&quot; style=3D&quot;font-family: Verdana; &quot;&gt;&lt;/span&gt;Since it is always t=\r\nhe client that initiates application state changes by sending a new request=\r\n to the server, it seems completely intuitive to me to view the client as t=\r\nhe engine. Just as the engine in a car initiates the state change of the ax=\r\nle. Thus, for those who prefer an acronym with &quot;engine&quot; in it, I =\r\nthink the following convey more clearly what is going on:&lt;/div&gt;\n\n\n\n&lt;div&gt;&lt;br=\r\n&gt;&lt;/div&gt;&lt;div&gt;&lt;ol&gt;&lt;li&gt;Client is the Engine of Application State Transitions R=\r\nepresented as Hypermedia Links (CEASTRAHL)&lt;/li&gt;&lt;li&gt;Client Traversal of Hype=\r\nrmedia Links Is the Engine of Application State (CTOHLIEAS)&lt;/li&gt;\n\n\n\n&lt;li&gt;Cli=\r\nent is an Engine Driving a Hypermedia Representation Of a Protocol (CEDHROP=\r\n)&lt;/li&gt;&lt;li&gt;The Engine of Application State: Server Generating Representation=\r\ns With Data-Guided Controls &amp; Client Selecting Them&lt;/li&gt;&lt;/ol&gt;\n\n&lt;/div&gt;Th=\r\nis discussion clarified HATEOAS a lot for me. Thanks Roy and everyone else.=\r\n&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;-- Nick&lt;/div&gt;&lt;div&gt;&lt;br&gt;--&lt;br&gt;Nick Gall&lt;br&gt;\nPhone: =\r\n+1.781.608.5871&lt;br&gt;AOL IM: Nicholas Gall&lt;br&gt;Yahoo IM: nick_gall_1117&lt;br&gt;MSN=\r\n IM: (same as email)&lt;br&gt;\nGoogle Talk: (same as email)&lt;br&gt;Email: nick.gall A=\r\nT-SIGN gmail DOT com&lt;br&gt;Weblog: &lt;a href=3D&quot;http://ironick.typepad.com/ironi=\r\nck/&quot; target=3D&quot;_blank&quot;&gt;http://ironick.typepad.com/ironick/&lt;/a&gt;&lt;br&gt;&lt;/div&gt;\n\r\n--000e0cd2c05284c30f046be18c9e--\r\n\n"}}