{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":237604743,"authorName":"Bill de hOra","from":"Bill de hOra &lt;bill@...&gt;","profile":"bdehora","replyTo":"SENDER","senderId":"b-cN8sLnsFw3x3PINb0-lX04u6YYpAgmAbfOOUv61-awtCZyliDUtYCe6bETlKRbwL6gMed5t55OTMB4WskW9ibixQTh","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] Re: Google kills the question mark?","postDate":"1245427244","msgId":12904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBM0JCNjJDLjgwMTA4MDlAZGVob3JhLm5ldD4=","inReplyToHeader":"PGgxZzhmYStiY2lmQGVHcm91cHMuY29tPg==","referencesHeader":"PGgxZzhmYStiY2lmQGVHcm91cHMuY29tPg=="},"prevInTopic":12903,"nextInTopic":12909,"prevInTime":12903,"nextInTime":12905,"topicId":12891,"numMessagesInTopic":15,"msgSnippet":"... They re broken because they couple URIs to media representations. My stance fwiw, is not to design them into my systems. ... What I said was that the","rawEmail":"Return-Path: &lt;bill@...&gt;\r\nX-Sender: bill@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 49501 invoked from network); 19 Jun 2009 16:01:19 -0000\r\nX-Received: from unknown (69.147.108.202)\n  by m8.grp.re1.yahoo.com with QMQP; 19 Jun 2009 16:01:19 -0000\r\nX-Received: from unknown (HELO chilco.textdrive.com) (207.7.108.242)\n  by mta3.grp.re1.yahoo.com with SMTP; 19 Jun 2009 16:01:19 -0000\r\nX-Received: from [192.168.1.10] (unknown [89.100.251.254])\n\tby chilco.textdrive.com (Postfix) with ESMTP id E5795DD517\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Fri, 19 Jun 2009 16:00:47 +0000 (UTC)\r\nMessage-ID: &lt;4A3BB62C.8010809@...&gt;\r\nDate: Fri, 19 Jun 2009 17:00:44 +0100\r\nUser-Agent: Thunderbird 2.0.0.21 (X11/20090409)\r\nMIME-Version: 1.0\r\nTo: rest-discuss@yahoogroups.com\r\nReferences: &lt;h1g8fa+bcif@...&gt;\r\nIn-Reply-To: &lt;h1g8fa+bcif@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Bill de hOra &lt;bill@...&gt;\r\nSubject: Re: [rest-discuss] Re: Google kills the question mark?\r\nX-Yahoo-Group-Post: member; u=237604743; y=UMic6Gf1oVXXBQIFgtQEZOYf6-0LczJcP4AnlJse-38CEw\r\nX-Yahoo-Profile: bdehora\r\n\r\njohnzabroski wrote:\n\n&gt;  &gt; Fragment identifiers are broken as designed in the web architecture. As\n&gt;  &gt; we say in Ireland, I wouldn&#39;t start from there.\n&gt; \n&gt; Then where would you start from? Maybe I am missing a completely obvious \n&gt; practical or even theoretical alternative to this. I&#39;ve said in the past \n&gt; that fragment identifiers are broken, because they are not \n&gt; object-oriented and do not lend themselves well to representing \n&gt; object-oriented hypermedia. I am not sure where you or anyone else \n&gt; stands on &quot;fragment identifiers are broken&quot;. I don&#39;t know of any RFC or \n&gt; any IETF document that says this, anywhere.\n\nThey&#39;re broken because they couple URIs to media representations. My \nstance fwiw, is not to design them into my systems.\n\n\n&gt;  &gt; &gt; Likewise, you will note in the practical sense of &quot;what to expect in\n&gt;  &gt; &gt; real world implementations&quot;, that Search Engines do not index content\n&gt;  &gt; &gt; after the #. This imposes a real world practical limitation on real\n&gt;  &gt; &gt; world use. However, Google killing the question mark is huge. This \n&gt; kind\n&gt;  &gt; &gt; of opens the door, just a crack, about the idea of Google having to\n&gt;  &gt; &gt; require its Sitemap technology be able to understand fragment\n&gt;  &gt; &gt; identifiers. In hypermedia theory, this means we can finally start\n&gt;  &gt; &gt; building Web applications with &quot;open linking&quot; and &quot;deep linking&quot;.\n&gt;  &gt;\n&gt;  &gt; Since you&#39;re say you&#39;re coming from this from a practical angle, I would\n&gt;  &gt; say it means user agents will need to know a lot more about media types\n&gt;  &gt; than they do today, which is a very real form of coupling. Probably that\n&gt;  &gt; will get pushed up to application developers.\n&gt; \n&gt; No, you have it wrong, in my humble opinion. Today, the user agent we \n&gt; all use, The Web Browser Model, is too tightly coupled to the media \n&gt; type. \n\nWhat I said was that the problem of understanding formats and objects \nwill be pushed up to application developers. This is what happens \nalready today with JSON (but not so much with Atom and hardly at all \nwith HTML). If I&#39;m wrong, please explain how.\n\n\n&gt; The Web Browser is a program that has to know how to render the \n&gt; media formats it receives. It has to be way too smart. I am arguing for \n&gt; the dumbing down of this and returning to a more reasonable \n&gt; Object-Oriented approach where &quot;you don&#39;t need a browser&quot;, where your \n&gt; code and data go together.\n\nThere are systems that do that already and have attempted to do that, \nincluding the goal of &quot;fixing the web&quot; - they haven&#39;t been adopted even \nwith massive industry backing. Distributed OO is a niche compared to the \nWeb.\n\n\n&gt; The idea that a browser should know how to \n&gt; render HTML is backwards. Notice that I am saying the Browser should \n&gt; simply be a gateway, and that inside the browser we can embed \n&gt; application-specific gateways. \n\nGateways already exist in the form of CGI. They&#39;re called gateways for \nreason, as they&#39;re not part of the web architecture.\n\n\n&gt; I think of the Browser of the future as a software configuration \n&gt; management tool, with ability to get out of the way of user \n&gt; accessibility issues and the like. The Browser should give you a \n&gt; flexible, scalable, distributed model for accessing content like \n&gt; object-oriented programs.\n\nI think they already do. Was there a specific &quot;not-browser&quot; application \nyou had in mind?\n\n&gt; \n&gt; You could certainly argue that HTML/XHTML decouples interface from \n&gt; implementation, but that is a ridiculous argument -- we all know from \n&gt; just looking at the gold standard for rendering pages, the Acid Test, \n&gt; that nobody can even correctly implement these interfaces. \n\nThat&#39;s ok, I didn&#39;t argue that.\n\nI think you&#39;ll find that most of the wildly successful formats are not \nconsistently implemented. There&#39;s nothing exceptional about HTML, except \nthat &quot;wildly successful&quot; is an understatement.\n\n\n&gt; So it makes \n&gt; more sense to talk about shipping a working versionable object, a \n&gt; component, that has code+data. \n\nWhy does it make more sense? Code on demand is part of REST, but the \nhistory of distributed objects is dismal. SOAP has failed for Web scale \ndelivery. Even JavaScript gets reduced down to JSON.\n\nIf there&#39;s something beyond the syntax related stuff we do today, I \nsuspect it&#39;s likely to be data that has more precise semantics (eg \nKIF/RDF/OWL) and in the interim, formats like atom, microformats and \nrdfa, maybe json based vocabularies.\n\nDevelopers like their objects so I guess people will keep trying to go \ndown that path, and you seem happy to do so.  Otherwise this debate is \nyears old, and I&#39;ve seen nothing in over a decade that suggests we&#39;ll \nmove off the current web to something approaching OO, not matter how \nstupid it seems to be each generation of  programmers that discover the \nweb and immediately wonder how to fix it.\n\n\n&gt; I guess I am reading your sentence as &quot;Unfortunately this is a detail we \n&gt; do not talk about, even though it needs improvement.&quot; Perhaps not fair, \n&gt; but where else are you leading me? It sounds like what I need to hear \n&gt; then is &quot;stop going down this direction, you need to re-crystallize, \n&gt; here is what you need to go and where you need to go.&quot;\n\nI would say distributed objects in the way you&#39;re talking about them are \na dead end, yes.\n\nBill\n\n\n"}}