{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":157827282,"authorName":"johnzabroski","from":"&quot;johnzabroski&quot; &lt;johnzabroski@...&gt;","profile":"johnzabroski","replyTo":"SENDER","senderId":"R4hsenVJ9sQOUx_Ri80r0V5f5wAJjjQwfEdksr8cU9RlEZ7kUAadPQ1-hOXguVKtMFLLU9hAyHa9aI-m4XWum2UDScQIowfF7cd9sWIs","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Google kills the question mark?","postDate":"1245604076","msgId":12912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgxbHBkYytocDhvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBM0JCNjJDLjgwMTA4MDlAZGVob3JhLm5ldD4="},"prevInTopic":12910,"nextInTopic":12915,"prevInTime":12911,"nextInTime":12913,"topicId":12891,"numMessagesInTopic":15,"msgSnippet":"... Sorry, you provide commentary on a design position, but give me no examples.  I am not sure what that looks like.  You don t have any ID tags anywhere in","rawEmail":"Return-Path: &lt;johnzabroski@...&gt;\r\nX-Sender: johnzabroski@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 1416 invoked from network); 21 Jun 2009 17:08:04 -0000\r\nX-Received: from unknown (69.147.108.201)\n  by m3.grp.sp2.yahoo.com with QMQP; 21 Jun 2009 17:08:04 -0000\r\nX-Received: from unknown (HELO n45b.bullet.mail.sp1.yahoo.com) (66.163.168.159)\n  by mta2.grp.re1.yahoo.com with SMTP; 21 Jun 2009 17:08:03 -0000\r\nX-Received: from [69.147.65.148] by n45.bullet.mail.sp1.yahoo.com with NNFMP; 21 Jun 2009 17:07:58 -0000\r\nX-Received: from [98.137.34.72] by t11.bullet.mail.sp1.yahoo.com with NNFMP; 21 Jun 2009 17:07:58 -0000\r\nDate: Sun, 21 Jun 2009 17:07:56 -0000\r\nTo: rest-discuss@yahoogroups.com\r\nMessage-ID: &lt;h1lpdc+hp8o@...&gt;\r\nIn-Reply-To: &lt;4A3BB62C.8010809@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;johnzabroski&quot; &lt;johnzabroski@...&gt;\r\nSubject: Re: Google kills the question mark?\r\nX-Yahoo-Group-Post: member; u=157827282; y=3XyroIkVC10BztuqZfL6h-W-QYx7BFAnwkuGZEcNa_Swn25baxfx\r\nX-Yahoo-Profile: johnzabroski\r\n\r\n--- In rest-discuss@yahoogroups.com, Bill de hOra &lt;bill@...&gt; wrote:\n&gt;\n&gt; joh=\r\nnzabroski wrote:\n&gt; \n&gt; &gt;  &gt; Fragment identifiers are broken as designed in t=\r\nhe web architecture. As\n&gt; &gt;  &gt; we say in Ireland, I wouldn&#39;t start from the=\r\nre.\n&gt; &gt; \n&gt; &gt; Then where would you start from? Maybe I am missing a complete=\r\nly obvious \n&gt; &gt; practical or even theoretical alternative to this. I&#39;ve sai=\r\nd in the past \n&gt; &gt; that fragment identifiers are broken, because they are n=\r\not \n&gt; &gt; object-oriented and do not lend themselves well to representing \n&gt; =\r\n&gt; object-oriented hypermedia. I am not sure where you or anyone else \n&gt; &gt; s=\r\ntands on &quot;fragment identifiers are broken&quot;. I don&#39;t know of any RFC or \n&gt; &gt;=\r\n any IETF document that says this, anywhere.\n&gt; \n&gt; They&#39;re broken because th=\r\ney couple URIs to media representations. My \n&gt; stance fwiw, is not to desig=\r\nn them into my systems.\n\n\nSorry, you provide commentary on a design positio=\r\nn, but give me no examples.  I am not sure what that looks like.  You don&#39;t=\r\n have any ID tags anywhere in your XML documents???  I think you are foolin=\r\ng me, or talking past me.\n\nFragment identifiers are supposed to be independ=\r\nent of URI media type.  I personally think full independence is a little cr=\r\nazy.  That&#39;s tantamount to saying &quot;ah, yes, we can run our enterprise&#39;s mis=\r\nsion-critical data processing on a network database and don&#39;t need a SQL DB=\r\nMS.&quot;  There is a minimum sanity level in the design of any system.  It is k=\r\nnown in the engineering trades as &quot;margin of safety&quot;.\n\nIf your media type d=\r\noes not support fragment identifiers directly, then you can usually perform=\r\n what compiler writers call a &quot;worker/wrapper transformation&quot;.  This is how=\r\n Google Video brilliantly &quot;just works&quot;.  Google Video lets you fragment ide=\r\nntify a particular second in a video you are watching, along with other opt=\r\nions (I forget how to do this, though, since it is not exposed anywhere in =\r\nthe GUI.)  It can do this because Google Video is not presenting you WMF or=\r\n whatever.  Instead, it wraps that content in a media player in a Flash con=\r\ntainer and wraps that Flash container in an HTML document, and the DOM mode=\r\nl allows the user to manipulate the opaque media type via a DOM bridge.\n\nSo=\r\nme media types need this level of virtualization to &quot;just work&quot;, and it is =\r\nnot tightly coupling anything to anything.  It is simply good design.  If y=\r\nou note, we&#39;ve put in two extra degrees of freedom from the underlying medi=\r\na type (WMF) just to gain access to WMF&#39;s discrete time abilities.\n\nNow, on=\r\ne thing I dislike, and I think you probably do too, is that we use # in pla=\r\nce of ?, mainly due to how much web browser&#39;s navigation services suck toda=\r\ny.  I&#39;ll talk more about this below - and explain my Platonic ideal.\n\n&gt; &gt; N=\r\no, you have it wrong, in my humble opinion. Today, the user agent we \n&gt; &gt; a=\r\nll use, The Web Browser Model, is too tightly coupled to the media \n&gt; &gt; typ=\r\ne. \n&gt; \n&gt; What I said was that the problem of understanding formats and obje=\r\ncts \n&gt; will be pushed up to application developers. This is what happens \n&gt;=\r\n already today with JSON (but not so much with Atom and hardly at all \n&gt; wi=\r\nth HTML). If I&#39;m wrong, please explain how.\n\n\nMy initial guess is you are &quot;=\r\nnot even wrong&quot;.  I don&#39;t understand how people come up with circular argum=\r\nents like this one.  Why on earth would application developers be responsib=\r\nle for building media type interpreters???  That just puts you back in the =\r\nEDI world, and will bring about another round of dumb COBOL/VSAM-esque idea=\r\ns like Netron Fusion frame-oriented programming.\n\nI will not comment on you=\r\nr JSON concerns, because I need a particular example.  It is too aloof for =\r\nme to wrap my head around.  Could you illustrate by comparing JSON vs. Atom=\r\n vs. HTML?  I understand what all these are, but sometimes the differences =\r\npeople see in good design are remarkably subtle.  There is a good chance yo=\r\nu can simply see a subtlety I cannot without the help of your magnifying gl=\r\nass.\n\n\n&gt; &gt; The Web Browser is a program that has to know how to render the =\r\n\n&gt; &gt; media formats it receives. It has to be way too smart. I am arguing fo=\r\nr \n&gt; &gt; the dumbing down of this and returning to a more reasonable \n&gt; &gt; Obj=\r\nect-Oriented approach where &quot;you don&#39;t need a browser&quot;, where your \n&gt; &gt; cod=\r\ne and data go together.\n&gt; \n&gt; There are systems that do that already and hav=\r\ne attempted to do that, \n&gt; including the goal of &quot;fixing the web&quot; - they ha=\r\nven&#39;t been adopted even \n&gt; with massive industry backing. Distributed OO is=\r\n a niche compared to the \n&gt; Web.\n\n\nSorry.  Distributed OO could mean a lot =\r\nof things.  Could you please explain to me in what sense you are using it? =\r\n I don&#39;t enjoy hearing a buzzword and &quot;there are systems that do that alrea=\r\ndy&quot;, because I can&#39;t figure out what that means.  I much prefer examples in=\r\n place of buzzwords.  I am a firm believer that this sort of assumption -- =\r\nthat other technical people know what other technical people are talking ab=\r\nout -- is why software is so complex.\n\nHere is my take on things... let&#39;s s=\r\ntudy the evolution of a user and his/her user agent (the legacy model of a =\r\nweb browser).  This is a somewhat philosophical A Discourse by Three Drunka=\r\nrds on Web Browsers....\n\n1. User installs Operating System, or buys applian=\r\nce with Operating System, or downloads a VM that is an OS Appliance.\n\n2. Th=\r\ney either have a web browser shipped with the OS, or they don&#39;t.  If they d=\r\non&#39;t, then they have to download it or install it.  Downloading is tricky, =\r\nbecause how do you bootstrap the process?  Ah, at some point you need somet=\r\nhing to *lead* the bootstrap.  We&#39;ll call that leader the browser.  At this=\r\n step, the first bootstrap on the user&#39;s machine ever, the browser could be=\r\n a user or a user agent.\n\n3. The browser is now automagically installed.  T=\r\nhe browser also automagically knows how to update itself from the Internet,=\r\n using its own browser networking stack, which is abstracted away from the =\r\nunderlying OS.  (This is the way FireFox works today.  It gets the latest b=\r\nits from an authoritative repository, and the next time you cycle FireFox, =\r\nyou get the version it downloaded/installed.  You also get a page that says=\r\n &quot;You&#39;ve just been upgraded.&quot;)\n\n4. Your browser has a somewhat insidious bu=\r\nt seemingly innocuous design flaw... it cannot automagically substitute ren=\r\ndering engines for HTML, the major media type on the Web.  As a consequence=\r\n, your mission-critical Enterprise web app starts behaving weird after some=\r\n upgrade, because the upgrade included a change to CSS and now all of a sud=\r\nden that weird CSS hack the webmaster put in is breaking everyone&#39;s dashboa=\r\nrds.  Bar graphs that were normally zeroes are now 100%s, and everyone know=\r\ns something is horribly wrong, and right about now nobody gives a shit that=\r\n &quot;FireFox 2020&quot; just passed the Acid6 test by the W3C... and the DotCOM CEO=\r\n is about to commit Hudsucker Proxy-style boardroom meeting suicide.\n\nSo, b=\r\nasically, to re-cap, if web browsers were more object-oriented, and support=\r\ned &quot;versionable objects&quot;, then we could stabilize such problems by saying w=\r\ne only support rendering engine COMPONENTs.  This is the way .NET works.  Y=\r\nour appmanifest.xml can be used to select which version of a DLL your appli=\r\ncation should run against.  This is called virtualization and component-ori=\r\nented software.  The former buzzword is really sexy right now and the other=\r\n is just &quot;meh&quot; to most people.\n\nIf you look at what Microsoft is doing with=\r\n Silverlight, they are basically trying to replace the Browser with somethi=\r\nng more object-oriented.  For the most part, it is vastly superior, except =\r\nfor the fact that by default it is still hosted inside this monolithic, poo=\r\nrly architected notion of a Browser.  The bad design of browsers is codifie=\r\nd into the DHTML model of DOM.  JavaScript&#39;s notion of a window is wrong.  =\r\nWhen you change the URL, using JavaScript, the browser should not automagic=\r\nally fetch the new URL.  That&#39;s what is wrong with browsers today, that Sil=\r\nverlight and object-oriented stuff like it can&#39;t fix.  The Web Browser toda=\r\ny has no notion of interstitial concepts that good object-oriented design u=\r\nses by default.  The Browser&#39;s URI navigation bar is very direct, and not c=\r\nontrollable by the application.  Somehow, the Browser has this completely _=\r\njacked up_ idea that it knows more about how to dispatch a URI than the app=\r\nlication itself.  The Browser should really only provide the ability for th=\r\ne application to use HREF-style GOTO behavior as a HELPER function- not as =\r\na hardcoded non-modular mechanism.  And if you don&#39;t see this hardcodedness=\r\n and how it ties back into the original topic of ? and #, and why people ev=\r\nen use # in the first place, well... it&#39;s because the browser&#39;s navigation =\r\nbar uses the HREF GOTO model of navigation.  The browser is really this pho=\r\nny hypermedia container wannabe, because nothing about the browser has ever=\r\n been hypermedia-centric or object-oriented, and certainly not &quot;Object-Orie=\r\nnted Hypermedia&quot;-centric nirvana.  That&#39;s why the browser is continuously t=\r\naken by surprise with ideas like XMLHTTPRequest, because the browser is non=\r\n-modular and people continuously hijack media types (like ActiveX) to provi=\r\nde correct, object-oriented features like XMLHTTPRequest!  THINK ABOUT IT.\n=\r\n\nSilverlight is basically a Virtual Machine-based web browser, done mostly =\r\nright, but still having to deal with browser interop problems such as (a) t=\r\nhe browser networking stack (b) the browser navigation model\n\nIf my Silverl=\r\night/Moonlight example frightens you, just s/Silverlight/GWT and Google Gea=\r\nrs/ and we&#39;re now talking about supposedly &quot;do no evil&quot; technology everybod=\r\ny loves right now.  Except, GWT is fundamentally stupider than Silverlight,=\r\n b/c it does not fix the fundamental problem that the browser is not object=\r\n-oriented and does not use components.  The legacy web browser is not a goo=\r\nd model for mission-critical applications, regardless of what Google wants =\r\nyou to believe to pump-up their AdSense/AdWords revenue.  Gears cannot fix =\r\nthis.  Ever.  (Gears is seriously cool, by the way, and I think Silverlight=\r\n+++Gears is even cooler!  But most people talk about Microsoft/Google in an=\r\n unholy war sense, so they could never dream of Silverlight and Gears being=\r\n used in conjunction to fix the browser networking stack problems and brows=\r\ner navigation model problems.  However, Gears CANNOT fix the component prob=\r\nlem.  Again, I&#39;ll just point to Joel Spolsky&#39;s Martian Headsets blog entry =\r\nfor the best explanation of how messed up this thing is.)\n\n\n\n&gt; &gt; The idea t=\r\nhat a browser should know how to \n&gt; &gt; render HTML is backwards. Notice that=\r\n I am saying the Browser should \n&gt; &gt; simply be a gateway, and that inside t=\r\nhe browser we can embed \n&gt; &gt; application-specific gateways. \n&gt; \n&gt; Gateways =\r\nalready exist in the form of CGI. They&#39;re called gateways for \n&gt; reason, as=\r\n they&#39;re not part of the web architecture.\n\n\nAre you snowing me?  Your firs=\r\nt sentence is spot-on, but your statement that &quot;they&#39;re not part of the web=\r\n architecture&quot; overlooks how page-centric web applications operate today.  =\r\nLook at the DISGUSTING hacks JBoss does with continuations to solve the fac=\r\nt that the browser has no GOOD way to allow the application to define gatew=\r\nays.\n\nIn theory, you are right.  The Web Architecture doesn&#39;t know about ga=\r\nteways.\n\nIn practice, you are &quot;not even wrong&quot;, by being closed-minded to a=\r\n set of design criteria you prefer.  Understand that the way web browsers w=\r\nork today is just a _talking point_ for what they should look like in the f=\r\nuture.  The Web -- and The Web Browser Model -- did not have any concept of=\r\n XMLHTTPRequest or anything like that.  \n\n\n&gt; &gt; I think of the Browser of th=\r\ne future as a software configuration \n&gt; &gt; management tool, with ability to =\r\nget out of the way of user \n&gt; &gt; accessibility issues and the like. The Brow=\r\nser should give you a \n&gt; &gt; flexible, scalable, distributed model for access=\r\ning content like \n&gt; &gt; object-oriented programs.\n&gt; \n&gt; I think they already d=\r\no. Was there a specific &quot;not-browser&quot; application \n&gt; you had in mind?\n&gt; \n&gt; =\r\n&gt; \n&gt; &gt; You could certainly argue that HTML/XHTML decouples interface from \n=\r\n&gt; &gt; implementation, but that is a ridiculous argument -- we all know from \n=\r\n&gt; &gt; just looking at the gold standard for rendering pages, the Acid Test, \n=\r\n&gt; &gt; that nobody can even correctly implement these interfaces. \n&gt; \n&gt; That&#39;s=\r\n ok, I didn&#39;t argue that.\n&gt; \n&gt; I think you&#39;ll find that most of the wildly =\r\nsuccessful formats are not \n&gt; consistently implemented. There&#39;s nothing exc=\r\neptional about HTML, except \n&gt; that &quot;wildly successful&quot; is an understatemen=\r\nt.\n&gt; \n&gt; \n&gt; &gt; So it makes \n&gt; &gt; more sense to talk about shipping a working v=\r\nersionable object, a \n&gt; &gt; component, that has code+data. \n&gt; \n&gt; Why does it =\r\nmake more sense? Code on demand is part of REST, but the \n&gt; history of dist=\r\nributed objects is dismal. SOAP has failed for Web scale \n&gt; delivery. Even =\r\nJavaScript gets reduced down to JSON.\n&gt; \n&gt; If there&#39;s something beyond the =\r\nsyntax related stuff we do today, I \n&gt; suspect it&#39;s likely to be data that =\r\nhas more precise semantics (eg \n&gt; KIF/RDF/OWL) and in the interim, formats =\r\nlike atom, microformats and \n&gt; rdfa, maybe json based vocabularies.\n&gt; \n&gt; De=\r\nvelopers like their objects so I guess people will keep trying to go \n&gt; dow=\r\nn that path, and you seem happy to do so.  Otherwise this debate is \n&gt; year=\r\ns old, and I&#39;ve seen nothing in over a decade that suggests we&#39;ll \n&gt; move o=\r\nff the current web to something approaching OO, not matter how \n&gt; stupid it=\r\n seems to be each generation of  programmers that discover the \n&gt; web and i=\r\nmmediately wonder how to fix it.\n\n\nI don&#39;t know what KIF is.  I don&#39;t know =\r\nwhat RDFA is.  I know the others.  I think the thing you are missing here i=\r\ns that I am not against any of these ideas, and actually see my vision of t=\r\nhe browser as complementary to Tim Berners-Lee&#39;s vision of the Semantic Web=\r\n and even Google&#39;s vision of the semantic web.  This is hard for me to conf=\r\ness, because my greatest weakness is being so visionary and closed-minded. =\r\n Yet, ya know, these semantic people know what they&#39;re talking about.  I am=\r\n not trying to &quot;fix&quot; anything there.  I&#39;m just waiting for them to bring me=\r\n results so I can take advantage of it.\n\nAs an aside, more pragmatically, y=\r\nou can&#39;t OWL everything and you don&#39;t want to.  This is the same reason why=\r\n Microsoft doesn&#39;t make .NET more modular.  OWL means all your content on t=\r\nhe web is totally modular, fully exposed semantics.  For a lot of companies=\r\n, this means that they are inviting competition.  For example, where I work=\r\n a company currently complements our product by providing rich hypermedia l=\r\nike videos to our clients, while we provide highly structured and organized=\r\n content that is optimized for stereotyped workflows.  If all our content w=\r\nas &quot;out there&quot;, then the rich hypermedia competitor could just siphon us.  =\r\nAt that point, they can go to our clients and say, &quot;we have all the data yo=\r\nu care about, and will charge you half the price.&quot;  Basically, they would b=\r\ne copying our specification (the hardest thing in software to build).\n\n\n&gt; &gt;=\r\n I guess I am reading your sentence as &quot;Unfortunately this is a detail we \n=\r\n&gt; &gt; do not talk about, even though it needs improvement.&quot; Perhaps not fair,=\r\n \n&gt; &gt; but where else are you leading me? It sounds like what I need to hear=\r\n \n&gt; &gt; then is &quot;stop going down this direction, you need to re-crystallize, =\r\n\n&gt; &gt; here is what you need to go and where you need to go.&quot;\n&gt; \n&gt; I would sa=\r\ny distributed objects in the way you&#39;re talking about them are \n&gt; a dead en=\r\nd, yes.\n\n\n\nI never used the phrase &quot;distributed objects&quot;, anywhere.  You pu=\r\nt that word in my mouth.  I am spitting it out.  I don&#39;t even know what the=\r\n heck you mean by &quot;distributed objects&quot;.  You are really being basically th=\r\ne ultimate buzzkill -- using buzzwords with connotative meanings and slappi=\r\nng them onto what I am discussing.\n\nThis is why we have a thread about re-a=\r\ncronymizing everything under the sun.  And exactly why that thread is one o=\r\nf the longest discussions on here in a long time.\n\nI think I am personally =\r\ntoo closed-minded and visionary to be brought down by anyone who wants to b=\r\nuzzkill me.  I know exactly what I want, and despite being an average progr=\r\nammer, I am a very great API designer.  Amazingly, I didn&#39;t go to Stanford =\r\nand I didn&#39;t get hired by Sun to create a super-complicated J2EE EJB 1.0 sp=\r\necification or get hired by Microsoft to chair a steering committee for ATL=\r\n or DCOM.  I know, my credentials suck!\n\n\n\n\n"}}