{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":331949899,"authorName":"Sebastien Lambla","from":"&quot;Sebastien Lambla&quot; &lt;seb@...&gt;","profile":"serialseb","replyTo":"SENDER","senderId":"nOUEVAeZgRogXEzJUMHixAxhQRXBb5ygOZR5DcnKHSgWc9NOSkmJ4tiLZ-2RkNpVSrQeCC36is9EE0ZXZlr5Bg5i30FGskP-xMxNJ38","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [rest-discuss] HTTP State Transitions","postDate":"1248705403","msgId":13142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTEwMi1EUzdFNDQzRUY0QkU4NkMxRjY4OEU2NEI1MTQwQHBoeC5nYmw+","inReplyToHeader":"PDRBNkRBQ0M1LjQwMzA2MDBAbXlrYW5qby5jby51az4=","referencesHeader":"PDRBNjcwQTk4LjEwOTAyMDJAbXlrYW5qby5jby51az4JIDxiZjk3YWI4OTA5MDcyMjA1NTRsNjI3MjkxNTZ1OWVlMTc3MzZiZGQyM2M2MEBtYWlsLmdtYWlsLmNvbT4JIDw0QTY3MEZBNS43MDYwODAzQG15a2Fuam8uY28udWs+CSA8YmY5N2FiODkwOTA3MjIxMzU4eDMyYTE2ZGJ5NDE1NDRmZGNmNjMzYTg4QG1haWwuZ21haWwuY29tPgkgPDRBNkQ2QzY2LjcwMjA4QG15a2Fuam8uY28udWs+CSA8YmY5N2FiODkwOTA3MjcwMjA4eDE4MzNkM2ZlbjYyMTJhODdiODBjMGNiNjlAbWFpbC5nbWFpbC5jb20+CSA8NEE2RDc3MzcuMTAzMDIwN0BteWthbmpvLmNvLnVrPiA8YmY5N2FiODkwOTA3MjcwMjU1dDIxMzgwOTU0Z2I2ZWMyMDliN2UwYzMxYzlAbWFpbC5nbWFpbC5jb20+IDw0QTZEODBENi41MDQwOTA5QG15a2Fuam8uY28udWs+IDxCTFUxMDItRFMxMDg2RDk1MDQxN0FDRjkwREIzRDVCNTE0MEBwaHguZ2JsPiA8NEE2REFDQzUuNDAzMDYwMEBteWthbmpvLmNvLnVrPg=="},"prevInTopic":13141,"nextInTopic":13161,"prevInTime":13141,"nextInTime":13143,"topicId":13113,"numMessagesInTopic":25,"msgSnippet":"... That s the state of web architecture, and of ReST over http. ... URIs identify resources. If you provide a new media type that requires both URI and","rawEmail":"Return-Path: &lt;seb@...&gt;\r\nX-Sender: seb@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 88686 invoked from network); 27 Jul 2009 14:37:05 -0000\r\nX-Received: from unknown (69.147.108.201)\n  by m2.grp.sp2.yahoo.com with QMQP; 27 Jul 2009 14:37:05 -0000\r\nX-Received: from unknown (HELO blu0-omc3-s7.blu0.hotmail.com) (65.55.116.82)\n  by mta2.grp.re1.yahoo.com with SMTP; 27 Jul 2009 14:37:05 -0000\r\nX-Received: from BLU102-DS7 ([65.55.116.73]) by blu0-omc3-s7.blu0.hotmail.com with Microsoft SMTPSVC(6.0.3790.3959);\n\t Mon, 27 Jul 2009 07:36:44 -0700\r\nX-Originating-Email: [seb@...]\r\nMessage-ID: &lt;BLU102-DS7E443EF4BE86C1F688E64B5140@...&gt;\r\nReturn-Path: seb@...\r\nTo: &quot;&#39;Mike Kelly&#39;&quot; &lt;mike@...&gt;,\n\t&quot;&#39;Rest List&#39;&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;4A670A98.1090202@...&gt;\t &lt;bf97ab890907220554l62729156u9ee17736bdd23c60@...&gt;\t &lt;4A670FA5.7060803@...&gt;\t &lt;bf97ab890907221358x32a16dby41544fdcf633a88@...&gt;\t &lt;4A6D6C66.70208@...&gt;\t &lt;bf97ab890907270208x1833d3fen6212a87b80c0cb69@...&gt;\t &lt;4A6D7737.1030207@...&gt; &lt;bf97ab890907270255t21380954gb6ec209b7e0c31c9@...&gt; &lt;4A6D80D6.5040909@...&gt; &lt;BLU102-DS1086D950417ACF90DB3D5B5140@...&gt; &lt;4A6DACC5.4030600@...&gt;\r\nIn-Reply-To: &lt;4A6DACC5.4030600@...&gt;\r\nDate: Mon, 27 Jul 2009 15:36:43 +0100\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 12.0\r\nThread-Index: AcoOvuYSvCVP/LmxR9+Gw3PmBhUYkQAAJXvg\r\nContent-Language: en-gb\r\nX-OriginalArrivalTime: 27 Jul 2009 14:36:44.0722 (UTC) FILETIME=[AA051120:01CA0EC7]\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Sebastien Lambla&quot; &lt;seb@...&gt;\r\nSubject: RE: [rest-discuss] HTTP State Transitions\r\nX-Yahoo-Group-Post: member; u=331949899; y=trfGh7VNR8F_MYsc2fWwwiKp2SMnrnZGcHpdAhb-31i6dR3V\r\nX-Yahoo-Profile: serialseb\r\n\r\n&gt; Essentially: I don&#39;t assume just because I need to provide a hyperlink\n&gt; to a representation, that it must have its own URI.\n\nThat&#39;s the state of web architecture, and of ReST over http.\n\n&gt;  Maybe it is\n&gt; possible\n&gt; to have a new type of hypermedia with hyperlinks capable of providing\n&gt; control data to a UA - I don&#39;t see this as far different from using the\n&gt; end of a URI - other than the clear benefits of keeping the distinction\n&gt; between resources and representations clear.\n\nURIs identify resources. If you provide a new media type that requires both\nURI and control data, you created a new identifier, one that is not a URI\nonly, and one that is not in use by the rest of the web architecture.\n\n&gt; &gt; I&#39;m going back to what I stated before. If you care about identifying\n&gt; &gt; separate things, then they should be separate things. Conneged\n&gt; &gt; representations are *not* separate things because they share the same\n&gt; &gt; identifier.\n&gt; &gt;\n&gt; \n&gt; Again, your terminology is confusing.\n\nIt seems to be a leitmotiv of this conversation. Let&#39;s try once more.\n\n&gt; Separate representations are separate &#39;things&#39;.\n&gt; \n&gt; They aren&#39;t separate resources; which is why they are treated as\n&gt; representations of a single resource.\n\nA resource is a thing, anything, that has an identifier.\n\nA thing, anything, that doesn&#39;t have an identifier, is not a resource.\n\nA thing, anything, that you need to identify or operate upon by applying a\nstate transition has to be a resource.\n\nThe identifier in ReST over http is the URI.\n\n&gt; &gt; The application state is dependent on you navigating between things,\n&gt; not\n&gt; &gt; between representation of those things. If the representations have a\n&gt; &gt; meaningful distinction for the continuation of the state transitions,\n&gt; they\n&gt; &gt; should have identifiers.\n&gt; \n&gt; Again, I&#39;m confused by this notion of &#39;things&#39;. If I substitute in\n&gt; &#39;resource&#39; instead, the distinction that can be drawn between resource\n&gt; and representation seems to become uncomfortably vague, and so you have\n&gt; to question whether there is any value in the distinction at all.\n\nLet&#39;s retry this again, reformulated for hopefully more clarity.\n\nA representation of a resource is a set of bytes that &quot;represent&quot; a resource\nand is used as the data payload when operating resources.\n\nIt happens that sometimes a resource, when dereferenced, has one\nrepresentation that is the full and entire &quot;representation&quot; of the resource.\nIn this instance, the representation may be the resource. For example,\nlocalhost/mycv.doc is the resource &quot;the word document that describes Seb&#39;s\nprofessional life&quot;. There is no need of distinction between resource and\nrepresentation, as the resulting representation is the resource.\n\nThe distinction between resource and representation is as vague as the\nnaming function is. If you need to identify &quot;the last customer that\nregistered on my site, in html&quot;, that&#39;s a resource for which only an html\nrepresentation exists. If you need to identify &quot;The last customer that\nregistered on my site&quot;, that&#39;s a resource, that happens to have an html\nrepresentation.\n\nIf you navigating the application state requires you going back to the html\nversion, and not for example the json version, then you have two resources\nwith separate identifiers, as they identify a different &quot;thing&quot;. If it\ndoesn&#39;t matter to anyone, then you can have conneg on one resource with one\nidentifier.\n\nAs for the value of distinguishing resource and representation, it has the\nvalue of being required to ensure a late-bound system where a resource can\nbe identified before a representation can be produced, or even before the\nresource itself exist. Without the distinction, not only do you limit the\nvalue of identifying things to those that have a representation that can be\nretrieved, you also prevent other schemes that cannot be dereferenced, such\nas mailto:.\n \n&gt; Self-descriptive messages that contain no ambiguity whatsoever over\n&gt; what\n&gt; resource was being requested and how the representation was negotiated.\n&gt; What do you get other than plain text hyperlinks to representations?!\n\nA bookmark is just the plain text hyperlink. A hyperlink within a media type\nmay have additional hints to help in dereferencing. It still doesn&#39;t impact\nthe &quot;identification&quot; as opposed to the &quot;dereferencing&quot;.\n\nIdentifying is done independently, and at a higher level in the web stack,\nthan dereferencing, and as such than representation.\n\n&gt; \n&gt; &gt; Client-driven conneg can only work for resource representations that\n&gt; do not\n&gt; &gt; differ enough to be meaningful to either the UA or the application\n&gt; state,\n&gt; &gt; hence why there is no provision for the extra data required to\n&gt; identify\n&gt; &gt; those.\n&gt; \n&gt; You mean like accept headers?\n\nAgain, it&#39;s a matter of layering. Resources require URIs. Http require\nresources. The operation of identifying a resource is not tied to http,\naccept headers are metadata to help find a suitable representation when\ndereferencing.\n\nMedia types are at the right level in the stack to add control data to hint\nas to which representation may be retrieved, but they don&#39;t change the\nsemantics of resource identification.\n\nI think your question comes down to &quot;shouldn&#39;t they, by specializing&quot;, and\ni&#39;ve already made my point clear: creating a new resource when you want to\nuniquely identify something is enough, requires less changes to webarch, and\nis cheap.\n\n&gt; &gt; You say it yourself in the next paragraph:\n&gt;\n&gt; I don&#39;t if you&#39;re reading that from my perspective on what constitutes\n&gt; application state (i.e. the entire message).\n\nI am making the point that application state is the sum of identifications,\nhypermedia controls, current state on the server and current state on the\nclient. If your question was, can one resume a state transition by\nbookmarking the state of the current application, and be brought back to\nwhere they were, then this would depend on the state on the client: if the\npage is in cache, and the data in the form has been persisted by the browser\nwhen bookmarking, then yes. If there is no cache, and only a URI exist, it&#39;s\nup to the client to re-request state from the server to &quot;rehydrate&quot; itself.\n\nThe browser cache, and whatever data is saved when bookmarking, is the local\nstorage that is part of the general application state.\n\nApplication crash recovery in browsers is a good example of persisted\napplication state being resumed, so it&#39;s already there, but it encompasses\nall the state that was on the client that compose part of the application\nstate.\n\nRedefining the identifier mechanism to solve the false problem of conneg is\nnot buying you enough to be useful, when the existing mechanism can work\njust as well without redefining such an essential functionality.\n\n&gt; That&#39;s true *if* a state can only be defined by a URI, and not the rest\n&gt; of the message.\n\nApplication State is not defined by either. It&#39;s defined by the whole of the\nbrowser cache, local storage, content of forms, plus everything that&#39;s on\nthe server. If you loose the state on the client, being able to bookmark a\nspecific representation won&#39;t buy you any better functionality than the one\nthat already exist.\n\n&gt; &gt; I&#39;m afraid we may just not be using the same terminology. I use the\n&gt; word\n&gt; &gt; &#39;identifier&#39; with the meaning of &#39;identifying a resource&#39;, and\n&gt; &#39;resource&#39; as\n&gt; &gt; &#39;the smallest unit i can deal with when doing state transitions in\n&gt; ReST&#39;\n&gt; \n&gt; &quot;A resource is a conceptual mapping to a set of entities, not the\n&gt; entity\n&gt; that corresponds to the mapping at any particular point in time.&quot;\n\nThen I think you&#39;ll agree with me that at no point in the ReST discertation,\nor in webarch for that matter, is anyone talking about identifying and\nmanipulating the set of entities themselves, without the &#39;resource&#39; concept.\n\nIt so happens that the resource in question may be &quot;the customer as xml&quot; as\nopposed to &quot;the customer&quot;.\n\n&gt; I&#39;m actually suggesting a new form of hypermedia which provides markup\n&gt; for hyperlinks that can include control data i.e.:\n&gt; \n&gt; &lt;a href=&quot;/resource&quot; accept=&quot;application/pdf&quot;&gt;link to pdf\n&gt; representation&lt;/a&gt;\n\nAdding such a hint to a specific media type is possible, and the &lt;link&gt; tag\nalready does that. But it&#39;s a hint, not part of the identification function.\n\nIf it was, you suddenly couldn&#39;t copy n paste a URL, or email it to someone\nelse, or link it in a wiki or an atom feed.\n\n&gt; Identify distinct resources with resource identifiers. Negotiate\n&gt; representations of resources with the appropriate conneg controls.\n&gt; Create hypermedia formats which allow the server to specify a hyperlink\n&gt; with specific control data required to negotiate a specific\n&gt; representation.\n\nSee above, if you &quot;require&quot; the control data, you redefine the\nidentification functionality and break the rest of the web architecture.\n\nNot ignoring the rest of the message, but my argument will be the same.\n\nSeb\n\n\n"}}