{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":364579677,"authorName":"Mike Kelly","from":"Mike Kelly &lt;mike@...&gt;","profile":"pleb1985","replyTo":"SENDER","senderId":"-eyOK4ITRLxQN-47-jjf555J5ALgcdYLuTO4xMB6Kf_mlmiRs1lw0LwpMqWtMBHQZe5ON18DCIO3qh6UUHf7rfVZruKVBw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] HTTP State Transitions","postDate":"1248701637","msgId":13141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNkRBQ0M1LjQwMzA2MDBAbXlrYW5qby5jby51az4=","inReplyToHeader":"PEJMVTEwMi1EUzEwODZEOTUwNDE3QUNGOTBEQjNENUI1MTQwQHBoeC5nYmw+","referencesHeader":"PDRBNjcwQTk4LjEwOTAyMDJAbXlrYW5qby5jby51az4JIDxiZjk3YWI4OTA5MDcyMjA1NTRsNjI3MjkxNTZ1OWVlMTc3MzZiZGQyM2M2MEBtYWlsLmdtYWlsLmNvbT4JIDw0QTY3MEZBNS43MDYwODAzQG15a2Fuam8uY28udWs+CSA8YmY5N2FiODkwOTA3MjIxMzU4eDMyYTE2ZGJ5NDE1NDRmZGNmNjMzYTg4QG1haWwuZ21haWwuY29tPgkgPDRBNkQ2QzY2LjcwMjA4QG15a2Fuam8uY28udWs+CSA8YmY5N2FiODkwOTA3MjcwMjA4eDE4MzNkM2ZlbjYyMTJhODdiODBjMGNiNjlAbWFpbC5nbWFpbC5jb20+CSA8NEE2RDc3MzcuMTAzMDIwN0BteWthbmpvLmNvLnVrPiA8YmY5N2FiODkwOTA3MjcwMjU1dDIxMzgwOTU0Z2I2ZWMyMDliN2UwYzMxYzlAbWFpbC5nbWFpbC5jb20+IDw0QTZEODBENi41MDQwOTA5QG15a2Fuam8uY28udWs+IDxCTFUxMDItRFMxMDg2RDk1MDQxN0FDRjkwREIzRDVCNTE0MEBwaHguZ2JsPg=="},"prevInTopic":13140,"nextInTopic":13142,"prevInTime":13140,"nextInTime":13142,"topicId":13113,"numMessagesInTopic":25,"msgSnippet":"Seb, Essentially: I don t assume just because I need to provide a hyperlink to a representation, that it must have its own URI. Maybe it is possible to have a","rawEmail":"Return-Path: &lt;mike@...&gt;\r\nX-Sender: mike@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 72237 invoked from network); 27 Jul 2009 13:34:02 -0000\r\nX-Received: from unknown (69.147.108.201)\n  by m5.grp.sp2.yahoo.com with QMQP; 27 Jul 2009 13:34:02 -0000\r\nX-Received: from unknown (HELO moutng.kundenserver.de) (212.227.126.186)\n  by mta2.grp.re1.yahoo.com with SMTP; 27 Jul 2009 13:34:01 -0000\r\nX-Received: from [192.168.255.19] (nsbbjx215_122.xband.newtelsolutions.net [213.133.215.122])\n\tby mrelayeu.kundenserver.de (node=mreu1) with ESMTP (Nemesis)\n\tid 0MKv1o-1MVQL00kNp-0008UT; Mon, 27 Jul 2009 15:33:59 +0200\r\nMessage-ID: &lt;4A6DACC5.4030600@...&gt;\r\nDate: Mon, 27 Jul 2009 14:33:57 +0100\r\nUser-Agent: Thunderbird 2.0.0.22 (X11/20090608)\r\nMIME-Version: 1.0\r\nTo: Sebastien Lambla &lt;seb@...&gt;, \n Rest List &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;4A670A98.1090202@...&gt;\t &lt;bf97ab890907220554l62729156u9ee17736bdd23c60@...&gt;\t &lt;4A670FA5.7060803@...&gt;\t &lt;bf97ab890907221358x32a16dby41544fdcf633a88@...&gt;\t &lt;4A6D6C66.70208@...&gt;\t &lt;bf97ab890907270208x1833d3fen6212a87b80c0cb69@...&gt;\t &lt;4A6D7737.1030207@...&gt; &lt;bf97ab890907270255t21380954gb6ec209b7e0c31c9@...&gt; &lt;4A6D80D6.5040909@...&gt; &lt;BLU102-DS1086D950417ACF90DB3D5B5140@...&gt;\r\nIn-Reply-To: &lt;BLU102-DS1086D950417ACF90DB3D5B5140@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-Provags-ID: V01U2FsdGVkX1+HE5Ceq0z0IC3IjEaIkESeT/d2YGOmaOcNbuQ\n 1w8hEm/Kw2okpve5OcJDRdEdDYP9yydAXjpoWxChkmcOHWLAan\n p2gHo3CKKWdQQn84o6HBWHvxbWOk4T5\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Mike Kelly &lt;mike@...&gt;\r\nSubject: Re: [rest-discuss] HTTP State Transitions\r\nX-Yahoo-Group-Post: member; u=364579677; y=_KIFSTpulf_fqSX3UQljDC3_WOylmsliw0hU2CkCiE6myAc\r\nX-Yahoo-Profile: pleb1985\r\n\r\nSeb,\n\nEssentially: I don&#39;t assume just because I need to provide a hyperlink \nto a representation, that it must have its own URI. Maybe it is possible \nto have a new type of hypermedia with hyperlinks capable of providing \ncontrol data to a UA - I don&#39;t see this as far different from using the \nend of a URI - other than the clear benefits of keeping the distinction \nbetween resources and representations clear.\n\nSpecific responses below:\n\n\nSebastien Lambla wrote:\n&gt;&gt;&gt;     I&#39;m not sure if I understand the distinction you make between\n&gt;&gt;&gt;     application and resource state\n&gt;&gt;&gt;\n&gt;&gt;&gt; XHTML / JSON formats are an attribute of the resource representation\n&gt;&gt;&gt;       \n&gt;&gt; -\n&gt;&gt;     \n&gt;&gt;&gt; they cannot be an attribute of the application state, since from an\n&gt;&gt;&gt; application perspective, the user is exactly at the same place in the\n&gt;&gt;&gt; overall workflow irrespective of the resource representation.\n&gt;&gt;&gt;       \n&gt;&gt; This seems to imply tight coupling between resource and application\n&gt;&gt; state. I can&#39;t agree that these are the same states from an application\n&gt;&gt; perspective because they are clearly distinguished by control data in\n&gt;&gt; the HTTP message (Accept/Content-Type in this specific case).\n&gt;&gt;     \n&gt;\n&gt; I&#39;m going back to what I stated before. If you care about identifying\n&gt; separate things, then they should be separate things. Conneged\n&gt; representations are *not* separate things because they share the same\n&gt; identifier.\n&gt;   \n\nAgain, your terminology is confusing.\n\nSeparate representations are separate &#39;things&#39;.\n\nThey aren&#39;t separate resources; which is why they are treated as \nrepresentations of a single resource.. and given the same *resource* \nidentifier. That is all a URI is for.\n\n&gt; The application state is dependent on you navigating between things, not\n&gt; between representation of those things. If the representations have a\n&gt; meaningful distinction for the continuation of the state transitions, they\n&gt; should have identifiers.\n\nAgain, I&#39;m confused by this notion of &#39;things&#39;. If I substitute in \n&#39;resource&#39; instead, the distinction that can be drawn between resource \nand representation seems to become uncomfortably vague, and so you have \nto question whether there is any value in the distinction at all.\n\n\n&gt; The identifiers we have are URIs to resources. If\n&gt; representations matter, then they should have their own identifiers, as such\n&gt; be promoted to resources themselves.\n&gt;   \n\nYes - I&#39;m still clear that representations *can* be treated as if they \nwere resources! :)\n\n&gt; Let&#39;s put it another way. If your application state depends not only on the\n&gt; existing identifier, but also in control state data, you have indeed created\n&gt; a new identifier, aka (URI+Method+Accept headers). I fail to see what this\n&gt; brings you, as opposed to simply identify representations as separate\n&gt; things?\n&gt;   \n\nSelf-descriptive messages that contain no ambiguity whatsoever over what \nresource was being requested and how the representation was negotiated. \nWhat do you get other than plain text hyperlinks to representations?!\n\n&gt; Client-driven conneg can only work for resource representations that do not\n&gt; differ enough to be meaningful to either the UA or the application state,\n&gt; hence why there is no provision for the extra data required to identify\n&gt; those.\n&gt;   \n\nYou mean like accept headers?\n\n&gt; You say it yourself in the next paragraph:\n&gt;   \n\nI don&#39;t if you&#39;re reading that from my perspective on what constitutes \napplication state (i.e. the entire message).\n\n&gt;   \n&gt;&gt;&gt;     If a bookmark is not a stored reference to a given application\n&gt;&gt;&gt;     state, what is it?\n&gt;&gt;&gt;\n&gt;&gt;&gt; In this context it is a stored reference to an application state + a\n&gt;&gt;&gt; preferred format.\n&gt;&gt;&gt;       \n&gt;&gt; The array of representations for a given resource are not application\n&gt;&gt; states in their own right?\n&gt;&gt;\n&gt;&gt; How would you model negotiating these formats in a state machine,\n&gt;&gt; without treating them as separate states?\n&gt;&gt;     \n&gt;\n&gt; If they have any meaningful distinction, then you represent them as\n&gt; separately identified resources. If they do not have meaningful distinction,\n&gt; then you don&#39;t.\n&gt;   \n\nThat&#39;s true *if* a state can only be defined by a URI, and not the rest \nof the message.\n\n&gt;   \n&gt;&gt; I understand that a representation can be &#39;made a resource&#39;, although\n&gt;&gt; the phrase &#39;treated as if it were&#39; would be more appropriate.\n&gt;&gt;     \n&gt;\n&gt; I&#39;m afraid we may just not be using the same terminology. I use the word\n&gt; &#39;identifier&#39; with the meaning of &#39;identifying a resource&#39;, and &#39;resource&#39; as\n&gt; &#39;the smallest unit i can deal with when doing state transitions in ReST&#39;\n\n&quot;A resource is a conceptual mapping to a set of entities, not the entity \nthat corresponds to the mapping at any particular point in time.&quot;\n\n&gt; and\n&gt; as &#39;the thing / conceptual mapping / awww:resource identified by an\n&gt; identifier&#39;. As such, I object strongly to the idea that there would be such\n&gt; a thing as &#39;treating a thing as a resource&#39;. If it&#39;s important enough for me\n&gt; to interact with, and if it&#39;s identified, it&#39;s a resource.\n&gt;\n&gt;   \n\n... :)\n\n&gt;&gt; It&#39;s slightly confusing when you state that an identifier to a resource\n&gt;&gt; is &#39;enough&#39;, and then immediately contradict this position by\n&gt;&gt; entertaining &#39;the case that you want to identify a specific\n&gt;&gt; representation&#39;.\n&gt;&gt;     \n&gt;\n&gt; I apologize for introducing confusion. Let me attempt to reformulate better.\n&gt;\n&gt; If you want to interact with a thing, it has to be a resource. If you want\n&gt; to interact with two things distinctively, they are then fundamentally, by\n&gt; the ReST and HTTP requirement of resources having an identifier, two\n&gt; distinct resources. If however you interact with a single resource, that has\n&gt; multiple representations that you do not need to address specifically, then\n&gt; you may use conneg and have only one thing.\n&gt;\n&gt; To take a specific example, if the plain text representation of this email\n&gt; is available at localhost/2234, and I wanted to interact with the plain/text\n&gt; media type with that resource, I could do so by using it&#39;s identifier. I\n&gt; could also endup using conneg so that I could receive the text in both UTF-8\n&gt; and UTF-16 variations. If, on the other hand, I was maintaining a French and\n&gt; an English version of that message, I would find it useful to update the\n&gt; French version without impacting the English version. While they may carry\n&gt; the same meaning, the French and English versions are hardly the &quot;same&quot;\n&gt; thing, as the difference between the two languages will always trigger some\n&gt; slight variations in the meaning of the text.\n&gt;   \n\nActually the language example is exactly the kind of situation that can \nwarrant the translated documents to be treated as resources, with \nseparate URIs.\n\nThis is because the documents are actually being treated as separate \nresources in their own right - where one is updated, and the other is \nnon-equivalent until it is translated and updated at some other point in \ntime.\n\nIf that system worked in a way which tied the two together by \nautomatically translating an update of one to the other, then I would be \ninclined to use HTTP conneg instead.\n\n&gt; Those two language variations may well be &quot;the response Sebastien is giving\n&gt; to Mike&quot;, but the two messages are two distinct texts, that are distinct\n&gt; things: &quot;the French response&quot; and &quot;the English response&quot;. And that&#39;s why\n&gt; they&#39;d have two distinct identifiers and be two distinct resources.\n&gt;   \n\nYep, no problem with that particular example - it&#39;s likely the right way \nto go given the problems associated with automated translation.\n\n&gt;&gt; So it&#39;s hard, from that, to make sense of whether or not treating a\n&gt;&gt; representation as a resource &#39;ought to be enough&#39;. This is particularly\n&gt;&gt; apparent given, as I mentioned before, the only significant benefit\n&gt;&gt; from\n&gt;&gt; doing this is that you get *plain text* hyperlinks to your\n&gt;&gt; representations - the value of this is questionable if an identifier to\n&gt;&gt; a resource is &#39;enough&#39; in the first place.\n&gt;&gt;     \n&gt;\n&gt; So you suggest that identifying a resource and dereferencing identifiers by\n&gt; following hyperlink controls is not enough to navigate application state?\n&gt;   \n\nNot if I want to link to specific representations of a resource, no.\n\n&gt; You&#39;re either proposing a new identifier that includes http control data, or\n&gt; you&#39;re not happy with how the web currently works. Either way, I&#39;m not so\n&gt; sure what you&#39;re suggesting is actually buying, to http, to ReST, or to the\n&gt; web.\n&gt;\n&gt;   \n\nI&#39;m actually suggesting a new form of hypermedia which provides markup \nfor hyperlinks that can include control data i.e.:\n\n&lt;a href=&quot;/resource&quot; accept=&quot;application/pdf&quot;&gt;link to pdf representation&lt;/a&gt;\n\n&gt;&gt;&gt; The state transition is the result of dereferencing such identifier,\n&gt;&gt;&gt;       \n&gt;&gt; and is\n&gt;&gt;     \n&gt;&gt;&gt; dependent on the state of the application. As such, it is of course\n&gt;&gt;&gt; dependent on the current state the client has, if any, and the\n&gt;&gt;&gt;       \n&gt;&gt; current state\n&gt;&gt;     \n&gt;&gt;&gt; the server holds.\n&gt;&gt;&gt;\n&gt;&gt;&gt;       \n&gt;&gt; If it is possible for a hyperlink to include control data, then a\n&gt;&gt; hypermedia driven state transition is more than simply dereferencing an\n&gt;&gt; href URI.\n&gt;&gt;     \n&gt;\n&gt; No, hyperlink controls do not do that. Let&#39;s take an example of a well-known\n&gt; control. &lt;form action=&quot;/&quot; method=&quot;POST&quot; enctype=&quot;multipart/form-data&quot; /&gt;\n&gt;\n&gt; The URI in action is the identifier to the resource for which an operation\n&gt; will execute. Everything else is a hint to the user-agent to let it\n&gt; understand the representation format it can send, and the http method being\n&gt; expected from it.\n&gt;\n&gt; What this means is that the target resource is identified by its URI. The\n&gt; state transition is helped by hinting to the UA how to process the\n&gt; transition, aka how to build the representation that will be used in the\n&gt; transition.\n&gt;\n&gt; At no point is there a new identifier for (/ with POST with mediatype\n&gt; multipart). That would be a new identifier entirely, and one I see very\n&gt; little value in. At no point either is there any assertion that the target\n&gt; resource only support the multipart/form-data media type, or that you can\n&gt; only operate on it with the POST method.\n&gt;\n&gt; That&#39;s why this data is part of a hypermedia link, and why this hypermedia\n&gt; link contains both the identifier and the mean to interact with it.\n&gt;\n&gt; Nothing prevents me from achieving the same result by using OPTIONS to\n&gt; discover the methods and the media types (using the Link: header) and\n&gt; achieve the same state transition.\n&gt;\n&gt; That&#39;s why I said they were at different levels in the stack. Resources are\n&gt; things, representations are what you use to manipulate things, and\n&gt; hypermedia controls are the hints that help the UA discover resources and\n&gt; build the representations to manipulate those things.\n&gt;   \n\nI&#39;m trying to establish whether or not state transitions include the \nentire HTTP message, and if so - whether hypermedia controls should \nprovide the mechanisms to indicate control data.\n\nI understand the practical limitations of browsers and HTML - you \nhaven&#39;t actually said much here about HTTP or potential hypermedia \nformats/controls.\n\n&gt; The core of your argument has been around conneg, but I think you&#39;re wanting\n&gt; to see more in conneg than what it was designed for, and I still do not\n&gt; understand why it is such an issue to identify distinct things distinctly.\n&gt;   \n\nIdentify distinct resources with resource identifiers. Negotiate \nrepresentations of resources with the appropriate conneg controls. \nCreate hypermedia formats which allow the server to specify a hyperlink \nwith specific control data required to negotiate a specific representation.\n\n&gt; Maybe if you could provide some scenarios that you cannot achieve through\n&gt; the current understanding of what resources and representations are in the\n&gt; context of ReST we could have a better substrate for conversation.\n&gt;   \n\nPretend twitter doesn&#39;t use (.xml/.json/.html) URIs to separate \nrepresentations of a tweet.\n\nHow could I add links to my homepage for each of the xml, json, and html \nrepresentations?\n\nAn accept attribute in the hyperlink would work:\n\n&lt;a href=&quot;twitter.com/tweet/1234&quot; accept=&quot;application/xml&quot;&gt;xml of my \ntweet&lt;/a&gt;\n&lt;a href=&quot;twitter.com/tweet/1234&quot; accept=&quot;application/json&quot;&gt;json of my \ntweet&lt;/a&gt;\n&lt;a href=&quot;twitter.com/tweet/1234&quot;&gt;Default (HTML) of my tweet&lt;/a&gt;\n\nIf I decided I wanted to update the tweet; a PUT would automatically \ninvalidate the cache for all representations at the URI - and any other \nintermediary could see exactly which resource the request/response \nmessages were about without having to assume any relationships between \nany (what are supposed to be opaque) URIs.\n\nCheers,\nMike\n\n"}}