{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"MO9UhhTGK_vm_7zdLwMiGBrds4sOP_WhNwz3WGMsfsB6TfXkwIip0BaQTCik_ESJB7fBkodCXCwRQo0xGzM_D65VYiqFT6bNDg6zhwE12Q","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] Hateoas or mini-RPC?","postDate":"1253385597","msgId":13396,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDkwOTE5MTIzOTU3Ljg3YjJiMWYxLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","inReplyToHeader":"PDRBQjUwQzM3LjIwNDAwMDNAcmVkaGF0LmNvbT4=","referencesHeader":"PDRBMDRBRDlDLjcwMTA0MDZAcmVkaGF0LmNvbT4JPDIwMDkwNTA4MTcyNDUyLjk4YmQ2MzM2LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPDRBMDc2MjNGLjIwMTAwMDRAcmVkaGF0LmNvbT4JPDIwMDkwOTE5MDg1MzE0LjMzMjRiODg4LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPDRBQjUwQzM3LjIwNDAwMDNAcmVkaGF0LmNvbT4="},"prevInTopic":13395,"nextInTopic":13397,"prevInTime":13395,"nextInTime":13397,"topicId":12583,"numMessagesInTopic":22,"msgSnippet":"... I m not interested in discrediting you.  I dredged up this thread because you re still making the same fundamental mistake to this day -- not because I m","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 50523 invoked from network); 19 Sep 2009 18:40:22 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m6.grp.re1.yahoo.com with QMQP; 19 Sep 2009 18:40:22 -0000\r\nX-Received: from unknown (HELO mxout-08.mxes.net) (216.86.168.183)\n  by mta3.grp.sp2.yahoo.com with SMTP; 19 Sep 2009 18:40:21 -0000\r\nX-Received: from bigbison (unknown [65.117.211.162])\n\t(using TLSv1 with cipher DHE-RSA-AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\tby smtp.mxes.net (Postfix) with ESMTPSA id 34FBD509D9;\n\tSat, 19 Sep 2009 14:40:14 -0400 (EDT)\r\nDate: Sat, 19 Sep 2009 12:39:57 -0600\r\nTo: Bill Burke &lt;bburke@...&gt;\r\nCc: REST-Discuss Discussion Group &lt;rest-discuss@yahoogroups.com&gt;\r\nMessage-Id: &lt;20090919123957.87b2b1f1.eric@...&gt;\r\nIn-Reply-To: &lt;4AB50C37.2040003@...&gt;\r\nReferences: &lt;4A04AD9C.7010406@...&gt;\n\t&lt;20090508172452.98bd6336.eric@...&gt;\n\t&lt;4A07623F.2010004@...&gt;\n\t&lt;20090919085314.3324b888.eric@...&gt;\n\t&lt;4AB50C37.2040003@...&gt;\r\nOrganization: Bison Systems Corporation\r\nX-Mailer: Sylpheed 2.6.0 (GTK+ 2.10.14; i686-pc-mingw32)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nSubject: Re: [rest-discuss] Hateoas or mini-RPC?\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nBill Burke wrote:\n\n&gt; \n&gt; Eric J. Bowman wrote:\n&gt; &gt; On Fri, 08 May 2009 18:09:32 -0400\n&gt; &gt; Bill Burke &lt;bburke@...&gt; wrote:\n&gt; &gt; \n&gt; &gt;&gt; Let&#39;s say I have an Order resource in a ecommerce Order Entry\n&gt; &gt;&gt; system. How would I implement my service so that I can cancel an\n&gt; &gt;&gt; order rather than delete it?  One is to have the cancel state as\n&gt; &gt;&gt; part of the order. THen I can just put a new representation with\n&gt; &gt;&gt; the cancelled state set to true:\n&gt; &gt;&gt;\n&gt; &gt;&gt; PUT /orders/333\n&gt; &gt;&gt; content-type: application/xml\n&gt; &gt;&gt;\n&gt; &gt;&gt; &lt;order id=&quot;333&quot;&gt;\n&gt; &gt;&gt;     &lt;cancelled&gt;false&lt;/cancelled&gt;\n&gt; &gt;&gt; ...\n&gt; &gt;&gt; &lt;/order&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; Seems kinda heavy to me.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Would it still be restful to define a &quot;cancelled&quot; URI that you\n&gt; &gt;&gt; could put or post to to change the state?\n&gt; &gt;&gt;\n&gt; &gt; \n&gt; &gt; Absolutely not.  When you want to change the state of a resource,\n&gt; &gt; you manipulate that resource -- you don&#39;t assign the operation to\n&gt; &gt; some other URL.  The proper way of doing this is what you started\n&gt; &gt; with, as myself and others told you.  But you are more concerned\n&gt; &gt; with calling what you&#39;re doing REST by playing semantics with the\n&gt; &gt; terminology, than you are with learning REST -- this is my opinion\n&gt; &gt; from dealing with you on rest-discuss, and observing your responses\n&gt; &gt; to others on rest-discuss.\n&gt; &gt; \n&gt; \n&gt; If you want, I can send you hundreds of other emails I&#39;ve sent that\n&gt; you can use to discredit me.  One particularly juicy one I sent a few\n&gt; years ago is where I described REST as &quot;pretty&quot; URLs.  Ping me\n&gt; offline if you&#39;re interested.\n&gt; \n\nI&#39;m not interested in discrediting you.  I dredged up this thread\nbecause you&#39;re still making the same fundamental mistake to this day --\nnot because I&#39;m looking to embarass you.  Everyone here but Roy has\nposted stuff that they&#39;re embarassed by, in retrospect, after learning\nbetter, I&#39;m sure.\n\nI&#39;ve been very polite in pointing out that your solutions are RPC, not\nREST, in an effort to help you learn -- because it was obvious you\nneeded some help.  Your response was argumentative and defensive, so I\nlet this thread drop, figuring it didn&#39;t matter that you weren&#39;t\ninterested in learning from your mistakes.  Well, my attitude there\nchanged with the introduction of REST-*.  Now it does matter.\n\nI&#39;m here to learn what I don&#39;t know, and teach what I do know.  Is  your\npurpose here only to sow unREST?  Your other message this morning seems\nto indicate that you&#39;re going to go on calling what you do REST,\nwhether it is or not.  Bumping this thread is a precursor to my\nresponse to that other post, precipitated by that other post.\n\n&gt;\n&gt; Seriously though, considering the plethora of different responses to \n&gt; this thread, a lot of people are performing similar thought exercises.\n&gt; \n\nYes, there certainly is a lot of confusion out there surrounding REST.\nThe fact that some people agreed with your approach doesn&#39;t amount to\nsome sort of consensus. REST isn&#39;t so abstract that there&#39;s no wrong\nanswer. If you&#39;re here to learn, then you need to accept (and question)\nwhat you&#39;re being told, not keep insisting that you&#39;re right.\n\n&gt; \n&gt; &gt; No, providing a link to a resource doesn&#39;t make that resource\n&gt; &gt; RESTful. Pretend I&#39;ve just posted a link to a butt-ugly URL that\n&gt; &gt; obviously has nothing to do with REST.  Following the link to get\n&gt; &gt; to that butt-ugly non-RESTful URL doesn&#39;t make that URL RESTful.\n&gt; &gt;  \n&gt; \n&gt; Well consider a different scenario that I had posted earlier.  You\n&gt; are modeling a data cache.  Adding and retrieving data and\n&gt; representations from the cache is pretty easy to model restfully.\n&gt; But consider the act of purging a cache or running some kind of\n&gt; eviction policy.  While purging a cache changes the state of the\n&gt; cache, it is in and of itself *not* state of the cache.  Pure\n&gt; operations do exist within applications.\n&gt; \n\nSure they do.  But in REST, these operations are abstracted to fit the\nUniform Interface, not turned into an endpoint for RPC operations.  My\nassessment of your character would improve considerably if you could\naccept that just because a URI is linked to, doesn&#39;t make it a REST\nresource.  This is a fundamental truth, not a matter open for debate.\n\n&gt;\n&gt; Futhermore, if links can&#39;t be mechanisms to modify the state of a \n&gt; resource, you&#39;ve pretty much discounted half of the Web itself.  I \n&gt; guarantee you 90% of Web applications out there that are accepting\n&gt; any kind of input are receiving that input via a Form and through an\n&gt; action URL.\n&gt; \n\nWho said links can&#39;t be such a mechanism?  Also, who said that 90% of\nWeb applications are RESTful?  Or that using HTML forms is unRESTful?\nWhy is your response to my magnanimous assistance, to put words in my\nmouth as a means of arguing against what I have to say instead of\ntrying to learn from it, or asking me to elaborate?  You&#39;re the noob,\nI&#39;m the guy who&#39;s been learning and applying REST for 11 years.  You\nmight consider the possibility that I actually know a good deal about\nwhat I&#39;m talking about. Folks might be more comfortable with REST-* if\nyou were to show an interest in accepting the help you&#39;ve been offered\nhere, instead of turning every issue into some semantic explanation of\nwhy your way is right.\n\nAnyway,\n\nIf I perform a GET against a URI, and receive a representation with a\nform allowing various parts of the resource to be changed, change some\ndata, and submit the form as a POST to the same URI, then I&#39;ve just\nmodified the state of a resource, driven by hypermedia, by transferring\na representation of the resource I received back to the server.  The\nsubmitted data may be sent either as an entity of some media-type, or\nas a query string of name-value pairs as &#39;application/x-www-form-\nurlencoded&#39;.  Perfectly RESTful, nothing wrong with query strings\ndespite what many people say.\n\nBut, if that POST contains no content and/or is directed at some other\nresource instead of the one I did a GET on, then it may well be\nhypermedia-driven, but it isn&#39;t REST, as REST has more constraints than\njust HEAS.\n\n-Eric\n\n"}}