{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":221173245,"authorName":"wahbedahbe","from":"&quot;wahbedahbe&quot; &lt;andrew.wahbe@...&gt;","profile":"wahbedahbe","replyTo":"SENDER","senderId":"KF75uaOAsL8CDJ0coXqWZWdZK0tWtIaXOWUOFb6kvcaKQZd2zat4Kz0LmUZ63aLFHsLef9eW4foXwdSiP5Q_DROgS1uSo1NT14R51w","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: about rel and HATEOAS (theoretical question)","postDate":"1263416957","msgId":14531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpbGNwdCt1MnJrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI5RUJCMUM4LTgyMDQtNDg2NC1CM0VELTVEOTNEMEE4OTNENUB3ZWJiZXIubmFtZT4="},"prevInTopic":14530,"nextInTopic":14532,"prevInTime":14530,"nextInTime":14532,"topicId":14499,"numMessagesInTopic":68,"msgSnippet":"... I keep coming back to this on this list from different angles -- so appologies if I sound redundant, but I always get the feeling that folks don t quite","rawEmail":"Return-Path: &lt;andrew.wahbe@...&gt;\r\nX-Sender: andrew.wahbe@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 98268 invoked from network); 13 Jan 2010 21:13:41 -0000\r\nX-Received: from unknown (66.196.94.105)\n  by m13.grp.re1.yahoo.com with QMQP; 13 Jan 2010 21:13:41 -0000\r\nX-Received: from unknown (HELO n46b.bullet.mail.sp1.yahoo.com) (66.163.168.160)\n  by mta1.grp.re1.yahoo.com with SMTP; 13 Jan 2010 21:13:41 -0000\r\nX-Received: from [69.147.65.174] by n46.bullet.mail.sp1.yahoo.com with NNFMP; 13 Jan 2010 21:09:17 -0000\r\nX-Received: from [98.137.35.12] by t12.bullet.mail.sp1.yahoo.com with NNFMP; 13 Jan 2010 21:09:17 -0000\r\nDate: Wed, 13 Jan 2010 21:09:17 -0000\r\nTo: rest-discuss@yahoogroups.com\r\nMessage-ID: &lt;hilcpt+u2rk@...&gt;\r\nIn-Reply-To: &lt;B9EBB1C8-8204-4864-B3ED-5D93D0A893D5@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;wahbedahbe&quot; &lt;andrew.wahbe@...&gt;\r\nSubject: Re: about rel and HATEOAS (theoretical question)\r\nX-Yahoo-Group-Post: member; u=221173245; y=sdA9_7zX7JMIkSohH7EikYNEAFoT-msRJTW62VujDd13g9v4WQ\r\nX-Yahoo-Profile: wahbedahbe\r\n\r\n--- In rest-discuss@yahoogroups.com, Jim Webber &lt;jim@...&gt; wrote:\n&gt;\n&gt; Hey Eb=\r\n,\n&gt; \n&gt; &gt; I like this point.  From a reach perspective, we should think more=\r\n of the\n&gt; &gt; other agents/intermediaries that would have no clue on how to h=\r\nandle this\n&gt; &gt; media type (if they needed too).  Regardless, the receiver (=\r\nin a lot of\n&gt; &gt; cases) will need to understand the extensions to an existin=\r\ng media type.\n&gt; \n&gt; If a client or intermediary doesn&#39;t understand a media t=\r\nype then all bets are off - the client or intermediary doesn&#39;t understand t=\r\nhe service&#39;s contract.\n&gt; \n&gt; Some clients know about lots of media types (e.=\r\ng. browsers) some clients know about few media types (e.g. Restbucks system=\r\ns). That&#39;s the essence of reach.\n&gt; \n&gt; Jim\n&gt;\n\nI keep coming back to this on =\r\nthis list from different angles -- so appologies if I sound redundant, but =\r\nI always get the feeling that folks don&#39;t quite get where I&#39;m coming from -=\r\n- I keep trying because I think this is an important point for understandin=\r\ng REST and this list contains the set of key individuals educating the broa=\r\nder development community. \n\nIs the media type a part of the service&#39;s cont=\r\nract or the client&#39;s?\n\nIt seems to me that a key distinction between REST a=\r\nnd RPC is that in RPC the service provides the contract while in REST, the =\r\nclient provides the contract (via the media type).\n\nA client, in the Accept=\r\n header, constrains the set of acceptable media types -- isn&#39;t this essenti=\r\nally run-time contract negotiation?\nThe server agrees to the contract at ru=\r\nn time by returning an appropriate representation of the requested resource=\r\n (or rejects the contract by returning &quot;Not Acceptable&quot;).\n\n*Typically*, ser=\r\nvices can easily extend their &quot;reach&quot; by supporting as many media types as =\r\nthey like while clients support a fixed set of media types. So in order to =\r\ngive a client reach, it is best to support media types that are able to be =\r\nused by a broad range of services.\n\nFor example, HTML can obviously be used=\r\n to express an incredible range of services. VoiceXML (used by automated ph=\r\none systems) can also be used to express a broad range of services. Support=\r\ning one of these media types would give a client a broad reach as it could =\r\ninteract with many services. But a service could address both HTML and Voic=\r\neXML clients via conneg (or simply two disjoint sets of URIs).\n\nIsn&#39;t this =\r\nthe root of the client-server decoupling provided by REST?\n\nIf so -- then t=\r\nhe question I keep coming back to is if a service that uses a &quot;service-spec=\r\nific&quot; media type is really an instance of REST. By service-specific, I don&#39;=\r\nt mean &quot;not standardized&quot; or vendor-specific -- this has nothing to do with=\r\n the nature of the media type itself, just whether or not it&#39;s been approve=\r\nd by a standards body. I mean that the media type represents a contract set=\r\n by the service because the media type is not designed to represent a set o=\r\nf services. This is because the semantics of the media type map exactly to =\r\nthe semantics of the service. You see this in most &quot;REST APIs&quot; that are sim=\r\nply serializing service data structures as JSON or XML.\n\nTo me a RESTful se=\r\nrvice &quot;translates&quot; it&#39;s own internal semantics into the media type(s) of th=\r\ne client(s) it is trying to address -- the specific translation used being =\r\nnegotiated at runtime. This, to me is the point of having a distinction bet=\r\nween resources and representations in REST. The translation doesn&#39;t just al=\r\nlow the service to &quot;reach&quot; a broader set of clients, but it also allows the=\r\n client to &quot;reach&quot; a broader set of services. This is because the represent=\r\nation format captures information using semantics that are specific to the =\r\nclient. By designing the client&#39;s format around the information processing =\r\ncapabilities of the client, the client can interact with as many services a=\r\ns possible.\n\nFor example, HTML represents information in terms of common st=\r\nructures of visually displayed, interactive text -- it&#39;s designed around vi=\r\nsual browsers. VoiceXML is designed around voice browsers. Yes, you can wri=\r\nte a spider to consume HTML (and VoiceXML). And yes, you can use a screen r=\r\neader to process HTML, but VoiceXML is a much more natural way to represent=\r\n information for speech-based consumption and interaction (it won a standar=\r\nds war with SALT -- a set of extensions to HTML for speech). So there are o=\r\nther ways to consume the information (something afforded by the Principle o=\r\nf Least Power), but that doesn&#39;t diminish the fact that the media type is d=\r\nesigned to cater to a specific flavor of client.\n\nSo when a media type is d=\r\nesigned around a service rather than a type of client, I question if the re=\r\nsult can be called REST. For example, a banking service that spits out a JS=\r\nON format that simply serializes the account and transaction data structure=\r\ns used internally to represent the service&#39;s resources. i.e. if you aren&#39;t =\r\ntargeting a specific &quot;type&quot; of client by translating to that client&#39;s media=\r\n type are you violating the constraints of REST? \n\nWhat specific constraint=\r\ns are being violated is a hard question and the reason I have a hard time e=\r\nxplaining this -- I would point to &quot;Self-descriptive messages&quot; and its requ=\r\nirement for standard media types but the meaning of &quot;standard&quot; in the conte=\r\nxt of REST is so hard to pin down. Or maybe this is just inherent in the di=\r\nstinction between representations and resources.\n\nOr maybe this isn&#39;t part =\r\nof REST&#39;s constraints at all... I don&#39;t know -- that&#39;s why I keep asking (b=\r\nut based on the answers I get, I don&#39;t think I ever get the question across=\r\n properly). Anyways, I&#39;m interested in all of your thoughts.\nRegards,\n\nAndr=\r\new\n\n\n\n"}}