{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":221173245,"authorName":"Andrew Wahbe","from":"Andrew Wahbe &lt;andrew.wahbe@...&gt;","profile":"wahbedahbe","replyTo":"SENDER","senderId":"mQfGUZlBSefO8HjF5fcTCnqzL8O3ZozatkfHcfftssmM-bUsZRubYOrvGfoafcdpLrUOR8rHkZ_xByvW5gRu8Z5m3LmOW1fZXRHvRA","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] Re: about rel and HATEOAS (theoretical question)","postDate":"1263483624","msgId":14549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIwZWJhZmQxMTAwMTE0MDc0MGoxZWYwNzk3ZnI4NmY3NmM5M2E2OWYwNzlhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDhiODY0OGFjMTAwMTE0MDIyOG40ZjE5YjU0YWdiNDE5OTg1NTQ5MDNkNTAzQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhpbGNwdCt1MnJrQGVHcm91cHMuY29tPgkgPEZBMThCNTUwLTdFNEUtNDZFMi04ODBDLTgwQ0ZDNzkxRDFFOUBtYWMuY29tPgkgPGIwZWJhZmQxMTAwMTEzMjAwNW40NTVjMTVlN3ljYjcwNGE4YzBjYWI3Nzg1QG1haWwuZ21haWwuY29tPgkgPDhiODY0OGFjMTAwMTE0MDIyOG40ZjE5YjU0YWdiNDE5OTg1NTQ5MDNkNTAzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":14548,"nextInTopic":14550,"prevInTime":14548,"nextInTime":14550,"topicId":14499,"numMessagesInTopic":68,"msgSnippet":"... Well let s limit our set of examples to systems widely agreed to be RESTful. It s certainly that way for HTML browsers. It is that way for pure AtomPub ","rawEmail":"Return-Path: &lt;andrew.wahbe@...&gt;\r\nX-Sender: andrew.wahbe@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 81097 invoked from network); 14 Jan 2010 15:40:26 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m2.grp.sp2.yahoo.com with QMQP; 14 Jan 2010 15:40:26 -0000\r\nX-Received: from unknown (HELO mail-bw0-f221.google.com) (209.85.218.221)\n  by mta1.grp.sp2.yahoo.com with SMTP; 14 Jan 2010 15:40:25 -0000\r\nX-Received: by bwz21 with SMTP id 21so15990321bwz.24\n        for &lt;rest-discuss@yahoogroups.com&gt;; Thu, 14 Jan 2010 07:40:24 -0800 (PST)\r\nMIME-Version: 1.0\r\nX-Received: by 10.204.157.27 with SMTP id z27mr526378bkw.206.1263483624506; Thu, \n\t14 Jan 2010 07:40:24 -0800 (PST)\r\nIn-Reply-To: &lt;8b8648ac1001140228n4f19b54agb41998554903d503@...&gt;\r\nReferences: &lt;hilcpt+u2rk@...&gt;\n\t &lt;FA18B550-7E4E-46E2-880C-80CFC791D1E9@...&gt;\n\t &lt;b0ebafd11001132005n455c15e7ycb704a8c0cab7785@...&gt;\n\t &lt;8b8648ac1001140228n4f19b54agb41998554903d503@...&gt;\r\nDate: Thu, 14 Jan 2010 10:40:24 -0500\r\nMessage-ID: &lt;b0ebafd11001140740j1ef0797fr86f76c93a69f079a@...&gt;\r\nTo: Eb &lt;amaeze@...&gt;\r\nCc: Jan Algermissen &lt;algermissen1971@...&gt;, rest-discuss@yahoogroups.com\r\nContent-Type: multipart/alternative; boundary=0015175d0a029e45f7047d21b4a3\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Andrew Wahbe &lt;andrew.wahbe@...&gt;\r\nSubject: Re: [rest-discuss] Re: about rel and HATEOAS (theoretical question)\r\nX-Yahoo-Group-Post: member; u=221173245; y=dbMZ0vDCjkISDzwFxfUhjGg4yCa-NlExfQdjy0Hx4kXEJHmMZA\r\nX-Yahoo-Profile: wahbedahbe\r\n\r\n\r\n--0015175d0a029e45f7047d21b4a3\r\nContent-Type: text/plain; charset=ISO-8859-1\r\n\r\nOn Thu, Jan 14, 2010 at 5:28 AM, Eb &lt;amaeze@...&gt; wrote:\n\n&gt; Hello Andrew -\n&gt;\n&gt;\n&gt; On Wed, Jan 13, 2010 at 11:05 PM, Andrew Wahbe &lt;andrew.wahbe@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;&gt; Sure, but you are basically saying that the media type forms the contract\n&gt;&gt; right? And I what I&#39;m trying to get at here is that the media type is the\n&gt;&gt; client&#39;s contract not the service&#39;s. In the customer support example above,\n&gt;&gt; both VoiceXML and HTML are mandated by the respective clients. The service\n&gt;&gt; is conforming to those media types in order to be able to interact with\n&gt;&gt; those clients. The client is not coupled to the service at all -- just the\n&gt;&gt; media type, URI and HTTP. The service has the freedom to support whatever\n&gt;&gt; representations it chooses -- it is not coupled to any one client&#39;s media\n&gt;&gt; type.\n&gt;&gt;\n&gt;\n&gt;\n&gt; While I think I agree with you (to an extent), this does suggest that\n&gt; clients are built in isolation which I do not believe is the case in\n&gt; practice.\n\n\nWell let&#39;s limit our set of examples to systems widely agreed to be RESTful.\nIt&#39;s certainly that way for HTML browsers. It is that way for &quot;pure&quot; AtomPub\nclients *designed for content publishing* (where the content is HTML or\nanother standard format and there are no service-specific extensions). It is\nalso that way for VoiceXML browsers (though I&#39;m not sure there is wide\nagreement that they are RESTful though I tend to think that that is because\nnot enough people know about them).\n\nThis isn&#39;t the case with many M2M clients and services -- there the service\nusually comes first or the client and service are built at the same time.\nBut here we also have folks like Roy and others routinely poking holes in\nthe services and declaring they aren&#39;t RESTful. And we also have folks\nreaching the conclusion that there must be some fundamental limitations of\nM2M services because they can&#39;t achieve the same client-server decoupling as\nwe see in the Web.\n\nI&#39;m proposing that there is no fundamental limitation in M2M services --\nsystem designers are just going about it the wrong way because they are\ndesigning their media types around the services instead of the clients. If\nthey instead started with a specific client in mind, and designed the media\ntype around the client they can achieve the same level of client-service\ndecoupling as in the HTML web. This isn&#39;t just my opinion -- I can point to\na (in progress) W3C XML format for M2M RESTful systems that is designed in\nthis way, and has many implementations shipping today from multiple vendors\nthat don&#39;t depend on any specific service. Anyone can design a service in\nthat format that can do anything expressible in the language. This is CCXML:\nhttp://www.w3.org/TR/ccxml/\n\nAs I&#39;ve said many times on this list -- you really ought to have a look at\nCCXML. It&#39;s not the best example of a RESTful markup language possible (e.g.\nlike HTML it only uses GET and POST, etc.) but there&#39;s a lot to be learned\nfrom it. And most importantly, it stands as a counter example to the\nassertion that M2M clients are fundamentally different from &quot;human driven&quot;\nclients when it comes to client-service decoupling....\n\nOr maybe I&#39;m way off base and just confused about this... Don&#39;t know -- I\nhaven&#39;t heard an argument to make me change my mind yet, but I&#39;d genuinely\nlike to hear it if it&#39;s out there.\n\n\n&gt;   Maybe the mistake is that we should look at what capabilities the client\n&gt; needs to have and then use (or create a new) a media type that sufficiently\n&gt; expresses those capabilities.  I see media type as the &quot;language spoken&quot;\n&gt; (excuse my poor expression) between a client and server and for anything\n&gt; meaningful to happen, they must both speak the same language.  From that\n&gt; perspective, a client is indirectly coupled (only) to services that speak\n&gt; its media type(s) and vice versa.\n&gt;\n\nAbsolutely, HTML (and VoiceXML) are designed around the client&#39;s needs and\ncapabilities -- not a service&#39;s. The web browser is &quot;coupled&quot; the entire set\nof services that are expressible in HTML -- that is a big set. It&#39;s not\ncoupled to any one service.\n\n\n&gt; Where this gets interesting is that it seems to me that for every standard\n&gt; media type that exists, clients (and servers) have been hard wired to\n&gt; understand the media type in the context that the media type was created\n&gt; for.  Browsers were written to understand HTML for a purpose.  Sure, I can\n&gt; use HTML (or XML or Atom) to represent anything I want but does that mean\n&gt; that just because my service and browser and client agree on text/html that\n&gt; my browser will be able to do anything meaningful with the representation if\n&gt; the semantics have nothing to do with display (for example)?  I don&#39;t think\n&gt; so.  This is why I would still have to document (out of band) the semantics\n&gt; contained in my representation even if I used a standard media type.  Now\n&gt; there are positives, such that the browser could possibly render aspects of\n&gt; the representation etc etc, but that&#39;s not the major point at the moment.\n&gt;\n&gt; Yup... if you are using a &quot;standard&quot; media type in a &quot;non-standard&quot; way\nthen you will forfeit interoperability. And this is where lots of folks are\ngoing wrong with Atom -- using it to do something other than publish and\nsyndicate content. Sure you can introduce extensions to extend what a media\ntype can do, but if those extensions are &quot;service-specific&quot; then you won&#39;t\nget general interoperability or client-service decoupling.\n\n\n&gt; As always, I would love to be corrected. :)\n&gt;\n&gt; Me too! ;-)\n\n\n&gt;\n&gt; Eb\n&gt;\n\nRegards,\n\nAndrew\n\r\n--0015175d0a029e45f7047d21b4a3\r\nContent-Type: text/html; charset=ISO-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Thu, Jan 14, 2010 at 5:28 AM, Eb &lt;span dir=3D=\r\n&quot;ltr&quot;&gt;&lt;&lt;a href=3D&quot;mailto:amaeze@...&quot;&gt;amaeze@...&lt;/a&gt;&gt;&lt;/spa=\r\nn&gt; wrote:&lt;br&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px so=\r\nlid rgb(204, 204, 204); margin: 0pt 0pt 0pt 0.8ex; padding-left: 1ex;&quot;&gt;\nHel=\r\nlo Andrew -&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;&lt;br&gt;&lt;div class=3D&quot;gmail_quote&quot;&gt;On Wed, Jan=\r\n 13, 2010 at 11:05 PM, Andrew Wahbe &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a href=3D&quot;mailto=\r\n:andrew.wahbe@...&quot; target=3D&quot;_blank&quot;&gt;andrew.wahbe@...&lt;/a&gt;&gt;&lt;/=\r\nspan&gt; wrote:&lt;br&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1p=\r\nx solid rgb(204, 204, 204); margin: 0pt 0pt 0pt 0.8ex; padding-left: 1ex;&quot;&gt;=\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;&lt;span&gt;&lt;=\r\n/span&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px solid rgb=\r\n(204, 204, 204);&quot;&gt;&lt;br&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;&lt;div class=3D&quot;gmail_quote=\r\n&quot;&gt;&lt;div&gt;Sure, but you are basically saying that the media type forms the con=\r\ntract right? And I what I&#39;m trying to get at here is that the media typ=\r\ne is the client&#39;s contract not the service&#39;s. In the customer suppo=\r\nrt example above, both VoiceXML and HTML are mandated by the respective cli=\r\nents. The service is conforming to those media types in order to be able to=\r\n interact with those clients. The client is not coupled to the service at a=\r\nll -- just the media type, URI and HTTP. The service has the freedom to sup=\r\nport whatever representations it chooses -- it is not coupled to any one cl=\r\nient&#39;s media type.&lt;br&gt;\n\n&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquot=\r\ne&gt;&lt;/div&gt;&lt;br&gt;&lt;br&gt;&lt;/div&gt;While I think I agree with you (to an extent), this d=\r\noes suggest that clients are built in isolation which I do not believe is t=\r\nhe case in practice.&lt;/blockquote&gt;\n&lt;div&gt;&lt;br&gt;Well let&#39;s limit our set of =\r\nexamples to systems widely agreed to be RESTful. It&#39;s certainly that wa=\r\ny for HTML browsers. It is that way for &quot;pure&quot; AtomPub clients *d=\r\nesigned for content publishing* (where the content is HTML or another stand=\r\nard format and there are no service-specific extensions). It is also that w=\r\nay for VoiceXML browsers (though I&#39;m not sure there is wide agreement t=\r\nhat they are RESTful though I tend to think that that is because not enough=\r\n people know about them).&lt;br&gt;\n&lt;br&gt;This isn&#39;t the case with many M2M cli=\r\nents and services -- there the service usually comes first or the client an=\r\nd service are built at the same time. But here we also have folks like Roy =\r\nand others routinely poking holes in the services and declaring they aren&#=\r\n39;t RESTful. And we also have folks reaching the conclusion that there mus=\r\nt be some fundamental limitations of M2M services because they can&#39;t ac=\r\nhieve the same client-server decoupling as we see in the Web.&lt;br&gt;\n&lt;br&gt;I&#39=\r\n;m proposing that there is no fundamental limitation in M2M services -- sys=\r\ntem designers are just going about it the wrong way because they are design=\r\ning their media types around the services instead of the clients. If they i=\r\nnstead started with a specific client in mind, and designed the media type =\r\naround the client they can achieve the same level of client-service decoupl=\r\ning as in the HTML web. This isn&#39;t just my opinion -- I can point to a =\r\n(in progress) W3C XML format for M2M RESTful systems that is designed in th=\r\nis way, and has many implementations shipping today from multiple vendors t=\r\nhat don&#39;t depend on any specific service. Anyone can design a service i=\r\nn that format that can do anything expressible in the language. This is CCX=\r\nML: &lt;a href=3D&quot;http://www.w3.org/TR/ccxml/&quot;&gt;http://www.w3.org/TR/ccxml/&lt;/a&gt;=\r\n&lt;br&gt;\n&lt;br&gt;As I&#39;ve said many times on this list -- you really ought to ha=\r\nve a look at CCXML. It&#39;s not the best example of a RESTful markup langu=\r\nage possible (e.g. like HTML it only uses GET and POST, etc.) but there&#39=\r\n;s a lot to be learned from it. And most importantly, it stands as a counte=\r\nr example to the assertion that M2M clients are fundamentally different fro=\r\nm &quot;human driven&quot; clients when it comes to client-service decoupli=\r\nng.... &lt;br&gt;\n&lt;br&gt;Or maybe I&#39;m way off base and just confused about this.=\r\n.. Don&#39;t know -- I haven&#39;t heard an argument to make me change my m=\r\nind yet, but I&#39;d genuinely like to hear it if it&#39;s out there.&lt;br&gt;=\r\n=A0&lt;br&gt;&lt;/div&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px s=\r\nolid rgb(204, 204, 204); margin: 0pt 0pt 0pt 0.8ex; padding-left: 1ex;&quot;&gt;=A0=\r\n Maybe the mistake is that we should look at what capabilities the client n=\r\needs to have and then use (or create a new) a media type that sufficiently =\r\nexpresses those capabilities.=A0 I see media type as the &quot;language spo=\r\nken&quot; (excuse my poor expression) between a client and server and for a=\r\nnything meaningful to happen, they must both speak the same language.=A0 Fr=\r\nom that perspective, a client is indirectly coupled (only) to services that=\r\n speak its media type(s) and vice versa.&lt;br&gt;\n&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;Absolute=\r\nly, HTML (and VoiceXML) are designed around the client&#39;s needs and capa=\r\nbilities -- not a service&#39;s. The web browser is &quot;coupled&quot; the=\r\n entire set of services that are expressible in HTML -- that is a big set. =\r\nIt&#39;s not coupled to any one service.&lt;br&gt;\n&lt;br&gt;&lt;/div&gt;&lt;blockquote class=3D=\r\n&quot;gmail_quote&quot; style=3D&quot;border-left: 1px solid rgb(204, 204, 204); margin: 0=\r\npt 0pt 0pt 0.8ex; padding-left: 1ex;&quot;&gt;\n&lt;br&gt;Where this gets interesting is t=\r\nhat it seems to me that for every standard media type that exists, clients =\r\n(and servers) have been hard wired to understand the media type in the cont=\r\next that the media type was created for.=A0 Browsers were written to unders=\r\ntand HTML for a purpose.=A0 Sure, I can use HTML (or XML or Atom) to repres=\r\nent anything I want but does that mean that just because my service and bro=\r\nwser and client agree on text/html that my browser will be able to do anyth=\r\ning meaningful with the representation if the semantics have nothing to do =\r\nwith display (for example)?=A0 I don&#39;t think so.=A0 This is why I would=\r\n still have to document (out of band) the semantics contained in my represe=\r\nntation even if I used a standard media type.=A0 Now there are positives, s=\r\nuch that the browser could possibly render aspects of the representation et=\r\nc etc, but that&#39;s not the major point at the moment.&lt;br&gt;\n\n&lt;br&gt;&lt;/blockqu=\r\note&gt;&lt;div&gt;Yup... if you are using a &quot;standard&quot; media type in a &qu=\r\not;non-standard&quot; way then you will forfeit interoperability. And this =\r\nis where lots of folks are going wrong with Atom -- using it to do somethin=\r\ng other than publish and syndicate content. Sure you can introduce extensio=\r\nns to extend what a media type can do, but if those extensions are &quot;se=\r\nrvice-specific&quot; then you won&#39;t get general interoperability or cli=\r\nent-service decoupling.&lt;br&gt;\n&lt;br&gt;&lt;/div&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; sty=\r\nle=3D&quot;border-left: 1px solid rgb(204, 204, 204); margin: 0pt 0pt 0pt 0.8ex;=\r\n padding-left: 1ex;&quot;&gt;&lt;br&gt;As always, I would love to be corrected. :)&lt;br&gt;&lt;fo=\r\nnt color=3D&quot;#888888&quot;&gt;&lt;br&gt;&lt;/font&gt;&lt;/blockquote&gt;\n&lt;div&gt;Me too! ;-)&lt;br&gt;=A0&lt;br&gt;&lt;/=\r\ndiv&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px solid rgb(2=\r\n04, 204, 204); margin: 0pt 0pt 0pt 0.8ex; padding-left: 1ex;&quot;&gt;&lt;font color=\r\n=3D&quot;#888888&quot;&gt;&lt;br&gt;Eb&lt;br&gt;\n&lt;/font&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;Regards,&lt;br&gt;=A0&lt;br&gt;An=\r\ndrew&lt;br&gt;\n\r\n--0015175d0a029e45f7047d21b4a3--\r\n\n"}}