{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":124198377,"authorName":"William Martinez Pomares","from":"&quot;William Martinez Pomares&quot; &lt;wmartinez@...&gt;","profile":"willmarpo","replyTo":"SENDER","senderId":"EnDSoEeuQpWiNQlBf07rZXIjV4x8rqefIw6zJ0jtOcnbQROaIAWFH9MG2UD4vQ6QC2DUkUfpZOgzC-0IpcqYiGx6NfiAbrzg9X5NWfhck4YXr5UuQWMF85vV","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What do you think about REST being a synonym of Service creation technique?","postDate":"1270566111","msgId":15139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwZmljditpanM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhwZmI0dCs2bXRiQGVHcm91cHMuY29tPg=="},"prevInTopic":15138,"nextInTopic":15143,"prevInTime":15138,"nextInTime":15140,"topicId":15092,"numMessagesInTopic":18,"msgSnippet":"Quick Fe de Erratas. Whenever you see Components mentioned about architecture styles, please correctly read Elements . Yep, they are different","rawEmail":"Return-Path: &lt;wmartinez@...&gt;\r\nX-Sender: wmartinez@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 1808 invoked from network); 6 Apr 2010 15:01:53 -0000\r\nX-Received: from unknown (66.196.94.105)\n  by m4.grp.sp2.yahoo.com with QMQP; 6 Apr 2010 15:01:53 -0000\r\nX-Received: from unknown (HELO n43d.bullet.mail.sp1.yahoo.com) (66.163.169.157)\n  by mta1.grp.re1.yahoo.com with SMTP; 6 Apr 2010 15:01:53 -0000\r\nX-Received: from [69.147.65.173] by n43.bullet.mail.sp1.yahoo.com with NNFMP; 06 Apr 2010 15:01:52 -0000\r\nX-Received: from [98.137.34.36] by t15.bullet.mail.sp1.yahoo.com with NNFMP; 06 Apr 2010 15:01:52 -0000\r\nDate: Tue, 06 Apr 2010 15:01:51 -0000\r\nTo: rest-discuss@yahoogroups.com\r\nMessage-ID: &lt;hpficv+ijs5@...&gt;\r\nIn-Reply-To: &lt;hpfb4t+6mtb@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nFrom: &quot;William Martinez Pomares&quot; &lt;wmartinez@...&gt;\r\nSubject: Re: What do you think about REST being a synonym of Service creation technique?\r\nX-Yahoo-Group-Post: member; u=124198377; y=5_a7dk9koFNW8P0D5CZuaJ-uT2FxCMKHE_fknXRHO2K55dN2\r\nX-Yahoo-Profile: willmarpo\r\n\r\nQuick Fe de Erratas.\nWhenever you see &quot;Components&quot; mentioned about architec=\r\nture styles, please correctly read &quot;Elements&quot;. Yep, they are different thin=\r\ngs/concepts, and being as found of concepts as I am, you bet I read back th=\r\ne message in horror.\n\nSorry about that one.\n\nWilliam Martinez Pomares. \n\n--=\r\n- In rest-discuss@yahoogroups.com, &quot;William Martinez Pomares&quot; &lt;wmartinez@..=\r\n.&gt; wrote:\n&gt;\n&gt; Great input, Stefan!\n&gt; Actually, Bryan used similar words to =\r\nexplain to me what SOA was for him. He said:&quot;my take: REST and WS-* are the=\r\n main choices for an SOA, so REST news is under SOA (where SOA !=3D WS-*, b=\r\nut holistic arch choice)&quot;. \n&gt; That is interesting, since it is the first ti=\r\nme I see it that way.\n&gt; \n&gt; Sorry, I&#39;m more academic than practical, still b=\r\neing pragmatic. That means I do differentiate both concepts based on the co=\r\nncepts rather that just how things are done in a de facto way.\n&gt; \n&gt; Since m=\r\ny evil part is on, please excuse me if the following analysis sounds like b=\r\nreaking your logic. (It is clearly trying to do so but for academic purpose=\r\ns.)\n&gt; \n&gt; Any reader can jump to the summary part, if not compelled to read =\r\nmuch blah, blah :D\n&gt; \n&gt; Ok. First the style concept. At any time, when buil=\r\nding system, you have the architecture (the real thing, the instance) of th=\r\ne work already done (meaning, the first line of code starts creating an arc=\r\nhitecture). You can also have your architecture design, which is the archit=\r\necture-to-be, which many Agile people confuse with the architecture itself.=\r\n And you can have a style, which is the set of architectural element types,=\r\n relations and principles that, if you follow them, will give some benefits=\r\n after some trade of. You can even have several styles, applied together to=\r\n form a bigger one.\n&gt; \n&gt; So, from your take, there is also the &quot;high-level =\r\napproach to an organization&#39;s IT holistically&quot;, which, if I understand corr=\r\nectly, is the actual &quot;way of doing things&quot; for the complete IT department. =\r\nThat means all individual systems should be created and integrated that way=\r\n, following those rule and generic goals. That is of course not the archite=\r\ncture of one system, but the organization of all systems as a whole. A syst=\r\nem of systems? At the end all that is an organizations of elements and inte=\r\nractions, where an element can be a complete system by itself. To me that f=\r\nits the architecture definition, just in a higher level. And as such, we ca=\r\nn talk about an underlying style. See, no difference to me if I tweak a lit=\r\ntle bit.\n&gt; \n&gt; The other part is also interesting. REST is indeed an archite=\r\nctural style that may be a great fit for some &quot;way of doing things&quot;, but no=\r\nt for all. It is specific to a particular type of system, with particular n=\r\needs in transfer, with a particular workflow technique.\n&gt; From your take, t=\r\nhat style is the best to achieve the &quot;way of doing things&quot;. Good. From mine=\r\n, that is a style used to implement another style. Humm.\n&gt; \n&gt; Finally, the =\r\nconcept of SOA as a WS-* style. You are right about how other people see it=\r\n. Let me tell you how do I see it to be clear. SOA is an architectural styl=\r\ne that uses a component called Service, which behaves like a business servi=\r\nce metaphor. There are other components as well, and interactions defined (=\r\nusing documents as data elements and messaging as a transport). The idea of=\r\n this style is to get the architecture as close to business as it can.\n&gt; \n&gt;=\r\n Now, we have the Web Services Architecture, WSA, and that is an standard, =\r\nand that is not SOA. The WSA has also components based on services that liv=\r\ne in the web (that restriction is very important!). It defines some standar=\r\nds like the WSDL and SOAP (worst choice ever!), with a resource view and al=\r\nl. \n&gt; \n&gt; Now, I know that in practice, a service in WSA is not more that a =\r\ndecorated RPC, that people believes SOA is WS-*, that people like &quot;REST&quot; be=\r\ncause they can use URLS and HTTP to create services (many times just RPC) w=\r\nithout SOAP. This is what this kind of discussions tries to clarify.\n&gt; \n&gt; S=\r\no, there is a difference, SOA is a style with architectural elements and in=\r\nteractions based on business and the service metaphor, with underlying mess=\r\naging transport and documents as data elements, while REST is a mashup of s=\r\ntyles based on the resource concept as data element, optimized for large hy=\r\npermedia transfers on top of a networked system, with an state machine base=\r\nd workflow. Humm.\n&gt; \n&gt; In Summary: \n&gt; Your take is SOA is not an architectu=\r\nral style but a &quot;high-level approach to an organization&#39;s IT holistically&quot; =\r\n(&quot;way of doing things&quot;) for the whole IT department, and that the best styl=\r\ne to do that is REST. From that, I take that either: SOA is service oriente=\r\nd and thus REST is then a style base on services or to create services, or =\r\nSOA is not Service related anymore, and REST is the underlying concept.\n&gt; \n=\r\n&gt; My gut feeling is the first one is the one people accept the most. I&#39;ve b=\r\neen asking around, outside this forum, and you see that REST is a synonym o=\r\nf service to many. \n&gt; \n&gt; Yep. I am complicated, I know. But it is interesti=\r\nng to compare how people see from outside and from inside. Your take at Inf=\r\noQ is very interesting, but from my outsider point of view you were just pu=\r\nblishing REST under SOA because REST is to create services. That is why I a=\r\nsked, and now I see I was wrong. Still, there are many out there with the s=\r\name point of view of mine.\n&gt; \n&gt; Next question would be: Should we change th=\r\nat perception? If no one writes about SOA anymore, but only about REST, sho=\r\nuld we think about renaming SOA channel to REST channel? Is REST community =\r\ninterested in keeping this view of REST under SOA?\n&gt; \n&gt; Cheers!\n&gt; \n&gt; Willia=\r\nm Martinez.  \n&gt; \n&gt; --- In rest-discuss@yahoogroups.com, Stefan Tilkov &lt;stef=\r\nan.tilkov@&gt; wrote:\n&gt; &gt;\n&gt; &gt; On Apr 2, 2010, at 1:08 AM, William Martinez Pom=\r\nares wrote:\n&gt; &gt; \n&gt; &gt; &gt; The question is still the same. REST discussions are=\r\n held in the SOA arena, as if REST is a SOA sub product. If SOA is dead, is=\r\n then REST dead the same? Does REST lives only in the SOA realm? Is REST ju=\r\nst a web services alternative? Is Services the only topic we can talk about=\r\n in REST?\n&gt; &gt; &gt; \n&gt; &gt; &gt; I wonder.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; As you can define SOA to mea=\r\nn whatever suits your purposes, it all depends. I happened to be InfoQ&#39;s SO=\r\nA lead editor for a long time, and I personally define SOA to be a high-lev=\r\nel approach to an organization&#39;s IT holistically, not as an architectural s=\r\ntyle. I&#39;ve personally found REST to be the most compelling architectural st=\r\nyle, and RESTful HTTP as the most useful technology stack, to achieve those=\r\n high-level goals (much more so than SOAP/WSDL/WS-* and whatever you&#39;d like=\r\n to call the architectural style it embodies, if you happen to believe that=\r\n it actually does so). Only if you define SOA (as I believe Roy and many ot=\r\nher REST folks do) as the unnamed architectural style underlying WSDL, SOAP=\r\n & Co., this seems a conflict.\n&gt; &gt; \n&gt; &gt; One of the more interesting experie=\r\nnces I had at InfoQ (I&#39;m no longer the lead editor and only loosely associa=\r\nted) was that it got harder and harder to find anyone willing to write a us=\r\neful technical article that was not REST-related. Of course this may have b=\r\neen selection bias, but I really tried =85 but at some point 90% of the peo=\r\nple I respected from the WS-* side of things had become RESTafarians.\n&gt; &gt; \n=\r\n&gt; &gt; Best,\n&gt; &gt; Stefan\n&gt; &gt;\n&gt;\n\n\n\n"}}