{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":145532415,"authorName":"Stefan Tilkov","from":"Stefan Tilkov &lt;stefan.tilkov@...&gt;","profile":"stilkov","replyTo":"SENDER","senderId":"Xk5mbUSEis7GokUCf3SHPzb_O2eKhh29FaPv-n7h2co_q68Jwm9zQJdteJ4rXaTghLkfpKDpdxNnVW1T0InKIbajbBbJxMim_RUQhgOB","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Re: What do you think about REST being a synonym of Service creation technique?","postDate":"1270585294","msgId":15145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0RUQ5NUY3LUNBODQtNEFFMy04MzE1LUQyRUMzQjI4RDdFRUBpbm5vcS5jb20+","inReplyToHeader":"PGhwZmI0dCs2bXRiQGVHcm91cHMuY29tPg==","referencesHeader":"PGhwZmI0dCs2bXRiQGVHcm91cHMuY29tPg=="},"prevInTopic":15144,"nextInTopic":15149,"prevInTime":15144,"nextInTime":15146,"topicId":15092,"numMessagesInTopic":18,"msgSnippet":"Hi William, Frankly, I m not interested in discussing what SOA is or is not, as there s nobody who can decide who s right. It suits my purpose to define SOA as","rawEmail":"Return-Path: &lt;stefan.tilkov@...&gt;\r\nX-Sender: stefan.tilkov@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 63825 invoked from network); 6 Apr 2010 20:21:39 -0000\r\nX-Received: from unknown (66.196.94.107)\n  by m1.grp.sp2.yahoo.com with QMQP; 6 Apr 2010 20:21:39 -0000\r\nX-Received: from unknown (HELO mail.innoq.com) (87.106.55.185)\n  by mta3.grp.re1.yahoo.com with SMTP; 6 Apr 2010 20:21:38 -0000\r\nX-Received: from [192.168.178.29] (ip-109-91-48-98.unitymediagroup.de [109.91.48.98])\n\t(using TLSv1 with cipher AES128-SHA (128/128 bits))\n\t(No client certificate requested)\n\tby mail.innoq.com (Postfix) with ESMTPSA id 916351A32FB;\n\tTue,  6 Apr 2010 22:21:35 +0200 (CEST)\r\nMime-Version: 1.0 (Apple Message framework v1077)\r\nContent-Type: multipart/alternative; boundary=Apple-Mail-128-220318163\r\nIn-Reply-To: &lt;hpfb4t+6mtb@...&gt;\r\nDate: Tue, 6 Apr 2010 22:21:34 +0200\r\nCc: rest-discuss@yahoogroups.com\r\nMessage-Id: &lt;A4ED95F7-CA84-4AE3-8315-D2EC3B28D7EE@...&gt;\r\nReferences: &lt;hpfb4t+6mtb@...&gt;\r\nTo: William Martinez Pomares &lt;wmartinez@...&gt;\r\nX-Mailer: Apple Mail (2.1077)\r\nFrom: Stefan Tilkov &lt;stefan.tilkov@...&gt;\r\nSubject: Re: [rest-discuss] Re: What do you think about REST being a synonym of Service creation technique?\r\nX-Yahoo-Group-Post: member; u=145532415; y=hGVczhlLqukIUo71-cqPFAnOQPefSwqLXndXt4u8k74_gA\r\nX-Yahoo-Profile: stilkov\r\n\r\n\r\n--Apple-Mail-128-220318163\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=windows-1252\r\n\r\nHi William,\n\nFrankly, I&#39;m not interested in discussing what SOA is or is no=\r\nt, as there&#39;s nobody who can decide who&#39;s right. It suits my purpose to def=\r\nine SOA as something that&#39;s high-level enough (or vague enough, if you pref=\r\ner); the reason is that I see many people who want something from SOA (easy=\r\n interoperability, loose coupling, wide support in different platforms, =85=\r\n) that they can achieve more easily with RESTful HTTP than with SOAP/WSDL/W=\r\nS-*. I can give them REST and they can still have their SOA cake.\n\nRelated =\r\nto that, I define &quot;service&quot; more as a mini-application than as an individua=\r\nl interface. When implemented using RESTful HTTP, it becomes a set of relat=\r\ned resources (more commonly called a Web app) instead of a Web service (a s=\r\net of WSDL-described individual SOAP interfaces).\n\nIf you define SOA differ=\r\nently, this logic is flawed. Which is OK.\n\nBest,\nStefan\n\nOn Apr 6, 2010, at=\r\n 2:58 PM, William Martinez Pomares wrote:\n\n&gt; Great input, Stefan!\n&gt; Actuall=\r\ny, Bryan used similar words to explain to me what SOA was for him. He said:=\r\n&quot;my take: REST and WS-* are the main choices for an SOA, so REST news is un=\r\nder SOA (where SOA !=3D WS-*, but holistic arch choice)&quot;. \n&gt; That is intere=\r\nsting, since it is the first time I see it that way.\n&gt; \n&gt; Sorry, I&#39;m more a=\r\ncademic than practical, still being pragmatic. That means I do differentiat=\r\ne both concepts based on the concepts rather that just how things are done =\r\nin a de facto way.\n&gt; \n&gt; Since my evil part is on, please excuse me if the f=\r\nollowing analysis sounds like breaking your logic. (It is clearly trying to=\r\n do so but for academic purposes.)\n&gt; \n&gt; Any reader can jump to the summary =\r\npart, if not compelled to read much blah, blah :D\n&gt; \n&gt; Ok. First the style =\r\nconcept. At any time, when building system, you have the architecture (the =\r\nreal thing, the instance) of the work already done (meaning, the first line=\r\n of code starts creating an architecture). You can also have your architect=\r\nure design, which is the architecture-to-be, which many Agile people confus=\r\ne with the architecture itself. And you can have a style, which is the set =\r\nof architectural element types, relations and principles that, if you follo=\r\nw them, will give some benefits after some trade of. You can even have seve=\r\nral styles, applied together to form a bigger one.\n&gt; \n&gt; So, from your take,=\r\n there is also the &quot;high-level approach to an organization&#39;s IT holisticall=\r\ny&quot;, which, if I understand correctly, is the actual &quot;way of doing things&quot; f=\r\nor the complete IT department. That means all individual systems should be =\r\ncreated and integrated that way, following those rule and generic goals. Th=\r\nat is of course not the architecture of one system, but the organization of=\r\n all systems as a whole. A system of systems? At the end all that is an org=\r\nanizations of elements and interactions, where an element can be a complete=\r\n system by itself. To me that fits the architecture definition, just in a h=\r\nigher level. And as such, we can talk about an underlying style. See, no di=\r\nfference to me if I tweak a little bit.\n&gt; \n&gt; The other part is also interes=\r\nting. REST is indeed an architectural style that may be a great fit for som=\r\ne &quot;way of doing things&quot;, but not for all. It is specific to a particular ty=\r\npe of system, with particular needs in transfer, with a particular workflow=\r\n technique.\n&gt; From your take, that style is the best to achieve the &quot;way of=\r\n doing things&quot;. Good. From mine, that is a style used to implement another =\r\nstyle. Humm.\n&gt; \n&gt; Finally, the concept of SOA as a WS-* style. You are righ=\r\nt about how other people see it. Let me tell you how do I see it to be clea=\r\nr. SOA is an architectural style that uses a component called Service, whic=\r\nh behaves like a business service metaphor. There are other components as w=\r\nell, and interactions defined (using documents as data elements and messagi=\r\nng as a transport). The idea of this style is to get the architecture as cl=\r\nose to business as it can.\n&gt; \n&gt; Now, we have the Web Services Architecture,=\r\n WSA, and that is an standard, and that is not SOA. The WSA has also compon=\r\nents based on services that live in the web (that restriction is very impor=\r\ntant!). It defines some standards like the WSDL and SOAP (worst choice ever=\r\n!), with a resource view and all. \n&gt; \n&gt; Now, I know that in practice, a ser=\r\nvice in WSA is not more that a decorated RPC, that people believes SOA is W=\r\nS-*, that people like &quot;REST&quot; because they can use URLS and HTTP to create s=\r\nervices (many times just RPC) without SOAP. This is what this kind of discu=\r\nssions tries to clarify.\n&gt; \n&gt; So, there is a difference, SOA is a style wit=\r\nh architectural elements and interactions based on business and the service=\r\n metaphor, with underlying messaging transport and documents as data elemen=\r\nts, while REST is a mashup of styles based on the resource concept as data =\r\nelement, optimized for large hypermedia transfers on top of a networked sys=\r\ntem, with an state machine based workflow. Humm.\n&gt; \n&gt; In Summary: \n&gt; Your t=\r\nake is SOA is not an architectural style but a &quot;high-level approach to an o=\r\nrganization&#39;s IT holistically&quot; (&quot;way of doing things&quot;) for the whole IT dep=\r\nartment, and that the best style to do that is REST. From that, I take that=\r\n either: SOA is service oriented and thus REST is then a style base on serv=\r\nices or to create services, or SOA is not Service related anymore, and REST=\r\n is the underlying concept.\n&gt; \n&gt; My gut feeling is the first one is the one=\r\n people accept the most. I&#39;ve been asking around, outside this forum, and y=\r\nou see that REST is a synonym of service to many. \n&gt; \n&gt; Yep. I am complicat=\r\ned, I know. But it is interesting to compare how people see from outside an=\r\nd from inside. Your take at InfoQ is very interesting, but from my outsider=\r\n point of view you were just publishing REST under SOA because REST is to c=\r\nreate services. That is why I asked, and now I see I was wrong. Still, ther=\r\ne are many out there with the same point of view of mine.\n&gt; \n&gt; Next questio=\r\nn would be: Should we change that perception? If no one writes about SOA an=\r\nymore, but only about REST, should we think about renaming SOA channel to R=\r\nEST channel? Is REST community interested in keeping this view of REST unde=\r\nr SOA?\n&gt; \n&gt; Cheers!\n&gt; \n&gt; William Martinez. \n&gt; \n&gt; --- In rest-discuss@yahoog=\r\nroups.com, Stefan Tilkov &lt;stefan.tilkov@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; On Apr 2, 2010,=\r\n at 1:08 AM, William Martinez Pomares wrote:\n&gt; &gt; \n&gt; &gt; &gt; The question is sti=\r\nll the same. REST discussions are held in the SOA arena, as if REST is a SO=\r\nA sub product. If SOA is dead, is then REST dead the same? Does REST lives =\r\nonly in the SOA realm? Is REST just a web services alternative? Is Services=\r\n the only topic we can talk about in REST?\n&gt; &gt; &gt; \n&gt; &gt; &gt; I wonder.\n&gt; &gt; \n&gt; &gt; =\r\n\n&gt; &gt; As you can define SOA to mean whatever suits your purposes, it all dep=\r\nends. I happened to be InfoQ&#39;s SOA lead editor for a long time, and I perso=\r\nnally define SOA to be a high-level approach to an organization&#39;s IT holist=\r\nically, not as an architectural style. I&#39;ve personally found REST to be the=\r\n most compelling architectural style, and RESTful HTTP as the most useful t=\r\nechnology stack, to achieve those high-level goals (much more so than SOAP/=\r\nWSDL/WS-* and whatever you&#39;d like to call the architectural style it embodi=\r\nes, if you happen to believe that it actually does so). Only if you define =\r\nSOA (as I believe Roy and many other REST folks do) as the unnamed architec=\r\ntural style underlying WSDL, SOAP & Co., this seems a conflict.\n&gt; &gt; \n&gt; &gt; On=\r\ne of the more interesting experiences I had at InfoQ (I&#39;m no longer the lea=\r\nd editor and only loosely associated) was that it got harder and harder to =\r\nfind anyone willing to write a useful technical article that was not REST-r=\r\nelated. Of course this may have been selection bias, but I really tried =85=\r\n but at some point 90% of the people I respected from the WS-* side of thin=\r\ngs had become RESTafarians.\n&gt; &gt; \n&gt; &gt; Best,\n&gt; &gt; Stefan\n&gt; &gt;\n&gt; \n&gt; \n\n\r\n--Apple-Mail-128-220318163\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=windows-1252\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode:=\r\n space; -webkit-line-break: after-white-space; &quot;&gt;Hi William,&lt;div&gt;&lt;br&gt;&lt;/div&gt;=\r\n&lt;div&gt;Frankly, I&#39;m not interested in discussing what SOA is or is not, as th=\r\nere&#39;s nobody who can decide who&#39;s right. It suits my purpose to define SOA =\r\nas something that&#39;s high-level enough (or vague enough, if you prefer); the=\r\n reason is that I see many people who want something from SOA (easy interop=\r\nerability, loose coupling, wide support in different platforms, =85) that t=\r\nhey can achieve more easily with RESTful HTTP than with SOAP/WSDL/WS-*. I c=\r\nan give them REST and they can still have their SOA cake.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/d=\r\niv&gt;&lt;div&gt;Related to that, I define &quot;service&quot; more as a mini-application than=\r\n as an individual interface. When implemented using RESTful HTTP, it become=\r\ns a set of related resources (more commonly called a Web app) instead of a =\r\nWeb service (a set of WSDL-described individual SOAP interfaces).&lt;/div&gt;&lt;div=\r\n&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;If you define SOA differently, this logic is flawed. Which =\r\nis OK.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Best,&lt;/div&gt;&lt;div&gt;Stefan&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;div&gt;&lt;=\r\ndiv&gt;On Apr 6, 2010, at 2:58 PM, William Martinez Pomares wrote:&lt;/div&gt;&lt;br cl=\r\nass=3D&quot;Apple-interchange-newline&quot;&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;\n\n\n\n&lt;div style=\r\n=3D&quot;background-color: #fff;&quot;&gt;\n&lt;span style=3D&quot;display:none&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n=\r\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;Great input, Stefan!&lt;br&gt;\nActually, Bryan used=\r\n similar words to explain to me what SOA was for him. He said:&quot;my take: RES=\r\nT and WS-* are the main choices for an SOA, so REST news is under SOA (wher=\r\ne SOA !=3D WS-*, but holistic arch choice)&quot;. &lt;br&gt;\nThat is interesting, sinc=\r\ne it is the first time I see it that way.&lt;br&gt;\n&lt;br&gt;\nSorry, I&#39;m more academic=\r\n than practical, still being pragmatic. That means I do differentiate both =\r\nconcepts based on the concepts rather that just how things are done in a de=\r\n facto way.&lt;br&gt;\n&lt;br&gt;\nSince my evil part is on, please excuse me if the foll=\r\nowing analysis sounds like breaking your logic. (It is clearly trying to do=\r\n so but for academic purposes.)&lt;br&gt;\n&lt;br&gt;\nAny reader can jump to the summary=\r\n part, if not compelled to read much blah, blah :D&lt;br&gt;\n&lt;br&gt;\nOk. First the s=\r\ntyle concept. At any time, when building system, you have the architecture =\r\n(the real thing, the instance) of the work already done (meaning, the first=\r\n line of code starts creating an architecture)&lt;wbr&gt;. You can also have your=\r\n architecture design, which is the architecture-&lt;wbr&gt;to-be, which many Agil=\r\ne people confuse with the architecture itself. And you can have a style, wh=\r\nich is the set of architectural element types, relations and principles tha=\r\nt, if you follow them, will give some benefits after some trade of. You can=\r\n even have several styles, applied together to form a bigger one.&lt;br&gt;\n&lt;br&gt;\n=\r\nSo, from your take, there is also the &quot;high-level approach to an organizati=\r\non&#39;&lt;wbr&gt;s IT holistically&quot;&lt;wbr&gt;, which, if I understand correctly, is the a=\r\nctual &quot;way of doing things&quot; for the complete IT department. That means all =\r\nindividual systems should be created and integrated that way, following tho=\r\nse rule and generic goals. That is of course not the architecture of one sy=\r\nstem, but the organization of all systems as a whole. A system of systems? =\r\nAt the end all that is an organizations of elements and interactions, where=\r\n an element can be a complete system by itself. To me that fits the archite=\r\ncture definition, just in a higher level. And as such, we can talk about an=\r\n underlying style. See, no difference to me if I tweak a little bit.&lt;br&gt;\n&lt;b=\r\nr&gt;\nThe other part is also interesting. REST is indeed an architectural styl=\r\ne that may be a great fit for some &quot;way of doing things&quot;, but not for all. =\r\nIt is specific to a particular type of system, with particular needs in tra=\r\nnsfer, with a particular workflow technique.&lt;br&gt;\nFrom your take, that style=\r\n is the best to achieve the &quot;way of doing things&quot;. Good. From mine, that is=\r\n a style used to implement another style. Humm.&lt;br&gt;\n&lt;br&gt;\nFinally, the conce=\r\npt of SOA as a WS-* style. You are right about how other people see it. Let=\r\n me tell you how do I see it to be clear. SOA is an architectural style tha=\r\nt uses a component called Service, which behaves like a business service me=\r\ntaphor. There are other components as well, and interactions defined (using=\r\n documents as data elements and messaging as a transport). The idea of this=\r\n style is to get the architecture as close to business as it can.&lt;br&gt;\n&lt;br&gt;\n=\r\nNow, we have the Web Services Architecture, WSA, and that is an standard, a=\r\nnd that is not SOA. The WSA has also components based on services that live=\r\n in the web (that restriction is very important!). It defines some standard=\r\ns like the WSDL and SOAP (worst choice ever!), with a resource view and all=\r\n. &lt;br&gt;\n&lt;br&gt;\nNow, I know that in practice, a service in WSA is not more that=\r\n a decorated RPC, that people believes SOA is WS-*, that people like &quot;REST&quot;=\r\n because they can use URLS and HTTP to create services (many times just RPC=\r\n) without SOAP. This is what this kind of discussions tries to clarify.&lt;br&gt;=\r\n\n&lt;br&gt;\nSo, there is a difference, SOA is a style with architectural elements=\r\n and interactions based on business and the service metaphor, with underlyi=\r\nng messaging transport and documents as data elements, while REST is a mash=\r\nup of styles based on the resource concept as data element, optimized for l=\r\narge hypermedia transfers on top of a networked system, with an state machi=\r\nne based workflow. Humm.&lt;br&gt;\n&lt;br&gt;\nIn Summary: &lt;br&gt;\nYour take is SOA is not =\r\nan architectural style but a &quot;high-level approach to an organization&#39;&lt;wbr&gt;s=\r\n IT holistically&quot; (&quot;way of doing things&quot;) for the whole IT department, and =\r\nthat the best style to do that is REST. From that, I take that either: SOA =\r\nis service oriented and thus REST is then a style base on services or to cr=\r\neate services, or SOA is not Service related anymore, and REST is the under=\r\nlying concept.&lt;br&gt;\n&lt;br&gt;\nMy gut feeling is the first one is the one people a=\r\nccept the most. I&#39;ve been asking around, outside this forum, and you see th=\r\nat REST is a synonym of service to many. &lt;br&gt;\n&lt;br&gt;\nYep. I am complicated, I=\r\n know. But it is interesting to compare how people see from outside and fro=\r\nm inside. Your take at InfoQ is very interesting, but from my outsider poin=\r\nt of view you were just publishing REST under SOA because REST is to create=\r\n services. That is why I asked, and now I see I was wrong. Still, there are=\r\n many out there with the same point of view of mine.&lt;br&gt;\n&lt;br&gt;\nNext question=\r\n would be: Should we change that perception? If no one writes about SOA any=\r\nmore, but only about REST, should we think about renaming SOA channel to RE=\r\nST channel? Is REST community interested in keeping this view of REST under=\r\n SOA?&lt;br&gt;\n&lt;br&gt;\nCheers!&lt;br&gt;\n&lt;br&gt;\nWilliam Martinez.  &lt;br&gt;\n&lt;br&gt;\n--- In &lt;a href=\r\n=3D&quot;mailto:rest-discuss%40yahoogroups.com&quot;&gt;rest-discuss@&lt;wbr&gt;yahoogroups.&lt;w=\r\nbr&gt;com&lt;/a&gt;, Stefan Tilkov &lt;stefan.tilkov@&lt;wbr&gt;...&gt; wrote:&lt;br&gt;\n&gt;&lt;br=\r\n&gt;\n&gt; On Apr 2, 2010, at 1:08 AM, William Martinez Pomares wrote:&lt;br&gt;\n&gt;=\r\n &lt;br&gt;\n&gt; &gt; The question is still the same. REST discussions are held i=\r\nn the SOA arena, as if REST is a SOA sub product. If SOA is dead, is then R=\r\nEST dead the same? Does REST lives only in the SOA realm? Is REST just a we=\r\nb services alternative? Is Services the only topic we can talk about in RES=\r\nT?&lt;br&gt;\n&gt; &gt; &lt;br&gt;\n&gt; &gt; I wonder.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; As y=\r\nou can define SOA to mean whatever suits your purposes, it all depends. I h=\r\nappened to be InfoQ&#39;s SOA lead editor for a long time, and I personally def=\r\nine SOA to be a high-level approach to an organization&#39;&lt;wbr&gt;s IT holistical=\r\nly, not as an architectural style. I&#39;ve personally found REST to be the mos=\r\nt compelling architectural style, and RESTful HTTP as the most useful techn=\r\nology stack, to achieve those high-level goals (much more so than SOAP/WSDL=\r\n/WS-&lt;wbr&gt;* and whatever you&#39;d like to call the architectural style it embod=\r\nies, if you happen to believe that it actually does so). Only if you define=\r\n SOA (as I believe Roy and many other REST folks do) as the unnamed archite=\r\nctural style underlying WSDL, SOAP &amp; Co., this seems a conflict.&lt;br&gt;\n&g=\r\nt; &lt;br&gt;\n&gt; One of the more interesting experiences I had at InfoQ (I&#39;m no=\r\n longer the lead editor and only loosely associated) was that it got harder=\r\n and harder to find anyone willing to write a useful technical article that=\r\n was not REST-related. Of course this may have been selection bias, but I r=\r\neally tried =85 but at some point 90% of the people I respected from the WS=\r\n-* side of things had become RESTafarians.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Best,&lt;br&gt;\n&gt=\r\n; Stefan&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n    \n\n&lt;/div&gt;\n\n\n\n&lt;!-- end=\r\n group email --&gt;\n\n&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;&lt;/div&gt;&lt;/body&gt;&lt;/html&gt;\r\n--Apple-Mail-128-220318163--\r\n\n"}}