{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":112610298,"authorName":"Roger L. Costello","from":"&quot;Roger L. Costello&quot; &lt;costello@...&gt;","replyTo":"SENDER","senderId":"FTJC-KBsSO9XXvzAKax8hegsVCquAR87zbR6DWan91Yng3oMHqoA6P33ceNEkVbNtrL96Sj1n41HMJ128FSapp0uvd9EDNCqzw8swN9PKg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Where does the Web community want to go? [Was: Changing relationship  between SOAP and REST]","postDate":"1024319972","msgId":1536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEMERFMUU0LjVBOTkwN0ExQG1pdHJlLm9yZz4=","referencesHeader":"PDNEMEJCQjdGLjM0OERBRUZAcHJlc2NvZC5uZXQ+"},"prevInTopic":0,"nextInTopic":1539,"prevInTime":1535,"nextInTime":1537,"topicId":1536,"numMessagesInTopic":3,"msgSnippet":"Paul, You are to be applauded for your tireless efforts to inform and enlighten the SOAP community, as well as the REST community.  I certainly appreciate all","rawEmail":"Return-Path: &lt;costello@...&gt;\r\nX-Sender: costello@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_0_3_2); 17 Jun 2002 13:20:24 -0000\r\nReceived: (qmail 67243 invoked from network); 17 Jun 2002 13:20:24 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m11.grp.scd.yahoo.com with QMQP; 17 Jun 2002 13:20:24 -0000\r\nReceived: from unknown (HELO smtpproxy2.mitre.org) (192.80.55.70)\n  by mta3.grp.scd.yahoo.com with SMTP; 17 Jun 2002 13:20:24 -0000\r\nReceived: from avsrv2.mitre.org (avsrv2.mitre.org [128.29.154.4])\n\tby smtpproxy2.mitre.org (8.11.3/8.11.3) with ESMTP id g5HDKNl04532\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Mon, 17 Jun 2002 09:20:23 -0400 (EDT)\r\nReceived: from MAILHUB1 (mailhub1.mitre.org [129.83.20.31])\n\tby smtpsrv2.mitre.org (8.11.3/8.11.3) with ESMTP id g5HDKKO12507\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Mon, 17 Jun 2002 09:20:21 -0400 (EDT)\r\nReceived: from rogers-pc.mitre.org (129.83.57.41) by mailhub1.mitre.org with SMTP\n        id 10586720; Mon, 17 Jun 2002 09:19:21 -0400\r\nMessage-ID: &lt;3D0DE1E4.5A9907A1@...&gt;\r\nDate: Mon, 17 Jun 2002 09:19:32 -0400\r\nOrganization: The MITRE Corporation\r\nX-Mailer: Mozilla 4.75 [en]C-20000818M  (Windows NT 5.0; U)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: &quot;rest-discuss@yahoogroups.com&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nCc: &quot;Costello,Roger L.&quot; &lt;costello@...&gt;\r\nSubject: Where does the Web community want to go? [Was: Changing relationship \n between SOAP and REST]\r\nReferences: &lt;3D0BBB7F.348DAEF@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: &quot;Roger L. Costello&quot; &lt;costello@...&gt;\r\nX-Yahoo-Group-Post: member; u=112610298\r\n\r\nPaul,\n\nYou are to be applauded for your tireless efforts to inform and\nenlighten the SOAP community, as well as the REST community.  I\ncertainly appreciate all of the articles that you have written, as well\nas the hundreds of email messages on the topic.  Thank you.\n\nIt is certainly very good news that SOAP will provide a SOAP HTTP GET,\nand will stop funneling all requests through a single endpoint.  These\nchanges will have a tumultuous impact on the trio of Web service\ntechnologies - SOAP, WSDL, and UDDI.\n\nWhile things are being shaken up...\n\nI wonder (out loud) about the virtue of SOAP bothering to continue at\nall?  \n\nWhere do we, the Web community, want to go with regards to the Web?  I\nbelieve that we want to go to a place where Web messages can be\nunderstood without prior coding (i.e., my robot can travel the Web,\ninteract with services, dynamically understand how to use the services,\nand dynamically understand the information that it gets back from the\nservices).  From what I have read and heard, that&#39;s where we say that we\nwant to go.\n\nAre the current protocols: \n\n  - standard addressing/naming using URI, \n  - generic application interface using HTTP, \n  - standard MIME Types, \n  - Standard Representations\n\nsufficient to take us there?  I assert that they are.  To get to where\nwe say that we want to go is not a matter of creating a new protocol to\ntunnel within existing protocols.  \n\nI believe that we can get to where we want to go in a two-step process:\n\n1. Create standard XML vocabularies for Communities of Interest (COI).\nThis is already happening.\n\n2. Create XML vocabularies that facilitate inferencing and discovery. \nRDF and DAML are nicely guiding us to this direction.\n\nWill SOAP, in any of its forms, take us to where we want to go?  I do\nnot believe so.  SOAP is a detracter.  It is not helping us get to where\nwe say that we want to go.\n\nI do not see the need for SOAP, in any form. \n\nWe, the Web community, need to refocus.  /Roger\n\nPaul Prescod wrote:\n&gt; \n&gt; This is my rambling sense of the state of the debate between SOAP and\n&gt; REST.\n&gt; \n&gt; To their credit, the SOAP working group has responded to our criticism\n&gt; of the SOAP model and I think that there is a 50/50 chance that the most\n&gt; severe incompatibility between the two models can be fixed over the next\n&gt; while. In particular, I believe that they are coming to agree that the\n&gt; &quot;single endpoint&quot; model is architecturally unsound. I have two reasons\n&gt; to believe that this is the case. The first is that they have defined a\n&gt; &quot;GET&quot; binding for SOAP and agreed that it should be used for any HTTP\n&gt; SOAP service that has the semantics of HTTP&#39;s GET. The second is that\n&gt; I&#39;ve gotten generally positive agreement that the SOAP primer should\n&gt; specifically say that an endpoint-per-resource model makes more . I\n&gt; haven&#39;t got MUCH feedback but the feedback I&#39;ve gotten so far has been\n&gt; positive:\n&gt; \n&gt;  * http://lists.w3.org/Archives/Public/xml-dist-app/2002Jun/0036.html\n&gt; \n&gt; Here is the proposed text:\n&gt; \n&gt; &quot;One of the principles of Web Architecture is that all important\n&gt; resources should be identified by URIs. This implies that many\n&gt; well-architected SOAP services will be embodied as large\n&gt; numbers or resources, each with its own URI.  Indeed, many\n&gt; such resources are likely to be created dynamically during\n&gt; operation of the service, as new information becomes available.\n&gt; For example, a service offering stock prices might use\n&gt; a distinct URI for each stock tracked, and perhaps for\n&gt; each date and time for which quotes are provided.&quot;\n&gt; \n&gt; This is a non-normative change to the specification but it implies\n&gt; massive changes to SOAP toolkits and to WSDL. I believe that most\n&gt; existing SOAP toolkits do not allow easy implementation of this\n&gt; convention. This is especially true for toolkits for statically typed\n&gt; languages with &quot;interface generators.&quot; But that&#39;s okay, because these\n&gt; toolkits take their lead from WSDL, and one of the WSDL requirements\n&gt; (that I proposed) also addresses this issue:\n&gt; \n&gt; &quot;The description language SHOULD allow describing Messages that include\n&gt; references (URIs) to strongly-typed referents, both values and\n&gt; Services.&quot;\n&gt; \n&gt; In other words, it should be possible to have a SOAP message or HTTP\n&gt; message with a URI in it that points to a SOAP/HTTP endpoint described\n&gt; by another WSDL. This will at least make it possible to use WSDL in a\n&gt; system where &quot;hypermedia is the engine of application state.&quot; We should\n&gt; work with the WSDL group to make sure that this happens and that\n&gt; HTTP-based services are strongly represented. We should also try and\n&gt; work with open source toolkit implementors to make sure that they do the\n&gt; right thing as examples for the closed-source vendors.\n&gt; \n&gt; My current hope for the future is that a single URI will commonly\n&gt; support both HTTP and SOAP methods. For instance, if you avoid the\n&gt; various optional SOAP features (SOAP encoding, SOAP headers), the only\n&gt; real difference between the new SOAP GET and a plain old HTTP GET is\n&gt; that the one returns a SOAP-wrapped body and the other does not.\n&gt; Content-negotiation could trigger which happens. (that should perhaps be\n&gt; added normatively to the SOAP specification!). In many situations, you\n&gt; could just accept that for marketing reasons you must wrap your XML in a\n&gt; SOAP:Envelope and SOAP:Body and move on. POST is similar to GET. You can\n&gt; probably just build your REST service and ignore the SOAP:Envelope and\n&gt; SOAP:Body. SOAP does not define PUT or DELETE, so the &quot;HTTP side&quot; of a\n&gt; service can use them without conflict. REST could be viewed as a sort of\n&gt; best-practices for SOAP usage -- even if we&#39;re not using much of SOAP.\n&gt; \n&gt; Hmmmm. There should probably be a TAG ruling on whether it is\n&gt; appropriate to use SOAP methods to do something that is logically\n&gt; equivalent to an HTTP PUT and DELETE or whether you should just use HTTP\n&gt; PUT and DELETE. It seems to me that it kind of follows naturally from\n&gt; the GET decision but it might be politically harder because PUT and\n&gt; DELETE are not as popular or architecturally important as GET.\n&gt; \n&gt; But all of this will only work if the toolkits allow it. If it is\n&gt; prohibitively expensive to assign URIs to objects, or to accept *both*\n&gt; HTTP and SOAP methods on the same object, we will find ourselves back at\n&gt; odds with SOAP again.\n&gt; \n&gt; I think that pushback is quite likely because SOAP has many tensions (I\n&gt; would go so far as to say contradictions) in its design. It&#39;s an RPC\n&gt; protocol but not really. It&#39;s a synchronous protocol but not really. The\n&gt; one that is dangerous to REST: it is a web protocol but it is also\n&gt; &quot;transport agnostic&quot;. This latter means that it could be tricky to make\n&gt; a SOAP API or user interface that allows really good Web-based Web\n&gt; Services and then allows you to push a button and get the same features\n&gt; on MQSeries or SMTP. REST people could fantasize that this might result\n&gt; in the Web model leaking onto other transports but alternately it might\n&gt; mean that Web features (like SOAP GET and one-endpoint-per-resource)\n&gt; just don&#39;t get implemented.\n&gt; \n&gt; In addition, there are all of the SOAP add-ons which will come to the\n&gt; fore when SOAP is standardized. Someone will have to ensure that\n&gt; WS-Security, WS-Routing, transaction standards etc. interact properly\n&gt; with HTTP and Web architecture etc. Keeping up with this stuff is a\n&gt; full-time job!\n&gt; \n&gt; In other words, there is a fight on for the Soul of SOAP -- will it be\n&gt; COM for the Internet, or an XML wrapper for the Web, or something else\n&gt; entirely?\n&gt; \n&gt; And of course there remains the issue of pre-defined methods as in HTTP\n&gt; versus invent your own as in the traditional SOAP style.\n&gt; \n&gt; Nevertheless, the good news is that it if things go the right way, it\n&gt; will be increasingly possible to tell our customers and bosses\n&gt; (honestly!) that we are using SOAP and REST. Perhaps if we are vocal\n&gt; enough with that message the other standards and implementations will\n&gt; fall into place more easily.\n&gt; \n&gt;  Paul Prescod\n&gt; \n&gt; \n&gt; To unsubscribe from this group, send an email to:\n&gt; rest-discuss-unsubscribe@yahoogroups.com\n&gt; \n&gt; \n&gt; \n&gt; Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n\n"}}