{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":210009313,"authorName":"Glenn Block","from":"Glenn Block &lt;glenn.block@...&gt;","profile":"glenn_block","replyTo":"SENDER","senderId":"JTCFElmLZP4d7cSrSK7_DuVCxzrNDDGNtrw2VVn1jwVERMdDLdH5psPnvkr-a8BW6d5jLVBmbVR8SR-IHTmd4mqT2pPTEi0MqaQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trying to wrap my brain around HATEOS","postDate":"1275524796","msgId":15518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlraVhveXd6dDEwTTQ4NGowY2ZaRVJRbjZqLUdUYkFsV0pEY2RNOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":15519,"prevInTime":15517,"nextInTime":15519,"topicId":15518,"numMessagesInTopic":11,"msgSnippet":"I get HATEOS for human interaction. I am trying to undestand pure m2m benefits. If I think of a scenario of an Order management server host. I can imagine that","rawEmail":"Return-Path: &lt;glenn.block@...&gt;\r\nX-Sender: glenn.block@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 19899 invoked from network); 3 Jun 2010 00:26:36 -0000\r\nX-Received: from unknown (66.196.94.107)\n  by m1.grp.sp2.yahoo.com with QMQP; 3 Jun 2010 00:26:36 -0000\r\nX-Received: from unknown (HELO mail-vw0-f43.google.com) (209.85.212.43)\n  by mta3.grp.re1.yahoo.com with SMTP; 3 Jun 2010 00:26:36 -0000\r\nX-Received: by vws3 with SMTP id 3so4179095vws.30\n        for &lt;rest-discuss@yahoogroups.com&gt;; Wed, 02 Jun 2010 17:26:36 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.224.88.224 with SMTP id b32mr3949198qam.343.1275524796060; \n\tWed, 02 Jun 2010 17:26:36 -0700 (PDT)\r\nX-Received: by 10.229.232.5 with HTTP; Wed, 2 Jun 2010 17:26:36 -0700 (PDT)\r\nDate: Wed, 2 Jun 2010 17:26:36 -0700\r\nMessage-ID: &lt;AANLkTikiXoywzt10M484j0cfZERQn6j-GTbAlWJDcdM9@...&gt;\r\nTo: rest-discuss@yahoogroups.com\r\nContent-Type: multipart/alternative; boundary=00c09f89956e5f199004881542b4\r\nFrom: Glenn Block &lt;glenn.block@...&gt;\r\nSubject: Trying to wrap my brain around HATEOS\r\nX-Yahoo-Group-Post: member; u=210009313; y=TD6YU4zDL7K-_kYbUwUhL6Xzm6r9qNtemVZIZfKeRKThWQAWWTk\r\nX-Yahoo-Profile: glenn_block\r\n\r\n\r\n--00c09f89956e5f199004881542b4\r\nContent-Type: text/plain; charset=ISO-8859-1\r\n\r\nI get HATEOS for human interaction. I am trying to undestand pure m2m\nbenefits. If I think of a scenario of an Order management server host. I can\nimagine that when I retrieve an Order resource I can perform several\n&quot;actions&quot; on that order like Approve, Hold, etc. I would see these as links.\nIn this case if I had a machine talking to such a host, it can post to those\nlinks with the advantage being that the agent / calling ocde doesn&#39;t\nhave coupling to where those links point to or how the URIs are formed.\nHowever the client code which interacts with the agent has some idea that\nApprove and Hold exist, so it is coupled in that sense.\n\nI started to think about m2m scenarios (other than web crawlers) where I\ncould truly leverage the full decoupling that HATEOS i.e. an adaptable\nsystem that only knows to look for types of links but doesn&#39;t expect any\nspecific instances of those links (like Approve) to be present.\n\nI thought back to my past life prior to MS when I used to work in the\nfinancial services industry. In those days we had to do a ton of back end\nprocessing off data we received from multiple financial sources over FTP. I\nbuilt a generic FTP scanner that looked for files, ripped them open, parsed\nthem and then started executing all types of rules (I Blame Jan partially\nfor forcing me down this mental road). There was basically zero human\ninteraction other than monitoring the status of the processing. That system\nwas coupled, it required data to be send in a specific schema and that had a\npredefined set of rules that were implicit as part of the schema.\n\n*Disclaimer: Thought experiment follows*\n\nNow let&#39;s say I decided to design such a system today in a RESTFul manner\naround resources and HATEOS. In this case I am imagining I have a\nJobs&#92;Pending resource. I do a get on that resource and get back a list of\njobs that are pending to be processed. Now each Job has rules that have to\nexecute. So in this world, I am thinking the rules are links with each link\npoint to a resource that handles processing that rule. Or maybe the link\nreturns me some code that gets executed on the fly.\n\nAnyway the advantage I saw in such a system is my the institutions that work\nwith me can create any arbitrary set of rules they like. My which processes\njobs doesn&#39;t know anything about the rules or care. All it knows it that is\nhas some URI that it can post to (or possibly Get) in order to execute some\narbitrary logic. I now have an autonomous system that can easily adapt to\nnew requirements. I am truly reaping the benefits of HATEOS in such a\nsystem.\n\nThoughts?\nGlenn\n\r\n--00c09f89956e5f199004881542b4\r\nContent-Type: text/html; charset=ISO-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;div&gt;I get HATEOS for human interaction. I am trying to undestand pure m2m =\r\nbenefits. If I think of a scenario of an Order management server host. I ca=\r\nn imagine that when I retrieve an Order resource I can perform several &quo=\r\nt;actions&quot; on that order like Approve, Hold, etc. I would see these as=\r\n links. In this case if I had a machine talking to such a host, it can post=\r\n to those links with the advantage being that the agent / calling ocde does=\r\nn&#39;t have=A0coupling to where those links point to or how the URIs are f=\r\normed. However the client code which interacts with the agent has some idea=\r\n that Approve and Hold exist, so it is coupled in that sense.&lt;/div&gt;\n\n&lt;div&gt;=\r\n=A0&lt;/div&gt;\n&lt;div&gt;I started to think about m2m scenarios (other than web crawl=\r\ners) where I could truly leverage the full decoupling that HATEOS i.e. an a=\r\ndaptable system that only knows to look for types of links=A0but doesn&#39;=\r\nt expect any specific instances of those links (like Approve) to be present=\r\n.&lt;/div&gt;\n\n&lt;div&gt;=A0&lt;/div&gt;\n&lt;div&gt;I thought back to my past life prior to MS whe=\r\nn I used to work in the financial services industry. In those days we had t=\r\no do a ton of back end processing off data we received from multiple financ=\r\nial sources over FTP. I built a generic FTP scanner that looked for files, =\r\nripped them open, parsed them and then started executing all types of rules=\r\n (I Blame Jan partially for forcing me down this mental road). There was ba=\r\nsically zero human interaction other than monitoring the status of the proc=\r\nessing. That system was coupled, it required data to be send in a specific =\r\nschema and that had a predefined set of rules that were implicit as part of=\r\n the schema.&lt;/div&gt;\n\n&lt;div&gt;=A0&lt;/div&gt;\n&lt;div&gt;&lt;u&gt;Disclaimer: Thought experiment f=\r\nollows&lt;/u&gt;&lt;/div&gt;\n&lt;div&gt;=A0&lt;/div&gt;\n&lt;div&gt;Now let&#39;s say I decided to design =\r\nsuch a system today=A0in a RESTFul manner around resources and HATEOS. In t=\r\nhis case I am imagining I have a Jobs&#92;Pending resource. I do a get on that =\r\nresource and get back a list of jobs that are pending to be processed. Now =\r\neach Job has rules that have to execute. So in this world, I am thinking th=\r\ne rules are links with each link point to a resource that handles processin=\r\ng that rule. Or maybe the link returns me some code that gets executed on t=\r\nhe fly. &lt;/div&gt;\n\n&lt;div&gt;=A0&lt;/div&gt;\n&lt;div&gt;Anyway the advantage I saw in such a sy=\r\nstem is my the institutions that work with me can create any arbitrary set =\r\nof rules they like. My which processes jobs doesn&#39;t know anything about=\r\n the rules or care. All it knows it that is has some URI that it can post t=\r\no (or possibly Get) in order to execute some arbitrary logic. I now have an=\r\n autonomous system that can easily adapt to new requirements. I am truly re=\r\naping the benefits of HATEOS in such a system.&lt;/div&gt;\n\n&lt;div&gt;=A0&lt;/div&gt;\n&lt;div&gt;T=\r\nhoughts?&lt;/div&gt;\n&lt;div&gt;Glenn&lt;/div&gt;\n&lt;div&gt;=A0&lt;/div&gt;\n&lt;div&gt;=A0&lt;/div&gt;\n&lt;div&gt;=A0&lt;/div=\r\n&gt;\n\r\n--00c09f89956e5f199004881542b4--\r\n\n"}}