{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":289191104,"authorName":"Jan Algermissen","from":"Jan Algermissen &lt;algermissen1971@...&gt;","profile":"algermissen1971","replyTo":"SENDER","senderId":"VKtgDMuJC55pKy5F4J2Dg0WsvNqMaqSmGf6KfPdvWD4ArV6O3i4cUoLfaYQuK4aG9yI_SLqeSShd1v7NQD__6eN_UYhW3CT_P05lbZZmPWg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Trying to wrap my brain around HATEOS","postDate":"1275550015","msgId":15524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5NTk1ODY5LTA3N0MtNDVBMy1BNjVBLTBBNUIzRjU5Q0E4RkBtYWMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlraVhveXd6dDEwTTQ4NGowY2ZaRVJRbjZqLUdUYkFsV0pEY2RNOUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlraVhveXd6dDEwTTQ4NGowY2ZaRVJRbjZqLUdUYkFsV0pEY2RNOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":15523,"nextInTopic":15525,"prevInTime":15523,"nextInTime":15525,"topicId":15518,"numMessagesInTopic":11,"msgSnippet":"Glenn, ... Since you are early to use that silly acronym there might be a chance for a fix :-) The thingy is called hypermedia constraint if you can, please","rawEmail":"Return-Path: &lt;algermissen1971@...&gt;\r\nX-Sender: algermissen1971@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 84077 invoked from network); 3 Jun 2010 07:27:26 -0000\r\nX-Received: from unknown (66.196.94.105)\n  by m1.grp.sp2.yahoo.com with QMQP; 3 Jun 2010 07:27:26 -0000\r\nX-Received: from unknown (HELO asmtpout024.mac.com) (17.148.16.99)\n  by mta1.grp.re1.yahoo.com with SMTP; 3 Jun 2010 07:27:26 -0000\r\nMIME-version: 1.0\r\nContent-transfer-encoding: 7BIT\r\nContent-type: text/plain; charset=us-ascii\r\nX-Received: from [192.168.2.102] ([84.144.92.200])\n by asmtp024.mac.com (Sun Java(tm) System Messaging Server 6.3-8.01 (built Dec\n 16 2008; 32bit)) with ESMTPSA id &lt;0L3F00GQ0GOW7I20@...&gt; for\n rest-discuss@yahoogroups.com; Thu, 03 Jun 2010 00:27:00 -0700 (PDT)\r\nX-Proofpoint-Spam-Details: rule=notspam policy=default score=0 spamscore=0\n ipscore=0 phishscore=0 bulkscore=0 adultscore=0 classifier=spam adjust=0\n reason=mlx engine=6.0.2-1004200000 definitions=main-1006030004\r\nX-Proofpoint-Virus-Version: vendor=fsecure\n engine=1.12.8161:2.4.5,1.2.40,4.0.166\n definitions=2010-06-01_02:2010-02-06,2010-06-01,2010-06-02 signatures=0\r\nIn-reply-to: &lt;AANLkTikiXoywzt10M484j0cfZERQn6j-GTbAlWJDcdM9@...&gt;\r\nDate: Thu, 03 Jun 2010 09:26:55 +0200\r\nCc: REST Discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nMessage-id: &lt;E9595869-077C-45A3-A65A-0A5B3F59CA8F@...&gt;\r\nReferences: &lt;AANLkTikiXoywzt10M484j0cfZERQn6j-GTbAlWJDcdM9@...&gt;\r\nTo: Glenn Block &lt;glenn.block@...&gt;\r\nX-Mailer: Apple Mail (2.1078)\r\nFrom: Jan Algermissen &lt;algermissen1971@...&gt;\r\nSubject: Re: [rest-discuss] Trying to wrap my brain around HATEOS\r\nX-Yahoo-Group-Post: member; u=289191104; y=2uLKNtj5DSlvD_53NvxaGp_nELfZ2pnp8j7JJ1h_ZQqt9lvq-OesDY6w\r\nX-Yahoo-Profile: algermissen1971\r\n\r\nGlenn,\n\nOn Jun 3, 2010, at 2:26 AM, Glenn Block wrote:\n\n&gt; \n&gt; \n&gt; I get HATEOS for human interaction.\n\nSince you are early to use that silly acronym there might be a chance for a fix :-) The thingy is called\n\n&quot;hypermedia constraint&quot;\n\nif you can, please erase the acronym froom your brain :o)\n\n&gt; I am trying to undestand pure m2m benefits. If I think of a scenario of an Order management server host. I can imagine that when I retrieve an Order resource I can perform several &quot;actions&quot; on that order like Approve, Hold, etc.\n\nIf your user agent expects those next state transitions through the application to be present then you are already violating the hypermedia constraint; the user agent implementation is violating it because it assumes something at design time that it should only discover at runtime.\n\nThe transitions *might* be there, but they need not be. The user agent must simply react on what it is given by the server. If the user agent is designed to expose an &#39;approve&#39; hypermedia control to the user (machine or human) for activation (e.g. an &#39;approve&#39; button in a GUI case) then the correct implementation of the user agent is to expose the control if the corresponding link is found and not expose it (e.g. deactivate the button) when the link is not found.\n\nThis is why the user agent can never break - it just assumes nothing, just makes application state accessible.\n\nNow, the user&#39;s intent is an entirely different thing to consider. Obviously, I cannot buy a book at Amazon if that book is out of stock - my expectations that I can breaks. So what? All I need is a strategy to work on from that point. Machine users simply need to do the same.\n\nThe common misconception is that an object oriented interface definition of a Product class can magically ensure that a product will be orderable because the IDL says there is a order() method. That is an illusion because the IDL makes not go away the fact that you are dealing with a networked environment and have no control about what the server is doing whatsoever.\n\nREST helps with this because it makes explicit the distinction between the user and the component through which the user interacts with the networked application. And REST provides a way to eliminate all coupling between that component and the server besides the agreement on the uniform interface and the media types used in the interaction.\n\n....\n\nThe aspect of all this that currently absorbs all my brain energy is the question of what portion of the client side process should be designed as a user agent. I think that in many cases, the user agent is the whole process (as in the case of a crawler). Finding the right amount of client side &#39;pieces&#39; to form the user agent is at the heart of client side design activity.\n\n\n\n&gt; I would see these as links. In this case if I had a machine talking to such a host, it can post to those links with the advantage being that the agent / calling ocde doesn&#39;t have coupling to where those links point to or how the URIs are formed. However the client code which interacts with the agent has some idea that Approve and Hold exist, so it is coupled in that sense.\n&gt; \n&gt; I started to think about m2m scenarios (other than web crawlers) where I could truly leverage the full decoupling that HATEOS i.e. an adaptable system that only knows to look for types of links but doesn&#39;t expect any specific instances of those links (like Approve) to be present.\n&gt; \n&gt; I thought back to my past life prior to MS when I used to work in the financial services industry. In those days we had to do a ton of back end processing off data we received from multiple financial sources over FTP. I built a generic FTP scanner that looked for files, ripped them open, parsed them and then started executing all types of rules (I Blame Jan partially for forcing me down this mental road). There was basically zero human interaction other than monitoring the status of the processing. That system was coupled, it required data to be send in a specific schema and that had a predefined set of rules that were implicit as part of the schema.\n\nBut the coupling in this cases solely comes from the fact that a common format was assumed. If your files would have had associated meta data that told the scanner what format they contained (IOW: how to process the content) and if the scanner understood all possible formats, you would not have had that coupling. The association of schema and processing rules you mention above is what the Web calles a media type.\n\nIn fact, you above system sounds pretty RESTful already :-) The FTP directory serves sort of as an index file providing all the links to the to-be-scanned documents (file system inodes as a form of hypermedia if you want).\n\nJan\n\n&gt; \n&gt; Disclaimer: Thought experiment follows\n&gt; \n&gt; Now let&#39;s say I decided to design such a system today in a RESTFul manner around resources and HATEOS. In this case I am imagining I have a Jobs&#92;Pending resource. I do a get on that resource and get back a list of jobs that are pending to be processed. Now each Job has rules that have to execute. So in this world, I am thinking the rules are links with each link point to a resource that handles processing that rule. Or maybe the link returns me some code that gets executed on the fly.\n&gt; \n&gt; Anyway the advantage I saw in such a system is my the institutions that work with me can create any arbitrary set of rules they like. My which processes jobs doesn&#39;t know anything about the rules or care. All it knows it that is has some URI that it can post to (or possibly Get) in order to execute some arbitrary logic. I now have an autonomous system that can easily adapt to new requirements. I am truly reaping the benefits of HATEOS in such a system.\n&gt; \n&gt; Thoughts?\n&gt; Glenn\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n\n-----------------------------------\nJan Algermissen, Consultant\nNORD Software Consulting\n\nMail: algermissen@...\nBlog: http://www.nordsc.com/blog/\nWork: http://www.nordsc.com/\n-----------------------------------\n\n\n\n\n\n"}}