{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"aK3S-lXYihbYI_iw4URG-2_OGeNGjZ1wkOCR_Tv0jFOjvZzhlURD4-GE8hm4TUCzF4owxa6KIqLNr5JcBGIke6xeV9oUfO6AV4GXZ4EWwA","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Content-Location best practice? (was: Determining which Media type  for post/put)","postDate":"1276863790","msgId":15725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTAwNjE4MDYyMzEwLmY5MjFiZDcxLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","inReplyToHeader":"PEFBTkxrVGltMVlQZXYwVENWYXdDNFlGV2hMNmJ4WGtTTGlGNV9WOUljTloyUkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGltMVlQZXYwVENWYXdDNFlGV2hMNmJ4WGtTTGlGNV9WOUljTloyUkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":15724,"nextInTopic":15726,"prevInTime":15724,"nextInTime":15726,"topicId":15724,"numMessagesInTopic":11,"msgSnippet":"... It s simply a fact.  We don t require glass to be a liquid in casual conversation -- it would be confusing to speak of a liquid shattering into a million","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 30080 invoked from network); 18 Jun 2010 12:23:50 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m13.grp.re1.yahoo.com with QMQP; 18 Jun 2010 12:23:50 -0000\r\nX-Received: from unknown (HELO mxout-08.mxes.net) (216.86.168.183)\n  by mta1.grp.sp2.yahoo.com with SMTP; 18 Jun 2010 12:23:50 -0000\r\nX-Received: from bigbison (unknown [65.117.211.162])\n\t(using TLSv1 with cipher DHE-RSA-AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\tby smtp.mxes.net (Postfix) with ESMTPSA id 54411509DD;\n\tFri, 18 Jun 2010 08:23:49 -0400 (EDT)\r\nDate: Fri, 18 Jun 2010 06:23:10 -0600\r\nTo: Peter Williams &lt;pezra@...&gt;\r\nCc: Rest List &lt;rest-discuss@yahoogroups.com&gt;\r\nMessage-Id: &lt;20100618062310.f921bd71.eric@...&gt;\r\nIn-Reply-To: &lt;AANLkTim1YPev0TCVawC4YFWhL6bxXkSLiF5_V9IcNZ2R@...&gt;\r\nReferences: &lt;AANLkTim1YPev0TCVawC4YFWhL6bxXkSLiF5_V9IcNZ2R@...&gt;\r\nOrganization: Bison Systems Corporation\r\nX-Mailer: Sylpheed 3.0.0 (GTK+ 2.10.14; i686-pc-mingw32)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nSubject: Re: Content-Location best practice? (was: Determining which Media\n type  for post/put)\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nPeter Williams wrote:\n&gt;\n&gt; &gt; Variants are resources.\n&gt; \n&gt; I don&#39;t think this is required to be true.\n&gt;\n\nIt&#39;s simply a fact.  We don&#39;t require glass to be a liquid in casual\nconversation -- it would be confusing to speak of a liquid shattering\ninto a million pieces.  But this doesn&#39;t change the simple fact that\nglass is a liquid -- knowledge required for any discussion of the\nChemistry or Physics of glass.\n\nAny discussion of content negotiation (except compression, or to be\nmore technically accurate, aside from variance in Transfer-Encoding or\nsimilar variance in wrapping the entity) requires an acceptance of the\nfact that variants are also resources in their own right.\n\n&gt;\n&gt; A variant is a resource\n&gt; if, and only if, the server decides it is.  If the server decides that\n&gt; a variant is a resource it will assign the variant a resource\n&gt; identifier.\n&gt; \n\nThis view makes it impossible to violate the identification of\nresources constraint.  A variant is a resource in its own right,\nwhether the server assigns it a resource identifier or not.  Failure to\nassign URIs to resources is not only possible, it violates that\nconstraint.  If resources are only what the server says they are, the\nconstraint is inviolable by definition, but that&#39;s not actually the\ncase.\n\n&gt;\n&gt; As the dissertation says,[1]\n&gt; \n&gt;   a resource R is a temporally varying membership function MR(t),\n&gt;   which for time t maps to a set of entities, or values, which are\n&gt;   equivalent.\n&gt; \n\nExactly.  A resource is simply an abstraction.  R1 is a negotiated\nresource, V is a member of R1.  R2 is not a negotiated resource, which\nalso contains V as a member.  Calling variant V a resource in its own\nright, is merely acknowledging the existence of R2, whether R2 has a\nURI or not.\n\n&quot;In other words, any concept that might be the target of an author&#39;s\nhypertext reference must fit within the definition of a resource.&quot;\n\nWe wish to distinguish one variant from another by recognizing R2 and\nassigning it a URI.  If the concept of R2 is to become a hypertext\ntarget like that, all REST says is that R2 must fit the definition of a\nresource, which it does.  REST does not imply that once a variant has\nbeen identified as a member of R, that it cannot also belong to R2.\n\n&gt;\n&gt; The rules for\n&gt; defining equivalence seem left entirely to the server&#39;s discretion.\n&gt; \n\nYes, they are.  Whatever variants the server assigns to one URI, also\nhappen to be resources in their own right, whether the server\nidentifies them as such, or not.  Just as glass is a liquid, whether we\ncall it that or not.  Being an equivalent variant of one resource, does\nnot restrict the variant from also representing some other resource:\n\n&quot;\nFor example, the &quot;authors&#39; preferred version&quot; of an academic paper is a\nmapping whose value changes over time, whereas a mapping to &quot;the paper\npublished in the proceedings of conference X&quot; is static. These are two\ndistinct resources, even if they both map to the same value at some\npoint in time. The distinction is necessary so that both resources can\nbe identified and referenced independently.\n&quot;\n\nNote that Roy gives an example of a variant (nothing prevents author&#39;s\npreferred version from being a negotiated resource) that&#39;s a member of\ntwo different sets.  Nothing is wrong with assigning multiple\nconceptual mappings to an entity.  In fact, this distinction is\nnecessary in order to distinguish negotiated variants from one another.\n;-)\n\n&gt;\n&gt; I don&#39;t see any suggestion in the dissertation, though perhaps i just\n&gt; missed it, that it all non-byte-for-byte identical entities must, or\n&gt; even should, be treated as separate resources.\n&gt;\n\nThat&#39;s my wording, all I mean is varying by Transfer-Encoding, but\nthat&#39;s HTTP which you want to avoid.  Unless we&#39;re talking about\ncompression (unless there&#39;s some other use of Transfer-Encoding I&#39;m not\naware of), we&#39;re talking about some variance between entities which\nmakes them not byte-for-byte the same.\n\n&gt; \n&gt; Why you think that all variants must also be resources in their own\n&gt; right?\n&gt; \n\nIf a resource varies between HTML and Atom representations, then those\ntwo variants, taken separately, must have some abstract definition that\nis different from one another, and is also different from the abstract\ndefinition of the negotiated resource whose URI they share.  R =\nconcept as HTML or Atom, R1 = concept as HTML and only HTML, R2 =\nconcept as Atom and only Atom.\n\nThis is an absolute given, except for the HTTP case of Transfer-\nEncoding, or any similar case where the variance which occurs is\nconfined to a wrapper which does not alter the underlying entity (what\nI meant by byte-for-byte the same).\n\nAbstractions R1 and R2 exist separately from abstraction R, therefore\nthree resources exist.  To assign URIs to R1 and R2 is to apply the\nidentification of resources constraint.  To fail, is to violate the\nconstraint (refusing to call glass a liquid).\n\n-Eric\n\n"}}