{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Joe Hsy","from":"Joe Hsy &lt;joe.hsy@...&gt;","replyTo":"SENDER","senderId":"W7mnFdgbCQxFypLrhovx3jtRAbEsJHP5qZV1xABzpFu1r1kviO67_bBpnhGXeVCNltILSgQsvrFb4Jd3vM-nGIwyxgE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [rest-discuss] sending orders to order-takers","postDate":"1024445774","msgId":1576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMjIzNjcxODJCOEQ1MTFBNzcxMDA1MDhCREYzNDg2MDQ5QTUyRkNAZXhjaGFuZ2UtMS5rZXlub3RlLmNvbT4="},"prevInTopic":1575,"nextInTopic":1577,"prevInTime":1575,"nextInTime":1577,"topicId":1570,"numMessagesInTopic":16,"msgSnippet":"... From: Paul Prescod [mailto:paul@prescod.net] ... I totally agree with this and you ve done a great job articulating it as usual. ... Interesting.  I was","rawEmail":"Return-Path: &lt;joe.hsy@...&gt;\r\nX-Sender: joe.hsy@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_0_3_2); 19 Jun 2002 00:16:47 -0000\r\nReceived: (qmail 84550 invoked from network); 19 Jun 2002 00:16:46 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m2.grp.scd.yahoo.com with QMQP; 19 Jun 2002 00:16:46 -0000\r\nReceived: from unknown (HELO mailnew.keynote.com) (65.198.48.132)\n  by mta3.grp.scd.yahoo.com with SMTP; 19 Jun 2002 00:16:46 -0000\r\nReceived: from exchange-1.keynote.com (exchange-1.keynote.com [65.198.49.11])\n\tby mailnew.keynote.com (8.12.3/8.12.3) with ESMTP id g5J0GFgc008043;\n\tTue, 18 Jun 2002 17:16:15 -0700 (PDT)\r\nX-Handled-By: mailnew.keynote.com\r\nReceived: by exchange-1.keynote.com with Internet Mail Service (5.5.2653.19)\n\tid &lt;M5D4B9HN&gt;; Tue, 18 Jun 2002 17:16:15 -0700\r\nMessage-ID: &lt;1022367182B8D511A77100508BDF3486049A52FC@...&gt;\r\nTo: &quot;&#39;Paul Prescod&#39;&quot; &lt;paul@...&gt;, rest-discuss@yahoogroups.com\r\nSubject: RE: [rest-discuss] sending orders to order-takers\r\nDate: Tue, 18 Jun 2002 17:16:14 -0700\r\nMIME-Version: 1.0\r\nX-Mailer: Internet Mail Service (5.5.2653.19)\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nFrom: Joe Hsy &lt;joe.hsy@...&gt;\r\nX-Yahoo-Group-Post: public\r\n\r\n\n-----Original Message-----\nFrom: Paul Prescod [mailto:paul@...]\n\n&gt; In the second phase we acknowledge that the world is a complicated place\n&gt; and total interoperability will never come for free. REST isn&#39;t going to\n&gt; repeal the laws of the universe and physics. We are shifting\n&gt; interoperability hassles from the protocol down into the representation.\n&gt; ...\n&gt; The other reason it is much better to move interoperability into the\n&gt; representation is because it enables a wide variety of tools that don&#39;t\n&gt; care about the representation. URI-Browsers, caching proxies, encrypting\n&gt; proxies, method-triggered filters, mirroring tools, etc. You can just\n&gt; point these things at a set of URIs and they can do something useful\n&gt; without knowing anything about the XML vocabulary used.\n\nI totally agree with this and you&#39;ve done a great job articulating it as\nusual.\n\n&gt; Different people use different definitions of RPC. I think that Mark&#39;s\n&gt; definition is that a protocol is an RPC protocol if the definition of\n&gt; new methods is something routinely done by the application, rather than\n&gt; in a networking-specific layer.\n\nInteresting.  I was using a definition of RPC where the call and parameters\nmust be explicitly agreed-upon.  That may explain the difference in our\ndiscussion.\n\n&gt; Okay, but in REST, the action will almost always result in a new\n&gt; resource that can be referenced and discussed. So you might as well call\n&gt; it the &quot;submit attack request&quot; action. i.e. POST\n\nThis is where I think we need a little flexibility.  I agree with the\nbenefit of actions always resulting in resources or state changes, but I\ndon&#39;t think we necessarily then have to force people to think of all actions\nas posting a request document.  The benefits of a representational layer can\nbe there without this restriction.  \n\n&gt; Agreed, but we have much better tools for working with brittleness in\n&gt; the representation layer than we do at the protocol layer. \n\nAgain, I agree completely.  And I would add that representational tools can\nbe used to model *actions* just as well as documents.  I think this gives\nmuch more flexibility without sacrificing the benefits of having a\nrepresentational layer.\n\n&gt; REST is about recasting applications *into* document/data retrieval and\n&gt; hyperlinking applications!\n\nI can see how this is, but I am hesitant to agree simply because I do not\nbelieve that we need to turn every problem into a document/data retrieval\nproblem in order to enjoy the core benefits of REST.  This may not be the\nbest analogy, but I get the same feeling about this that I get from\nphysicist that want to recast every mechanical problems into physics\nproblems.  Sure, it is possible and there may be some benefits, but it is\noften more work than necessary.\n\n&gt; *Except* for performance requirements, I think you&#39;ll have a hard time\n&gt; demonstrating that GET/PUT/POST/DELETE are insufficient for let&#39;s say a\n&gt; video game. All of the same benefits accrue as with any other\n&gt; application of REST. Thinking about your problem in terms of\n&gt; document/data forces you to make URIs for objects. Doing that makes\n&gt; things addressable. Other benefits follow naturally.\n\nI have no doubt that we can build video games this way, but the question is\nwhether we would want to and do we really have to.  If our goals is to\nencourage creating URIs for important objects and resources, we should make\nthat the explicit goal.  Forcing programmers to make everything into\ndocument/data just to accomplish this goal as a side-effect seems to be\noverkill.\n\n&gt; One reason to keep verbs out of the URIs is that it then becomes\n&gt; implicit what object is being acted *upon*. With REST it is explicit:\n&gt; \n&gt; DELETE /foo/bar/baz\n&gt; \n&gt; I can (for example) use ACLs to turn off DELETE permission to that URI\n&gt; or URIs of that resource type.\n&gt; \n&gt; Now compare to:\n&gt; \n&gt; POST /foo/bar/baz?action=DELETE\n&gt; \n&gt; Now you&#39;ve moved the method up into the application level and a\n&gt; pure-HTTP tool can&#39;t be used to secure it anymore. Now it needs to know\n&gt; your application semantics. That&#39;s a big part of what REST is trying to\n&gt; get away from.\n\nThis is a very good point, but think a more extensible way to create this\ntype of benefit is to create explicit action properties for ACLs to filter.\nActions can have other standard properties that may be useful filter\ncriteria such as &quot;security-level&quot;, &quot;does_modify&quot;, &quot;no-side-effect&quot;.\nLimiting ACL controls to only GET, PUT, POST, and DELETE seems to be much\ntoo course-grained.\n\nFurthermore, if we make actions explicit URIs, it is very simple to filter\naccess to those actions that the administrator wants to keep out.  This\nwould seem provide more fine-grained control.  In this way, the action is\nnot being moved to the application level, but rather it creates simple\nimplicit representation for that action in the from of an identifiable URI.\n\n&gt; Who said we should use verbs in the order? Yes, the order has a\n&gt; vocabulary that must be negotiated, as verbs must be negotiated in an\n&gt; RPC system. But that doesn&#39;t mean there are verbs in the actual order.\n\nIt wasn&#39;t me. 8-)  But, Seth certainly had no qualms putting verbs into the\norder for attacking an ogre.  I don&#39;t think there is anything wrong with\nthat.  BTW, how would you represent an order to attack an ogre without using\nany verbs?\n\n&gt; Well, SOAP is moving in that direction. If all you want is to send XML\n&gt; to URIs, you can just send POSTs of XML. The standardization of the\n&gt; verbs is a big part of what makes REST REST.\n\nI like the fact that SOAP is moving away from SOAP-RPC (with explicit\nbinding) and I think it would be very good to have SOAP be part of REST in a\nstandard endorsed way.  As for standardization of verbs, again I don&#39;t know\nif we&#39;re talking about application level verbs.  Protocol verbs are\nstandardized already with GET, PUT, POST, DELETE.  What you&#39;re suggesting\nfor REST is not standardizing application verbs, but recasting application\nverbs into representational documents which can be acted upon by the\nprotocol verbs.\n\nIf the recommendation is to always recast applications verbs into documents,\nI would suggest that instead of overloading the semantics of the POST verb,\nwe explicitly define a new protocol verb called EXECUTE with its own\nsemantics.  Then it is clear that what we&#39;re doing is sending\nrepresentations of actions to be executed.\n\nAgain, I appreciate the efforts of you and many others on explaining the\nbenefits.  I do hope this discussion is helpful as opposed to just\ndistracting.\n\n//Joe\n\nThis email message, and any attachments to it, are for the sole use of the\nintended recipients, and may contain confidential and privileged\ninformation.  Any unauthorized review, use, disclosure or distribution of\nthis email message or its attachments is prohibited.  If you are not the\nintended recipient, please contact the sender by reply email and destroy all\ncopies of the original message. \n\n"}}