{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"JqAwd7tvaVo2wtxtibjI7dC2I5K0OtZDQpR2v4q3iFtRGrnUBmYQ1vSqed-XRa0iuNF8zXuxh8pbC7CVF-WMbRWBfY2dmcGrkLd2nMoWyw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] WADL as an hypertext","postDate":"1279835427","msgId":15957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTAwNzIyMTU1MDI3Ljc5YjY4ZmI1LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","inReplyToHeader":"PEFBTkxrVGltcHJaMnhCNFM1UkJQb3ViY29veXo1MHZxSUtZRENIQVhNSl9rekBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGltcDhoalZmLUNBS1VQRTRfOUZHUWJqb3BxaVhpMXF3aFBlSkN5dkBtYWlsLmdtYWlsLmNvbT4JPDIwMTAwNzE5MTgxNDMzLmU3MWEwNGU1LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPEFBTkxrVGluZE1iQmdCS2VEaExKWGd5ZkptWV82Y1VRbjZFNmlQTmVqRzNJaEBtYWlsLmdtYWlsLmNvbT4JPDIwMTAwNzIwMTIwOTE0LmFiZjkwZDZlLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPEFBTkxrVGlsRG82SWtBM3ptMFhkb3Z1WmIzaUVZMnlfeDYxa1BrMzZMMnFGVkBtYWlsLmdtYWlsLmNvbT4JPDIwMTAwNzIwMjMzODM3LmU2MmJlYzI3LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPEFBTkxrVGltTHZ6MWFUX3ZwaFA5UlprRER3cmdJNG1acm1ZMVprd3JLVjh2dEBtYWlsLmdtYWlsLmNvbT4JPDc1ODFBQjZBLUU2QjEtNDI2Qi1BNDQ5LTA5OTYyNDlDNTY0Q0BtYWMuY29tPgk8QUFOTGtUaWxJY3pmS0h6VFdKdWY0XzRxcWdBOElaSXZsY196R2xORDZCYkVKQG1haWwuZ21haWwuY29tPgk8MjAxMDA3MjExMjUyMzUuZjg5YTJhMGIuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pgk8QUFOTGtUaW1HTG1rOEJhQ0c4TU1YUTFIVl9yVEVqSG1qSXRKU2VkR2kxVTNkQG1haWwuZ21haWwuY29tPgk8MjAxMDA3MjExNTM1MzMuZjRhNWM3OWQuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pgk8QUFOTGtUaW1wcloyeEI0UzVSQlBvdWJjb295ejUwdnFJS1lEQ0hBWE1KX2t6QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":15956,"nextInTopic":15958,"prevInTime":15956,"nextInTime":15958,"topicId":15848,"numMessagesInTopic":79,"msgSnippet":"... Unfortunately with REST, it often comes down to figuring out how to cancel the incorrect preconceptions newbies have been exposed to, before they can be","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 44618 invoked from network); 22 Jul 2010 21:50:55 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m10.grp.re1.yahoo.com with QMQP; 22 Jul 2010 21:50:55 -0000\r\nX-Received: from unknown (HELO mxout-08.mxes.net) (216.86.168.183)\n  by mta2.grp.sp2.yahoo.com with SMTP; 22 Jul 2010 21:50:53 -0000\r\nX-Received: from bigbison (unknown [65.117.211.162])\n\t(using TLSv1 with cipher DHE-RSA-AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\tby smtp.mxes.net (Postfix) with ESMTPSA id 42944509DD;\n\tThu, 22 Jul 2010 17:50:52 -0400 (EDT)\r\nDate: Thu, 22 Jul 2010 15:50:27 -0600\r\nTo: Giacomo Tesio &lt;giacomo@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nMessage-Id: &lt;20100722155027.79b68fb5.eric@...&gt;\r\nIn-Reply-To: &lt;AANLkTimprZ2xB4S5RBPoubcooyz50vqIKYDCHAXMJ_kz@...&gt;\r\nReferences: &lt;AANLkTimp8hjVf-CAKUPE4_9FGQbjopqiXi1qwhPeJCyv@...&gt;\n\t&lt;20100719181433.e71a04e5.eric@...&gt;\n\t&lt;AANLkTindMbBgBKeDhLJXgyfJmY_6cUQn6E6iPNejG3Ih@...&gt;\n\t&lt;20100720120914.abf90d6e.eric@...&gt;\n\t&lt;AANLkTilDo6IkA3zm0XdovuZb3iEY2y_x61kPk36L2qFV@...&gt;\n\t&lt;20100720233837.e62bec27.eric@...&gt;\n\t&lt;AANLkTimLvz1aT_vphP9RZkDDwrgI4mZrmY1ZkwrKV8vt@...&gt;\n\t&lt;7581AB6A-E6B1-426B-A449-0996249C564C@...&gt;\n\t&lt;AANLkTilIczfKHzTWJuf4_4qqgA8IZIvlc_zGlND6BbEJ@...&gt;\n\t&lt;20100721125235.f89a2a0b.eric@...&gt;\n\t&lt;AANLkTimGLmk8BaCG8MMXQ1HV_rTEjHmjItJSedGi1U3d@...&gt;\n\t&lt;20100721153533.f4a5c79d.eric@...&gt;\n\t&lt;AANLkTimprZ2xB4S5RBPoubcooyz50vqIKYDCHAXMJ_kz@...&gt;\r\nOrganization: Bison Systems Corporation\r\nX-Mailer: Sylpheed 3.0.3 (GTK+ 2.10.14; i686-pc-mingw32)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nSubject: Re: [rest-discuss] WADL as an hypertext\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nGiacomo Tesio wrote:\n&gt;\n&gt; May be I&#39;m getting the point (even if it&#39;s quite hard to deeply\n&gt; understand all your posts :-D).\n&gt; \n\nUnfortunately with REST, it often comes down to figuring out how to\ncancel the incorrect preconceptions newbies have been exposed to,\nbefore they can be taught properly.  This thread has convinced me to\nsemi-retire from this list for a while, until I&#39;ve written a proper\nintroductory article I can link to.  No existing article stresses the\nhypertext notion, or explains how you&#39;ve done REST before without even\nknowing it.\n\nWhich certainly won&#39;t solve the problem I constantly run into here,\nwhich is completely unexpected pushback against fundamental truths,\nlike XHTML being machine-readable, or assigning URIs to variants.  As\nI&#39;ve been saying a lot this year, REST isn&#39;t taught properly, which\nonly makes it that much harder to teach REST, and this is the critical\nproblem to address right now since the proliferation of non-REST REST\nAPIs is prima facie evidence of a widespread failure to teach REST.\n\nI took freshman honors Chemistry from Nobel laureate Dr. Tom Cech.  The\nprerequisite for honors Chemistry, was High School Chemistry.  Dr. Cech\nstarted his first lecture by telling us to forget everything we ever\nlearned in High School Chemistry, because it was wrong and would only\nget in the way.  I feel I must apply such an attitude to REST.\n\nI&#39;m probably the right person for that job.  Roy&#39;s background is that\nhe has formal training in the field of applied networked software\narchitecture.  Most of the other experts here are converts from other\nsolutions like CORBA or WS-*.  My first attempt at scaling a website,\nwas a site I built by following REST&#39;s precursor, HTTP Request Object.\nBoy was I glad that I hadn&#39;t followed the herd and just used cookies!\n\nSo my background, is as someone who never needed to be converted away\nfrom using SOAP, or cookies, or RPC, so I bring no such baggage to my\nunderstanding of REST as a style intimately related to websites.  I\nsimply never bought in to anything else, because those other solutions\nwere so damn complicated by comparison, and assumed that HTTP was only\nuseful for simple things like websites, which I knew to be false.\n\nThis website-ness of REST systems notion gets severe pushback, for\nreasons that elude me since the thesis comes right out and says so.\nThis doesn&#39;t mean REST systems have to be websites, no not at all, far\nfrom it.  But a telephony system that&#39;s built to work like a (properly-\nexecuted) website, even without browsers or even HTTP, is a REST system.\nThe Web is lightning.  REST is an attempt to bottle that lightning, but\nnot just on the Web.\n\n&gt; \n&gt; I&#39;m in a huge but _closed_ network, with (almost) none interaction\n&gt; with the external internet.\n&gt; I&#39;ve to write a quite complex application where I&#39;ve full control\n&gt; over the client and the servers, but not the intermediaries.\n&gt; \n\nSo your intermediaries won&#39;t understand any custom media type you\ncreate.  Right?\n\n&gt;\n&gt; Some of those clients could, in the future go into the internet, but\n&gt; my application will not.\n&gt; \n\nThat&#39;s a confusing statement.  In REST, &quot;application&quot; means the\nhypertext the user agent is executing.  Are you saying that some\nclients may have access to the Web, but your REST _system_ (your\nresources) will remain behind the firewall?\n\n&gt;\n&gt; Since I&#39;m not planning to write a protocol I&#39;ve thought that I could\n&gt; use HTTP (that I know quite well).\n&gt; And since I read RESTful Web Service it seemed to me quite a good\n&gt; approach.\n&gt; \n\nYou&#39;re mostly on the right track.\n\n&gt;\n&gt; Since we will write both the client and the server we are exactly in\n&gt; the condition described from andrew:\n&gt; \n&gt; &gt; a) building a new kind of browser and associated media type(s); and\n&gt; &gt; b) designing &quot;sites&quot; for that new kind of browser.\n&gt; \n\nThat condition only applies if there&#39;s no media type suitable for the\ntask at hand, that&#39;s already ubiquitous enough that you don&#39;t have to\nwrite your own client library.  This should be a last resort.\n\n&gt; \n&gt; Ir seem that we &quot;easily&quot; adopt all the constraints a part from the\n&gt; media type standardization.\n&gt; \n\nIf your media type is only to be used on your intranet, then it is\nstandardized and ubiquitous, for all intents and purposes, within the\nboundaries of your system.\n\n&gt;\n&gt; This, paraphasing Fielding, would be &quot;less RESTful&quot; that an\n&gt; application that would serve HTML.\n&gt; \n\nYou&#39;re misinterpreting Roy&#39;s comments, which have the context of the\nWeb at large, not an intranet.  It&#39;s also a contradiction with what Roy\nhas said elsewhere, that there are no shades of REST, RESTfulness is a\nbinary proposition.  So I disagree with the above-quoted comment, in\nfavor of REST/NOT REST.\n\nWhat Roy&#39;s saying is that if the client and the server both agree to\nand understand the media type, REST is satisfied.  The reason it&#39;s\n&quot;less RESTful&quot; than HTML, is that to an intermediary, it isn&#39;t a self-\ndescriptive message due to the proprietary, non-ubiquitous nature of\nthe media type identifier.\n\nIf we&#39;re talking shades of REST, then it isn&#39;t a violation of the self-\ndescriptive messaging constraint, because the user agent understands\nthe media type.  If we&#39;re talking REST/NOT REST, it is a violation of\nthe self-descriptive messaging constraint, because intermediaries don&#39;t\nunderstand the media type.\n\n&gt;\n&gt; But, AFAIK (currently), it should be a small effort to make it more\n&gt; RESTful by simply providing &quot;filters&quot; that translate the custom mime\n&gt; types in HTML or ATOM.\n&gt; \n\nREST is a layered system, so you can implement a transcoding gateway,\nwhich will perform that conversion for data bound for the Web.  This\nhas no bearing on whether your internal system is RESTful or not.\n\n&gt;\n&gt; Moreover, since we will write the client I think that we will use\n&gt; WADL as an hypertext language.\n&gt;\n\nWADL is hypertext, but it isn&#39;t generally suited for driving a REST API,\neven with a purpose-built client.  In my system, WADL will be used as\nthe output of OPTIONS requests, i.e. as an IDL.  Maintenance bots will\nbe coded against this WADL to exercise the protocol and insure that the\nsystem is operating according to its specification -- if a response\ndoesn&#39;t match the IDL, an error is reported to the log.  Such bots are\nRESTful, but they aren&#39;t exercising the application, only the\napplication interfaces.\n\nHTML can instruct a user agent dereferencing resource A, that resource\nA may be manipulated via a PUT to resource B.  All an IDL can instruct\na user agent, is that resource B accepts PUT, and resource A doesn&#39;t.\nThe relationship, that updating B updates A, can&#39;t be expressed in WADL.\nWADL is not meant to present a user with a choice of transitions to the\nnext application state, only what state transitions are allowed on a\ngiven resource.\n\nUsing HTML where you need HTML-like capability, is the re-use according\nto the principle of generality, that is a key part of the REST style.\nRepurposing WADL to serve the same function as HTML goes against the\nREST style.\n\n&gt;\n&gt; This becouse we will have a variable amount of representations lacking\n&gt; connectedness (they are like a plain gifs or bitmaps, and we will\n&gt; expose as binary data / json / xml as appropriate), one that will\n&gt; provide some connections to other resources and the WADL itself.\n&gt; \n\nThe working REST demo I posted shows how XHTML representations may link\nto XSLT stylesheets to render XHTML application steady-states from Atom\nsource documents.  Once the interfaces expressed in XHTML are\nunderstood, a purpose-built client may interact with the Atom directly,\nbypassing the XHTML entirely.\n\nThis would still be a REST system.  REST doesn&#39;t require that a user\nagent follow the hypertext API, REST only requires that such an API\nexist.  That API may even be derived from your WADL documents.\n\nI don&#39;t understand what you mean by &quot;representations lacking\nconnectedness&quot;.  Image files are still hypertext, when served over HTTP.\nAll an image file needs to be &quot;connected&quot; is a URI, and somewhere, a\nlink to that URI (like from an HTML or Atom document).\n\n&gt; \n&gt; Am I still missing something big?\n&gt;\n\nI think you&#39;re underestimating the work involved in repurposing WADL to\nfunction like HTML, particularly if you ever need accessibility.  This\nis pragmatism, though, because from a REST standpoint I can&#39;t say that\nthe resulting media type won&#39;t replace HTML, or otherwise proliferate.\nI can say that needing HTML-like capability and not choosing HTML\nviolates the *spirit* of REST (which is what I mean when I say\nsomething isn&#39;t in the REST style, vs. saying something violates a\nconstraint).\n\n-Eric\n\n"}}