{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"zDbQ8SYcQEnwopARc9w2xF3RiLXDFBVCvQe8ATY_B7Tcr_hfta-o1GHTLlIINMzg9cCDTl76lvaGRwL5CYV7bDft_lKxKmQArH3-FfJ1ug","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] WADL as an hypertext","postDate":"1280050822","msgId":15978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTAwNzI1MDM0MDIyLmQ4NmY5MDNlLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","inReplyToHeader":"PDIwMTAwNzIzMTYzNTI2LmNjYzYwOGUzLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","referencesHeader":"PEFBTkxrVGltcDhoalZmLUNBS1VQRTRfOUZHUWJqb3BxaVhpMXF3aFBlSkN5dkBtYWlsLmdtYWlsLmNvbT4JPEFBTkxrVGluZE1iQmdCS2VEaExKWGd5ZkptWV82Y1VRbjZFNmlQTmVqRzNJaEBtYWlsLmdtYWlsLmNvbT4JPDIwMTAwNzIwMTIwOTE0LmFiZjkwZDZlLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPEFBTkxrVGlsRG82SWtBM3ptMFhkb3Z1WmIzaUVZMnlfeDYxa1BrMzZMMnFGVkBtYWlsLmdtYWlsLmNvbT4JPDIwMTAwNzIwMjMzODM3LmU2MmJlYzI3LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPEFBTkxrVGltTHZ6MWFUX3ZwaFA5UlprRER3cmdJNG1acm1ZMVprd3JLVjh2dEBtYWlsLmdtYWlsLmNvbT4JPDc1ODFBQjZBLUU2QjEtNDI2Qi1BNDQ5LTA5OTYyNDlDNTY0Q0BtYWMuY29tPgk8QUFOTGtUaWxJY3pmS0h6VFdKdWY0XzRxcWdBOElaSXZsY196R2xORDZCYkVKQG1haWwuZ21haWwuY29tPgk8MjAxMDA3MjExMjUyMzUuZjg5YTJhMGIuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pgk8QUFOTGtUaW1HTG1rOEJhQ0c4TU1YUTFIVl9yVEVqSG1qSXRKU2VkR2kxVTNkQG1haWwuZ21haWwuY29tPgk8MjAxMDA3MjExNTM1MzMuZjRhNWM3OWQuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pgk8QUFOTGtUaW1wcloyeEI0UzVSQlBvdWJjb295ejUwdnFJS1lEQ0hBWE1KX2t6QG1haWwuZ21haWwuY29tPgk8MjAxMDA3MjIxNTUwMjcuNzliNjhmYjUuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pgk8QUFOTGtUaWs9em8yZ2pyWmpndlFQWjdCSjduOXlMc1lMYmIzMkxlKzVjR3hxQG1haWwuZ21haWwuY29tPgk8MjAxMDA3MjMxNDUzNDIuNWU0OTJhOWIuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pgk8RjE5NjI2NDZEM0I2NDY0MkI3QzlBMDYwNjhFRTFFNjQwREVCRURCQUBleDEwLmhvc3RlZGV4Y2hhbmdlLmxvY2FsPgk8MjAxMDA3MjMxNjM1MjYuY2NjNjA4ZTMuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pg=="},"prevInTopic":15974,"nextInTopic":15992,"prevInTime":15977,"nextInTime":15979,"topicId":15848,"numMessagesInTopic":79,"msgSnippet":"I ll tie this post into REST, but first... ... Like jam bands? http://www.rhythmdevils.net/ Don t miss this! Wow!  Iko Iko, Fire on the Mountain, In the","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 83905 invoked from network); 25 Jul 2010 09:40:50 -0000\r\nX-Received: from unknown (66.196.94.105)\n  by m13.grp.re1.yahoo.com with QMQP; 25 Jul 2010 09:40:50 -0000\r\nX-Received: from unknown (HELO mxout-08.mxes.net) (216.86.168.183)\n  by mta1.grp.re1.yahoo.com with SMTP; 25 Jul 2010 09:40:50 -0000\r\nX-Received: from bigbison (unknown [65.117.211.162])\n\t(using TLSv1 with cipher DHE-RSA-AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\tby smtp.mxes.net (Postfix) with ESMTPSA id D060A509B4;\n\tSun, 25 Jul 2010 05:40:47 -0400 (EDT)\r\nDate: Sun, 25 Jul 2010 03:40:22 -0600\r\nTo: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nCc: &quot;Robert Brewer&quot; &lt;fumanchu@...&gt;, &quot;Giacomo Tesio&quot;\n &lt;giacomo@...&gt;, &lt;rest-discuss@yahoogroups.com&gt;\r\nMessage-Id: &lt;20100725034022.d86f903e.eric@...&gt;\r\nIn-Reply-To: &lt;20100723163526.ccc608e3.eric@...&gt;\r\nReferences: &lt;AANLkTimp8hjVf-CAKUPE4_9FGQbjopqiXi1qwhPeJCyv@...&gt;\n\t&lt;AANLkTindMbBgBKeDhLJXgyfJmY_6cUQn6E6iPNejG3Ih@...&gt;\n\t&lt;20100720120914.abf90d6e.eric@...&gt;\n\t&lt;AANLkTilDo6IkA3zm0XdovuZb3iEY2y_x61kPk36L2qFV@...&gt;\n\t&lt;20100720233837.e62bec27.eric@...&gt;\n\t&lt;AANLkTimLvz1aT_vphP9RZkDDwrgI4mZrmY1ZkwrKV8vt@...&gt;\n\t&lt;7581AB6A-E6B1-426B-A449-0996249C564C@...&gt;\n\t&lt;AANLkTilIczfKHzTWJuf4_4qqgA8IZIvlc_zGlND6BbEJ@...&gt;\n\t&lt;20100721125235.f89a2a0b.eric@...&gt;\n\t&lt;AANLkTimGLmk8BaCG8MMXQ1HV_rTEjHmjItJSedGi1U3d@...&gt;\n\t&lt;20100721153533.f4a5c79d.eric@...&gt;\n\t&lt;AANLkTimprZ2xB4S5RBPoubcooyz50vqIKYDCHAXMJ_kz@...&gt;\n\t&lt;20100722155027.79b68fb5.eric@...&gt;\n\t&lt;AANLkTik=zo2gjrZjgvQPZ7BJ7n9yLsYLbb32Le+5cGxq@...&gt;\n\t&lt;20100723145342.5e492a9b.eric@...&gt;\n\t&lt;F1962646D3B64642B7C9A06068EE1E640DEBEDBA@...&gt;\n\t&lt;20100723163526.ccc608e3.eric@...&gt;\r\nOrganization: Bison Systems Corporation\r\nX-Mailer: Sylpheed 3.0.3 (GTK+ 2.10.14; i686-pc-mingw32)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nSubject: Re: [rest-discuss] WADL as an hypertext\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nI&#39;ll tie this post into REST, but first...\n\n&gt;\n&gt; it&#39;s time for the free concert over in Steamboat -- Rhythm Devils\n&gt; featuring Keller Williams.\n&gt; \n\nLike jam bands?\n\nhttp://www.rhythmdevils.net/\n\nDon&#39;t miss this!\n\nWow!  Iko Iko, Fire on the Mountain, In the Midnight Hour... wrapped up\nwith a beautiful sunset/Venus-and-moonrise, temp 78-72F (I&#39;m sorry, is\nit hot where you are?), the highlight of the summer for everyone there.\nI heard lots of folks say it was the best of the 20-year-old free summer\nconcert series -- and we&#39;ve seen some doozies from the likes of Big\nHead Todd, War, Little Feat, Karl Denson, Susan Tedeschi, Bela Fleck,\nJohn Hiatt, Nitty Gritty Dirt Band, Keb Mo, String Cheese Incident\n(their paid shows -- Blues Traveler opened -- at the ski area still\nstand as the best live music we&#39;ve ever had here), list goes on...\n\nThe crowd is almost all locals, everyone brings their kids of all ages,\nthere&#39;s beer and food, anyone you don&#39;t know turns out to know someone\nyou&#39;re with, one County Commissioner was there dancing two years after\nher double knee replacement, all us geezers were wearing vintage tie-dye\nfrom our Deadhead days...  The idea behind the free concerts is to give\nsomething back to the workers who are responsible for Steamboat&#39;s\ntourist-friendly reputation, and just be a fun party for the whole\ncommunity.  Summer just doesn&#39;t get any better than seeing an awesome\nconcert, free, in such an atmosphere.  IMNSHO.  But this doesn&#39;t bias\nmy review of the music.  I&#39;m exhausted and my voice is still shot a day\nlater.\n\nHowelsen Hill amphiteatre is the out-run of the century-old nordic ski\njumping facility built into the hill -- this really reverbs the bass\nback to the audience, and the naturally-good sound always amps up\nwhoever plays there on our tiny little stage.  Tapers were there, when\nthis show winds up online it&#39;s worth a listen.  I know half the people\nresponsible for the concert series, so getting backstage after was\neasy (OK, even if you didn&#39;t have connections).  I wanted to meet Mickey\nand Billy (I saw some mediocre Dead shows, but those two were always on\nfire) but didn&#39;t, so we hung with Keller for a while (used to play the\nbars here so much he&#39;s an honorary local, like SCI, this was back when\nI was a local ISP cranking out interactive session-less websites).\n\nWe met Davey, the 23-yr-old guitar prodigy (I don&#39;t use the term\nlightly) who sings like Gregg Allman and plays like Jerry Garcia.\nDavey&#39;s a hard guy to talk to, mainly because of all the (mostly\nunderage) hottie girls who kept interrupting us to get their picture\ntaken with him!  They didn&#39;t even notice Keller.  Andy the bass\nplayer was really razzing Davey about his &quot;groupie problem,&quot; which was\nfunny. I liked Davey -- he played 8 or 9 of his 12 touring guitars, and\none mandolin, over the course of the evening, used the slide some.\n\nI&#39;ve seen Keller&#39;s one-man show over a dozen times, and once with SCI.\nI went up to him, re-introduced myself, reminded him we&#39;d hung out\nafter-hours in certain Steamboat Springs watering holes which no longer\nexist, at which point he sorta-recognized me.  Then I complimented him\non the show, and congratulated him for landing the tour gig.  Then I\nasked him if he learned all he needed to know about improvisational\njamming from SCI, or if Mickey and Billy are taking him to school (they\nare).  I just treat these folks like regular people -- I&#39;d never walk up\nto a total stranger in the middle of a conversation, interrupt to ask to\nhave my picture taken, then leave as suddenly as I came.  Famous or not.\n\nBut we were interrupted twice by dudes who wanted their picture taken\nwith him (the new autograph).  I just wanted to tell them to chill, I\ndon&#39;t know Keller any more than they do (well, a little), we&#39;re having\nan interesting conversation so just hang, listen, and try to think of\nsomething intelligent to say -- *then* ask for the photo, if you must.\nSo no, I have no photographic proof to post of this encounter (I don&#39;t\neven own a mobile phone) despite having actually had conversations with\nthese people.  As to those other folks, what&#39;s the point of having a\nphoto of yourself with someone you&#39;ve never actually met?\n\nKinda like, what&#39;s the point of calling an API REST, when it doesn&#39;t\nexhibit the properties of a REST system?  My point here is not to say\nthat taking REST advice from me is like taking financial advice from\nLenny Dykstra.  But I am a college-dropout Deadhead ski-bum entrepreneur\nwith no formal training in this field, or corporate experience -- and\nthis *does* bias my vision of how REST should be applied.  So I don&#39;t\ncare if people take my advice or leave it.  But don&#39;t get upset if it\ndoesn&#39;t fit your preconceptions of what enterprises (particularly your\nown) need.\n\nJust don&#39;t insist, or try to get me to say, that what I say is REST/NOT\nREST is only my *opinion*, because I believe REST to be hard science.\nMy assertions aren&#39;t always right, I recognize this, and am always\nready to be proven wrong.  But you&#39;ll really piss me off if, instead of\nrational argument of the merits of a position in the language of\nscience, you resort to insisting that I&#39;m expressing an opinion or\naccusing me of purism, ideology, or religious devotion -- since by\navoiding debate in the language of science *you&#39;re* the one who&#39;s\ntrying to make it an ideological debate of opinions.  Which is NOT REST.\n\nI&#39;m interested in the simplest solution to a problem, which means not\nforcing REST to be the answer, and coming up with the simplest RESTful\nsolution I can to problems that are best solved by REST.  Since there&#39;s\nalways more than one RESTful solution to any such problem, my way may\nnot always be the best way, but one thing it will be at this point in\nmy experience, is RESTful, because it is hard science and once anyone\nlearns it as such they will also have that level of confidence (not\narrogance) in their work.\n\nI kept my Web development lazy-Deadhead simple, never following the\ncorporate crowd into the SOA pit.  I will never have a service-centric\nvision of REST because I never bought into the idea of service\norientation (my philosophy is &#39;services as supplement&#39;).  Now that the\ncorporate crowd is climbing back out of the SOA pit, they&#39;re bringing\nthe filth with them (so to speak ;-), meaning that most of what&#39;s\nwritten about REST is written by SOA folks for SOA folks, and REST is\nincreasingly being discussed in terms of SOA, as if it&#39;s an evolution\nof SOA.  Thus, the obsession with IDLs like WADL...\n\nhttp://roy.gbiv.com/untangled/2008/rest-apis-must-be-hypertext-driven#comment-746\n\nOthers have noticed this as well, although perhaps have not put it in\nas blunt of terms as I use.  I&#39;ve seen &quot;RESTful Web Services&quot; described\nas REST&#39;s &quot;New Testament&quot; and Roy&#39;s thesis as the &quot;Old Testament&quot;.  I\nbelieve Roy was right all along, which I guess puts me squarely in the\n&quot;Old Testament&quot; camp, in that I believe systems should be conceived as\nhypertext APIs rather than as services bound to business rules.  I see\nSOA as an evolutionary dead end, so I refuse to discuss REST in those\nterms.  I don&#39;t change my views of REST based on whether a system is\n&quot;enterprise&quot; or not, any more than I change my behavior towards others\nbased on whether they&#39;re famous or not.\n\nNow, don&#39;t get me wrong.  I recommend &quot;RESTful Web Services,&quot; just not\nas the be-all end-all reference to REST.  Not enough emphasis on the\nhypertext constraint, which is unfortunate because it plays right to\nthe crowd who want to re-serialize SOA systems as ROA systems, instead\nof re-thinking their entire approach in terms of the hypertext\ncapabilities of a common &quot;client domain&quot; (to use Andrew&#39;s term) and\ntaking things from there.\n\nThe biggest clash between Old Testament and New right now, seems to be\nthe issue of media type proliferation.  On that point, please refer to:\n\nhttp://roy.gbiv.com/untangled/2008/paper-tigers-and-hidden-dragons\n\nNotice that Roy&#39;s solution to the problem space is a sparse-bit array.\nInstead of creating a new media type, Roy&#39;s thought process is to\nconsider what ubiquitous media type may be repurposed to this need.\nHis choice is image/gif.  That&#39;s so REST!\n\nIn fact, that&#39;s so REST it&#39;s just hard for folks to accept it.  Once\nyou have, REST becomes much easier to learn.  Hard science, yeah, but\nthere&#39;s a Zen to it that goes against everything you ever thought you\nknew about distributed software architecture.  More than anything else,\nit&#39;s the Zen aspect of the science of REST that makes it so hard to\nteach.\n\nSometimes a fact must be accepted as a fact, and its understanding left\nfor later, as the purpose won&#39;t otherwise become obvious.  Since REST\nis a real-world proven goal, is this any harder of a way to learn, than\ngoing some other direction where the goal is an unknown that isn&#39;t real-\nworld proven?  Once folks *have* gotten there, they&#39;re on their own to\nfigure out how to show anyone else the way -- like where to say &quot;this\nis a fact&quot; and &quot;just trust me on this for now&quot;.  That&#39;s just how it is.\n\nIf you don&#39;t trust my judgment on these issues I have no real guidance\non, then just don&#39;t listen to me, and please don&#39;t challenge me on\nthese issues with who-accredited-me-to-teach crap and such, and this\ngoes for anyone trying to teach REST, not just me.  Find someone who&#39;s\nteaching style is more to your liking to ask questions of, and try not\nto drive the others batshit crazy arguing their shortcomings from your\nperspective, particularly if you&#39;re so new to this that such perspective\nis uninformed.\n\nAnyone trying to teach REST is also by definition learning how to teach\nREST, as a result both are becoming easier over time.  I envy those\njust starting with REST now, because they&#39;ll be as capable as I am with\nit in a fraction of the number of years it took me.  The resources and\ntechnologies we have today, and the number of folks who have advanced\nto a high level of knowledge on this list and are willing to offer help,\nsimply didn&#39;t exist even a few years ago.\n\nI can&#39;t claim to have learned REST -- it&#39;s my specialty, but it&#39;s also\nevolving steadily enough that I&#39;ll probably always be learning more\nabout it.  There are different approaches to REST, but there are no\nalternate interpretations of it.  There are alternate interpretations\nof everything else that passes for an architectural style on the Web,\nfrom CORBA to SOA and everything in between, but the difference is that\nall the others are buzzwords -- only REST is a proven model.  So while\nyou can call just about anything SOA, that degree of flexibility just\nisn&#39;t there with REST.\n\nIt isn&#39;t about a secret handshake, it&#39;s about having exhibited that you\nnot only grasp the constraints, but the reasons they&#39;re inviolable and\ninterdependent.  Like a good Dead show with the band (plus anyone\nsitting in) firing on all cylinders, the interdependence of the members\nyields a result that&#39;s greater than the sum of its parts, that you\ncan&#39;t get from any ensemble playing the same notes written as sheet\nmusic.  Lightning.  REST is bottled lightning, releasing it relies on\nthe interdependence of all its constraints.  Not loopholing your way\ninto being able to say, &quot;Well, technically we aren&#39;t violating any\nconstraints, CoD you see...&quot; but I&#39;ll get to that in another post.\n\nI have the patience to teach REST, but only to those with the patience\nto learn REST.  I could make a fine turkey-hunting analogy here,\nomitted for brevity.  ;-)\n\nA REST system may become so complex for the sake of being REST, that it\nviolates no constraints, yet fails to rise above the noodling mediocrity\ntoo many Dead shows descended into, where the band just never got into\nthe groove, yet without sucking either.  In my *opinion*, this is the\nbest-case scenario when SOA is re-factored into ROA, instead of being\nre-envisioned as a hypertext system.\n\nTake away a constraint from REST, and the result is a free-form\narchitectural style that isn&#39;t based on a proven, successful model.\nLike the Dead without Jerry -- would you really expect it to scale?  :-)\nMaybe that&#39;s why they turned down Carlos Santana&#39;s offer and ended it.\n\n-Eric\n\n&lt;playlist status=&#39;current&#39; rotation=&#39;heavy&#39; artist=&#39;Grateful Dead&#39; href=\n&#39;http://www.archive.org/details/gd1992-05-31.sbd.miller.87281.sbeok.flac16&#39;&gt;\nLas Vegas, June 31 1992, with Steve Miller&lt;/playlist&gt;\n\n"}}