{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"Hb47ezeMz7w-yU2SJpNDrrkRA6v8sDzv7OOr_LZ_q334X_eq7S-1Iffkwd_duN6cv90m9AcLdO5-UgGEq3KbEzWDpwh5BgB7Wudr-KIbiw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] Re: REST, HTTP, Web, Internet [was Atom feed vs. list of orders]","postDate":"1283922327","msgId":16477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTAwOTA3MjMwNTI3LmU0NDEyZTNiLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","inReplyToHeader":"PDRDODY2QjA1LjEwNjA3MDZAdGliY28uY29tPg==","referencesHeader":"PGk2NWxzMCs3YzNqQGVHcm91cHMuY29tPgk8NEM4NjZCMDUuMTA2MDcwNkB0aWJjby5jb20+"},"prevInTopic":16476,"nextInTopic":16478,"prevInTime":16476,"nextInTime":16478,"topicId":16269,"numMessagesInTopic":139,"msgSnippet":"... No, there is no requirement that a media type be self-describing.  REST has a self-descriptive *messaging* constraint. ... IANA is not a standards body,","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 48457 invoked from network); 8 Sep 2010 05:05:24 -0000\r\nX-Received: from unknown (66.196.94.107)\n  by m13.grp.re1.yahoo.com with QMQP; 8 Sep 2010 05:05:24 -0000\r\nX-Received: from unknown (HELO mxout-08.mxes.net) (216.86.168.183)\n  by mta3.grp.re1.yahoo.com with SMTP; 8 Sep 2010 05:05:24 -0000\r\nX-Received: from bigbison (unknown [65.117.211.162])\n\t(using TLSv1 with cipher DHE-RSA-AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\tby smtp.mxes.net (Postfix) with ESMTPSA id E0FC7509DD;\n\tWed,  8 Sep 2010 01:05:23 -0400 (EDT)\r\nDate: Tue, 7 Sep 2010 23:05:27 -0600\r\nTo: Eric Johnson &lt;eric@...&gt;\r\nCc: omarshariffdontlikeit &lt;omarshariffdontlikeit@...&gt;,\n rest-discuss@yahoogroups.com\r\nMessage-Id: &lt;20100907230527.e4412e3b.eric@...&gt;\r\nIn-Reply-To: &lt;4C866B05.1060706@...&gt;\r\nReferences: &lt;i65ls0+7c3j@...&gt;\n\t&lt;4C866B05.1060706@...&gt;\r\nOrganization: Bison Systems Corporation\r\nX-Mailer: Sylpheed 3.0.3 (GTK+ 2.10.14; i686-pc-mingw32)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nSubject: Re: [rest-discuss] Re: REST, HTTP, Web, Internet [was Atom feed vs.\n list of orders]\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nEric Johnson wrote:\n&gt; \n&gt; So far as I understand from the premise of REST, a media type has to\n&gt; be self-describing.\n&gt;\n\nNo, there is no requirement that a media type be self-describing.  REST\nhas a self-descriptive *messaging* constraint.\n\n&gt;\n&gt; IANA registration is neither necessary, nor sufficient to be\n&gt; self-describing.  And if by &quot;standardized&quot;, you mean IANA\n&gt; registration, that&#39;s a very narrow view of standards, given that\n&gt; there are many standards organizations in the world.\n&gt; \n\nIANA is not a standards body, it&#39;s a registry, which recognizes\nstandards published by any entity that claims to be a standards body.\nOn the Web, IANA registration is absolutely a requirement -- how can\nyou square your claim that it isn&#39;t with Roy&#39;s clear definition of the\nterm?\n\n&quot;Self-descriptive means that the type is registered and the registry\npoints to a specification and the specification explains how to process\nthe data according to its intent.&quot;\n\nCan that *be* any more clear?  Is there some alternate registry for the\nWeb that I&#39;m not aware of?  If your media type isn&#39;t registered, and\nyou&#39;re sending it over the Web, you&#39;re not even _attempting_ to be\nRESTful.\n\n&gt;\n&gt; To the &quot;sufficient&quot; question: if I have a document that I return as\n&gt; XML (application/xml), what really matters to the consumer of that\n&gt; document - can I associate a schema with the document?\n&gt;\n\nThat doesn&#39;t make your messaging self-descriptive, because you&#39;re\nrequiring introspection to determine the nature of the document.  I\nneed to know the nature of the data by looking at the headers, not\n(perhaps) unzipping your content and sniffing it first -- application/\nxml is *not* self-descriptive, as has been (correctly) pointed out on\nthis list a hundred times...\n\n&gt;\n&gt; If it isn&#39;t, even though the media type in use is well-defined and\n&gt; registered with IANA, absent some form of schema (DTD, XML Schema,\n&gt; RelaxNG), the client I wrote really cannot assume that the meanings\n&gt; are the same.\n&gt; \n\nNo, self-descriptiveness does not require introspection of the content\nto determine its processing model, it&#39;s dependent on registered media\ntype identifiers.  If I send XHTML as text/plain, you need to treat it\nas text/plain, not introspect it and determine that its schema means it\nshould be treated as XHTML -- that&#39;s sniffing, and sniffing has nothing\nto do with REST.\n\n&gt; \n&gt; As to the necessary question:  Was the &quot;Atom&quot; specification any less\n&gt; valid and self-describing the day before it was registered with IANA\n&gt; than it was the day after?  It was self-describing before and after.\n&gt; \n\nNo, it was not.  Identifiers that aren&#39;t listed in *any* registry can&#39;t\n*possibly* meet Roy&#39;s definition of self-descriptiveness:\n\n&quot;Self-descriptive means that the type is registered and the registry\npoints to a specification and the specification explains how to process\nthe data according to its intent.&quot;\n\nBefore Atom&#39;s identifier was registered in IANA, it was registered...\nwhere?  If the identifier isn&#39;t in a registry, then it can&#39;t point to a\nspecification, so it can&#39;t *possibly* meet Roy&#39;s definition.\n\n&gt;\n&gt; The internet has few baked in central control points - DNS might be\n&gt; the only one, really - even with respect to REST, we have a\n&gt; combination of standards organizations including the IETF, W3C, IANA,\n&gt; and OASIS that all contribute &quot;standards&quot; to help the web form.\n&gt;\n\nNone of which aren&#39;t recognized by the IANA registry, which is a\nregistry, not a standards body.  Merely a means to point identifiers to\ndescriptive documents, published by *any* entity that claims to be\nreleasing a &quot;standard&quot; by the entity&#39;s own (and not IANA&#39;s) definition.\nCould the bar *be* any lower?\n\n&gt;\n&gt; If China, with its hundreds of millions of internet users, decides\n&gt; that it can&#39;t be bothered to register a media type with IANA, yet it\n&gt; could easily be that *every* relevant Chinese client of that\n&gt; media-type might readily understand it.  That sounds like a feature\n&gt; of the internet, not a bug.\n&gt; \n\nI have no problem with that.  However, in _reality_ there is no\nalternate registry to IANA, not here, not in China, not anywhere on the\nplanet.  So discussions about theoretical alternatives to IANA are just\nthat -- theoretical.  On the Web, today, there exists only the IANA\nregistry, therefore there is no other means to meet Roy&#39;s requirement:\n\n&quot;Self-descriptive means that the type is registered and the registry\npoints to a specification and the specification explains how to process\nthe data according to its intent.&quot;\n\nSure, if the Chinese alternative to IANA comes along, it would be a\nlegitimate registry for meeting the self-descriptiveness constraint.\nBut, here&#39;s a list of *actual* registries which *exist* today on the\nWeb:\n\nIANA\n\nSure, alternatives are possible, but pragmatically, that&#39;s _all_ there\nis.  Even if there were some other registry, the wording of RFC 2616\nwould still &quot;discourage&quot; its use.\n\n&gt;\n&gt; I also like to think that REST make sense to think about in the\n&gt; context of enterprise software.  So to me, the question is,\n&gt; &quot;self-describing, but for what scope?&quot;  Maybe this is a small scope,\n&gt; such as the software my company writes, and all of our customers.\n&gt; Yet, my company can then get the benefits of following a RESTful\n&gt; architecture.\n&gt; \n\nIf you&#39;re sending HTTP over the Internet, then potential participants\nin the communication include folks beyond your or your partners&#39;\norganizational boundary.  If your identifier is opaque, then these\nintermediaries can&#39;t be participants, but merely dumb routers, which is\nthe result we&#39;re presumably trying to avoid by using REST in the first\nplace.\n\n&gt;\n&gt; &gt; Now, can anyone come back with a solid, convincing argument that\n&gt; &gt; this is not the case?\n&gt; &gt;\n&gt; \n&gt; Hopefully, the above did that.\n&gt;\n\nNot even close.  You&#39;ve failed to do anything but speculate that maybe\nsome alternative registry will emerge.  A valid point, but moot, since\nno such alternative _has_ emerged.  Therefore, in order to meet Roy&#39;s\nrequirement for self-descriptiveness:\n\n&quot;Self-descriptive means that the type is registered and the registry\npoints to a specification and the specification explains how to process\nthe data according to its intent.&quot;\n\nThere exist, on the Web, exactly ZERO legitimate alternatives to the\nIANA registry, in practice.  Where else are media type identifiers\nregistered for anyone to look up their associated standards?  Nowhere,\nseverely restricting the options for meeting the constraint, in\npractice.\n\n&gt;\n&gt; To that end, I see REST as an aspirational endpoint.\n&gt;\n\nI say that myself, all the time.  However:\n\n&gt;\n&gt; I&#39;m not going to deny fellow architects the label of &quot;REST&quot; if, for\n&gt; example, they got everything right, but used a few non-standard-IANA-\n&gt; registered media-types for a few small portions of their application.\n&gt; \n\nIf there&#39;s no intent to standardize a type or register an identifier,\nthen there&#39;s no effort being made at self-descriptiveness.  This isn&#39;t\njust a mismatch, this is actively thwarting the goals of REST.  Using\nan unregistered identifier for an unstandardized type is only congruous\nwith REST if there is an intent to change that situation -- what I&#39;m\narguing against here is the refusal to admit there&#39;s even a problem.\n\n&gt; \n&gt; Some pages have links to other pages, and some pages might be\n&gt; endpoints (with merely incidental links, like &quot;back&quot;).  I suggest\n&gt; that in a RESTful world, the pages that link to other pages should\n&gt; strongly favor standardized (and registered) media types.  When you\n&gt; get to the &quot;endpoint&quot; pages that don&#39;t contribute to the hypertext\n&gt; state of an application (PDF, Flash, video), then the media type is\n&gt; much more wide open, and it should be.\n&gt; \n\nNo, REST says nothing about self-descriptiveness being optional, or\nmore important / less important based on resource type.  Self-\ndescriptive messaging is a constraint, and those who choose to ignore\nthis _fact_ simply are not following the REST style, and should not\ncall their results REST.  I am opposed to attaching the REST label\nwhere no effort is being made to follow the style.\n\n&gt; \n&gt; Of course, any good developer should reuse what is already available,\n&gt; and appropriate.  On the other hand, given a hammer, don&#39;t turn\n&gt; everything into a nail.  Figuring out when to make a new media type,\n&gt; and when to reuse an existing one might actually be an extremely\n&gt; difficult call.\n&gt; \n\n100% agreed.  My argument is against the cavalier usage of unregistered,\nunstandardized types without any mention whatsoever, and outright\ndenial of the existence, of any constraint issues or tradeoffs\nassociated with the practice.  The bar to registering an identifier is\npurposefully low, yet folks act like it&#39;s an insurmountable obstacle,\nthen pretend it isn&#39;t required.  NOT REST!\n\n-Eric\n\n"}}