{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":86585728,"authorName":"Eric Johnson","from":"Eric Johnson &lt;eric@...&gt;","profile":"eric_at_tibco","replyTo":"SENDER","senderId":"G37K-RhtbkLSFkBhRLKijVEG6GRzc_fbePDt5e3AVoa_fXANygV8CdMhJpuQg7FiOoQlIAl4moEhidmv5ie46TUCfIA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Re: REST, HTTP, Web, Internet [was Atom feed vs. list of orders]","postDate":"1283877637","msgId":16470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDODY2QjA1LjEwNjA3MDZAdGliY28uY29tPg==","inReplyToHeader":"PGk2NWxzMCs3YzNqQGVHcm91cHMuY29tPg==","referencesHeader":"PGk2NWxzMCs3YzNqQGVHcm91cHMuY29tPg=="},"prevInTopic":16469,"nextInTopic":16471,"prevInTime":16469,"nextInTime":16471,"topicId":16269,"numMessagesInTopic":139,"msgSnippet":"... So far as I understand from the premise of REST, a media type has to be self-describing.  IANA registration is neither necessary, nor sufficient to be","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 31226 invoked from network); 7 Sep 2010 16:40:01 -0000\r\nX-Received: from unknown (66.196.94.106)\n  by m12.grp.re1.yahoo.com with QMQP; 7 Sep 2010 16:40:01 -0000\r\nX-Received: from unknown (HELO mx1-app.tibco.com) (63.100.100.142)\n  by mta2.grp.re1.yahoo.com with SMTP; 7 Sep 2010 16:40:01 -0000\r\nX-IronPort-AV: E=Sophos;i=&quot;4.56,329,1280732400&quot;; \n   d=&quot;scan&#39;208,217&quot;;a=&quot;15853785&quot;\r\nX-Received: from tibco-5.tibco.com (HELO na-pa-fe02.na.tibco.com) ([63.100.100.5])\n  by mx1-app.tibco.com with ESMTP; 07 Sep 2010 09:40:01 -0700\r\nX-Received: from koosh.na.tibco.com ([10.98.32.55]) by na-pa-fe02.na.tibco.com with Microsoft SMTPSVC(6.0.3790.3959);\n\t Tue, 7 Sep 2010 09:40:00 -0700\r\nMessage-ID: &lt;4C866B05.1060706@...&gt;\r\nDate: Tue, 07 Sep 2010 09:40:37 -0700\r\nUser-Agent: Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.9.2.7) Gecko/20100726 Thunderbird/3.1.1\r\nMIME-Version: 1.0\r\nTo: omarshariffdontlikeit &lt;omarshariffdontlikeit@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nReferences: &lt;i65ls0+7c3j@...&gt;\r\nIn-Reply-To: &lt;i65ls0+7c3j@...&gt;\r\nContent-Type: multipart/alternative;\n boundary=&quot;------------050303010005010005090102&quot;\r\nReturn-Path: eric@...\r\nX-OriginalArrivalTime: 07 Sep 2010 16:40:00.0284 (UTC) FILETIME=[503E85C0:01CB4EAB]\r\nX-TM-AS-Product-Ver: SMEX-10.0.0.1412-6.500.1024-17622.000\r\nX-TM-AS-Result: No--42.419400-8.000000-31\r\nX-TM-AS-User-Approved-Sender: No\r\nX-TM-AS-User-Blocked-Sender: No\r\nFrom: Eric Johnson &lt;eric@...&gt;\r\nSubject: Re: [rest-discuss] Re: REST, HTTP, Web, Internet [was Atom feed vs.\n list of orders]\r\nX-Yahoo-Group-Post: member; u=86585728; y=57wr8shRRJ-k7XLOihqI0yH25iDA5r3thqxhCLZdqcSRoUVHwEr20g\r\nX-Yahoo-Profile: eric_at_tibco\r\n\r\n\r\n--------------050303010005010005090102\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\n\r\n\nOn 09/07/2010 08:31 AM, omarshariffdontlikeit wrote:  \n&gt;\n&gt; From Eric&#39;s argument, the standard media types constraint of ReST is\n&gt; fullfilled, over HTTP, by registering new media types with IANA. In\n&gt; the context of HTTP, this is what a standardized media type is.\n&gt;\n\nSo far as I understand from the premise of REST, a media type has to be\nself-describing.  IANA registration is neither necessary, nor sufficient\nto be self-describing.  And if by &quot;standardized&quot;, you mean IANA\nregistration, that&#39;s a very narrow view of standards, given that there\nare many standards organizations in the world.\n\nTo the &quot;sufficient&quot; question: if I have a document that I return as XML\n(application/xml), what really matters to the consumer of that document\n- can I associate a schema with the document?  If it isn&#39;t, even though\nthe media type in use is well-defined and registered with IANA, absent\nsome form of schema (DTD, XML Schema, RelaxNG), the client I wrote\nreally cannot assume that the meanings are the same.\n\nLikewise, a standard HTML-based web application, if it happens to use\nwhat are informally called &quot;web 2.0&quot; techniques - code on demand via\nlots of Javascript, then at some point you cross the bounds from being a\nwonderfully RESTful application to something slightly different -\nbecause the reliance on the code makes it difficult for non-web-browser\nclients to make serendipitous use of the same data.  Again, I might be\nusing all standard media types, but that doesn&#39;t mean I get REST.\n\nAs to the necessary question:  Was the &quot;Atom&quot; specification any less\nvalid and self-describing the day before it was registered with IANA\nthan it was the day after?  It was self-describing before and after.\n\nThe internet has few baked in central control points - DNS might be the\nonly one, really - even with respect to REST, we have a combination of\nstandards organizations including the IETF, W3C, IANA, and OASIS that\nall contribute &quot;standards&quot; to help the web form.  If China, with its\nhundreds of millions of internet users, decides that it can&#39;t be\nbothered to register a media type with IANA, yet it could easily be that\n*every* relevant Chinese client of that media-type might readily\nunderstand it.  That sounds like a feature of the internet, not a bug.\n\nI also like to think that REST make sense to think about in the context\nof enterprise software.  So to me, the question is, &quot;self-describing,\nbut for what scope?&quot;  Maybe this is a small scope, such as the software\nmy company writes, and all of our customers.  Yet, my company can then\nget the benefits of following a RESTful architecture.\n\n&gt;\n&gt; Now, can anyone come back with a solid, convincing argument that this\n&gt; is not the case?\n&gt;\n\nHopefully, the above did that.  I&#39;d also like to point out that there&#39;s\na wide gulf between the architectural style of REST, the architecture of\nan application, the design of the application, and finally, the actual\nimplementation.  As someone who is far to the architectural side of the\nchasm, I&#39;m more than happy to let the implementation stray a little bit\nfrom architectural and design purity, particularly if it means that the\napplication ships and people get to benefit from it.  To that end, I see\nREST as an aspirational endpoint.  I&#39;m not going to deny fellow\narchitects the label of &quot;REST&quot; if, for example, they got everything\nright, but used a few non-standard-IANA-registered media-types for a few\nsmall portions of their application.  On the other hand, I will get\nannoyed with individual developers who can&#39;t be bothered to\nask/understand what they&#39;re being asked to do, and simply do what\nthey&#39;re used to.\n\nSome pages have links to other pages, and some pages might be endpoints\n(with merely incidental links, like &quot;back&quot;).  I suggest that in a\nRESTful world, the pages that link to other pages should strongly favor\nstandardized (and registered) media types.  When you get to the\n&quot;endpoint&quot; pages that don&#39;t contribute to the hypertext state of an\napplication (PDF, Flash, video), then the media type is much more wide\nopen, and it should be.\n\n&gt;\n&gt; Some of us have to explain ReST to less techy, or less patient, junior\n&gt; developers :)\n&gt;\n&gt; (For the record, I understand some of the backlash. Eric&#39;s argument\n&gt; style is... forceful :). And don&#39;t get me wrong, it would make my life\n&gt; easier as a developer NOT to have to register my mime types with IANA,\n&gt; but, from Eric&#39;s arguments, he makes a very persueasive case of the\n&gt; benefits of doing so, of which, only one (fullfilling standardized\n&gt; media types constaint of ReST) is ReST based.)\n&gt;\n\nOf course, any good developer should reuse what is already available,\nand appropriate.  On the other hand, given a hammer, don&#39;t turn\neverything into a nail.  Figuring out when to make a new media type, and\nwhen to reuse an existing one might actually be an extremely difficult call.\n\nAnd in the end, the answer depends on your scope.\n\n-Eric.\n\n&gt;\n&gt; \n\r\n--------------050303010005010005090102\r\nContent-Type: text/html; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;&gt;\n&lt;html&gt;\n  &lt;head&gt;\n    &lt;meta content=&quot;text/html; charset=ISO-8859-1&quot;\n      http-equiv=&quot;Content-Type&quot;&gt;\n  &lt;/head&gt;\n  &lt;body text=&quot;#000000&quot; bgcolor=&quot;#ffffff&quot;&gt;\n    &lt;br&gt;\n    On 09/07/2010 08:31 AM, omarshariffdontlikeit wrote:\n    &lt;span style=&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n     &lt;br&gt;\n    &lt;blockquote cite=&quot;mid:i65ls0+7c3j@...&quot; type=&quot;cite&quot;&gt;\n      &lt;div id=&quot;ygrp-mlmsg&quot; style=&quot;position: relative;&quot;&gt;\n        &lt;div id=&quot;ygrp-msg&quot; style=&quot;z-index: 1;&quot;&gt;\n          &lt;div id=&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;\n              From Eric&#39;s argument, the standard media types constraint\n              of ReST is fullfilled, over HTTP, by registering new media\n              types with IANA. In the context of HTTP, this is what a\n              standardized media type is.&lt;br&gt;\n            &lt;/p&gt;\n          &lt;/div&gt;\n        &lt;/div&gt;\n      &lt;/div&gt;\n    &lt;/blockquote&gt;\n    &lt;br&gt;\n    So far as I understand from the premise of REST, a media type has to\n    be self-describing.&nbsp; IANA registration is neither necessary, nor\n    sufficient to be self-describing.&nbsp; And if by &quot;standardized&quot;, you\n    mean IANA registration, that&#39;s a very narrow view of standards,\n    given that there are many standards organizations in the world.&lt;br&gt;\n    &lt;br&gt;\n    To the &quot;sufficient&quot; question: if I have a document that I return as\n    XML (application/xml), what really matters to the consumer of that\n    document - can I associate a schema with the document?&nbsp; If it isn&#39;t,\n    even though the media type in use is well-defined and registered\n    with IANA, absent some form of schema (DTD, XML Schema, RelaxNG),\n    the client I wrote really cannot assume that the meanings are the\n    same.&lt;br&gt;\n    &lt;br&gt;\n    Likewise, a standard HTML-based web application, if it happens to\n    use what are informally called &quot;web 2.0&quot; techniques - code on demand\n    via lots of Javascript, then at some point you cross the bounds from\n    being a wonderfully RESTful application to something slightly\n    different - because the reliance on the code makes it difficult for\n    non-web-browser clients to make serendipitous use of the same data.&nbsp;\n    Again, I might be using all standard media types, but that doesn&#39;t\n    mean I get REST.&lt;br&gt;\n    &lt;br&gt;\n    As to the necessary question:&nbsp; Was the &quot;Atom&quot; specification any less\n    valid and self-describing the day before it was registered with IANA\n    than it was the day after?&nbsp; It was self-describing before and after.&lt;br&gt;\n    &lt;br&gt;\n    The internet has few baked in central control points - DNS might be\n    the only one, really - even with respect to REST, we have a\n    combination of standards organizations including the IETF, W3C,\n    IANA, and OASIS that all contribute &quot;standards&quot; to help the web\n    form.&nbsp; If China, with its hundreds of millions of internet users,\n    decides that it can&#39;t be bothered to register a media type with\n    IANA, yet it could easily be that *every* relevant Chinese client of\n    that media-type might readily understand it.&nbsp; That sounds like a\n    feature of the internet, not a bug.&lt;br&gt;\n    &lt;br&gt;\n    I also like to think that REST make sense to think about in the\n    context of enterprise software.&nbsp; So to me, the question is,\n    &quot;self-describing, but for what scope?&quot;&nbsp; Maybe this is a small scope,\n    such as the software my company writes, and all of our customers.&nbsp;\n    Yet, my company can then get the benefits of following a RESTful\n    architecture.&lt;br&gt;\n    &lt;br&gt;\n    &lt;blockquote cite=&quot;mid:i65ls0+7c3j@...&quot; type=&quot;cite&quot;&gt;\n      &lt;div id=&quot;ygrp-mlmsg&quot; style=&quot;position: relative;&quot;&gt;\n        &lt;div id=&quot;ygrp-msg&quot; style=&quot;z-index: 1;&quot;&gt;\n          &lt;div id=&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;\n              &lt;br&gt;\n              Now, can anyone come back with a solid, convincing\n              argument that this is not the case?&lt;br&gt;\n            &lt;/p&gt;\n          &lt;/div&gt;\n        &lt;/div&gt;\n      &lt;/div&gt;\n    &lt;/blockquote&gt;\n    &lt;br&gt;\n    Hopefully, the above did that.&nbsp; I&#39;d also like to point out that\n    there&#39;s a wide gulf between the architectural style of REST, the\n    architecture of an application, the design of the application, and\n    finally, the actual implementation.&nbsp; As someone who is far to the\n    architectural side of the chasm, I&#39;m more than happy to let the\n    implementation stray a little bit from architectural and design\n    purity, particularly if it means that the application ships and\n    people get to benefit from it.&nbsp; To that end, I see REST as an\n    aspirational endpoint.&nbsp; I&#39;m not going to deny fellow architects the\n    label of &quot;REST&quot; if, for example, they got everything right, but used\n    a few non-standard-IANA-registered media-types for a few small\n    portions of their application.&nbsp; On the other hand, I will get\n    annoyed with individual developers who can&#39;t be bothered to\n    ask/understand what they&#39;re being asked to do, and simply do what\n    they&#39;re used to.&lt;br&gt;\n    &lt;br&gt;\n    Some pages have links to other pages, and some pages might be\n    endpoints (with merely incidental links, like &quot;back&quot;).&nbsp; I suggest\n    that in a RESTful world, the pages that link to other pages should\n    strongly favor standardized (and registered) media types.&nbsp; When you\n    get to the &quot;endpoint&quot; pages that don&#39;t contribute to the hypertext\n    state of an application (PDF, Flash, video), then the media type is\n    much more wide open, and it should be.&lt;br&gt;\n    &lt;br&gt;\n    &lt;blockquote cite=&quot;mid:i65ls0+7c3j@...&quot; type=&quot;cite&quot;&gt;\n      &lt;div id=&quot;ygrp-mlmsg&quot; style=&quot;position: relative;&quot;&gt;\n        &lt;div id=&quot;ygrp-msg&quot; style=&quot;z-index: 1;&quot;&gt;\n          &lt;div id=&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;\n              &lt;br&gt;\n              Some of us have to explain ReST to less techy, or less\n              patient, junior developers :)&lt;br&gt;\n              &lt;br&gt;\n              (For the record, I understand some of the backlash. Eric&#39;s\n              argument style is... forceful :). And don&#39;t get me wrong,\n              it would make my life easier as a developer NOT to have to\n              register my mime types with IANA, but, from Eric&#39;s\n              arguments, he makes a very persueasive case of the\n              benefits of doing so, of which, only one (fullfilling\n              standardized media types constaint of ReST) is ReST\n              based.)&lt;br&gt;\n            &lt;/p&gt;\n          &lt;/div&gt;\n        &lt;/div&gt;\n      &lt;/div&gt;\n    &lt;/blockquote&gt;\n    &lt;br&gt;\n    Of course, any good developer should reuse what is already\n    available, and appropriate.&nbsp; On the other hand, given a hammer,\n    don&#39;t turn everything into a nail.&nbsp; Figuring out when to make a new\n    media type, and when to reuse an existing one might actually be an\n    extremely difficult call.&lt;br&gt;\n    &lt;br&gt;\n    And in the end, the answer depends on your scope.&lt;br&gt;\n    &lt;br&gt;\n    -Eric.&lt;br&gt;\n    &lt;br&gt;\n    &lt;blockquote cite=&quot;mid:i65ls0+7c3j@...&quot; type=&quot;cite&quot;&gt;\n      &lt;div id=&quot;ygrp-mlmsg&quot; style=&quot;position: relative;&quot;&gt;\n        &lt;div id=&quot;ygrp-msg&quot; style=&quot;z-index: 1;&quot;&gt;\n          &lt;div id=&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;\n              &lt;br&gt;\n            &lt;/p&gt;\n          &lt;/div&gt;\n          \n      \n      &lt;!-- end group email --&gt;\n    &lt;/blockquote&gt;\n  &lt;/body&gt;\n&lt;/html&gt;\n\r\n--------------050303010005010005090102--\r\n\n"}}