{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"o1E2gLTDh3jHhYtcTJQr0XrSf6rC2PogNthR8fBZYUUWndrgQSvtxffgeFPrGIltbXYgRmxUSLkw-GX8TZsjKWMNXOArrmI1JDwvnA6N3w","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [rest-discuss] Re: REST, HTTP, Web, Internet [was Atom feed vs. list of orders]","postDate":"1283977182","msgId":16499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTAwOTA4MTQxOTQyLjMyNDRmMDM4LmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","inReplyToHeader":"PEFBTkxrVGluMldwT0p2Sm52aDJTTHZ0X3FESjFRSkdMRzYybjNwQnEwZ1dRNkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDIwMTAwOTA3MDcyODE0LmUyZTgyMjJiLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4JPGk2NWxzMCs3YzNqQGVHcm91cHMuY29tPgk8QUFOTGtUaWtuRTZldndRc09hK3NkeFZLTXd6PVZScmVoZnJCUitXOUR4NDZDQG1haWwuZ21haWwuY29tPgk8QUFOTGtUaW5aWFBYQlUwaVMtV21tdVlmT1VZdEtHZXlZb3NkZEh1ZDdoPTVrQG1haWwuZ21haWwuY29tPgk8MjAxMDA5MDgwMDQ2MDUuMTRkN2JiOTkuZXJpY0BiaXNvbnN5c3RlbXMubmV0Pgk8QUFOTGtUaW4yV3BPSnZKbnZoMlNMdnRfcURKMVFKR0xHNjJuM3BCcTBnV1E2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":16498,"nextInTopic":16500,"prevInTime":16498,"nextInTime":16500,"topicId":16269,"numMessagesInTopic":139,"msgSnippet":"... Then how come, every time I suggest that HTML is a perfectly acceptable media type to use in REST, the responses come pouring in stating that such a view","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 79683 invoked from network); 8 Sep 2010 20:19:39 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m8.grp.sp2.yahoo.com with QMQP; 8 Sep 2010 20:19:39 -0000\r\nX-Received: from unknown (HELO mxout-08.mxes.net) (216.86.168.183)\n  by mta1.grp.sp2.yahoo.com with SMTP; 8 Sep 2010 20:19:39 -0000\r\nX-Received: from bigbison (unknown [65.117.211.162])\n\t(using TLSv1 with cipher DHE-RSA-AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\tby smtp.mxes.net (Postfix) with ESMTPSA id BBF25509B3;\n\tWed,  8 Sep 2010 16:19:38 -0400 (EDT)\r\nDate: Wed, 8 Sep 2010 14:19:42 -0600\r\nTo: Tim Williams &lt;williamstw@...&gt;\r\nCc: Bob Haugen &lt;bob.haugen@...&gt;, REST-Discuss Group Discussion\n &lt;rest-discuss@yahoogroups.com&gt;\r\nMessage-Id: &lt;20100908141942.3244f038.eric@...&gt;\r\nIn-Reply-To: &lt;AANLkTin2WpOJvJnvh2SLvt_qDJ1QJGLG62n3pBq0gWQ6@...&gt;\r\nReferences: &lt;20100907072814.e2e8222b.eric@...&gt;\n\t&lt;i65ls0+7c3j@...&gt;\n\t&lt;AANLkTiknE6evwQsOa+sdxVKMwz=VRrehfrBR+W9Dx46C@...&gt;\n\t&lt;AANLkTinZXPXBU0iS-WmmuYfOUYtKGeyYosddHud7h=5k@...&gt;\n\t&lt;20100908004605.14d7bb99.eric@...&gt;\n\t&lt;AANLkTin2WpOJvJnvh2SLvt_qDJ1QJGLG62n3pBq0gWQ6@...&gt;\r\nOrganization: Bison Systems Corporation\r\nX-Mailer: Sylpheed 3.0.3 (GTK+ 2.10.14; i686-pc-mingw32)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nSubject: Re: [rest-discuss] Re: REST, HTTP, Web, Internet [was Atom feed vs.\n list of orders]\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nTim Williams wrote:\n&gt; \n&gt; You keep saying things like &quot;encourage&quot; and &quot;cavalier&quot;, I think it&#39;s\n&gt; important to point out that most folks here would readily agree that\n&gt; the use of existing, registered Media Type specifications is\n&gt; encouraged and desirable.\n&gt;\n\nThen how come, every time I suggest that HTML is a perfectly acceptable\nmedia type to use in REST, the responses come pouring in stating that\nsuch a view isn&#39;t serious, and that &quot;real REST developers&quot; mint new\nidentifiers for every resource type they encounter?\n\nThe prevailing view in the REST community has become one where it just\nisn&#39;t considered rational to suggest using HTML, by those who then turn\naround and recommend opaque identifiers that can&#39;t possibly be self-\ndescriptive on the Web, because they aren&#39;t IANA-registered.\n\n&gt;\n&gt; No one is actively encouraging what the spec discourages - instead,\n&gt; we&#39;re saying that if you know what you&#39;re doing and there is shared\n&gt; understanding on all participants, it&#39;s ok.\n&gt; \n\nI wish that&#39;s what folks were saying, then I&#39;d have made my point.\nBut, every time I point out that opaque identifiers fail to meet the\nself-descriptive messaging constraint, I&#39;m shouted down by those who\nrefuse to believe that any tradeoffs exist when they&#39;re used -- I have\nto agree with Roy, that if you&#39;re going into that decision with your\neyes wide open, fine.\n\nHowever, when folks refuse to admit, and actively shout down those who\npoint out, that there is a tradeoff, how can those reading their advice\nbe making an informed, eyes-wide-open decision?  That&#39;s what I mean by\n&quot;cavalier&quot; -- it *does* make a difference, and not a trivial one,\neither.\n\nOn the Web, &quot;participant&quot; includes the entire deployed infrastrucute,\nnot just sender and recipient.  If you stick to ubiquitous identifiers\nwhose processing rules have long been understood by the deployed\ninfrastructure, you immediately gain the benefits of REST, which you\ncan&#39;t bank on if the deployed infrastructure simply ignores your\ncontent because it&#39;s never encountered your identifier before.\n\nSo the ability of ubiquitous identifiers to scale, is an order of\nmagnitude (if not more) greater than exists with opaque identifiers.\nThis is reality, and it&#39;s important to point that out to anyone\nexpecting their meant-for-public-consumption Web API to achieve\nInternet scale, like Mark pointed out to the Blinksale folks:\n\nhttp://tech.groups.yahoo.com/group/rest-discuss/message/6569\n\nTelling Blinksale to g&#39;head with an opaque identifier, without advising\nthat it needs to be registered and standardized to meet the constraints\nof REST, would be encouraging them to shoot themselves in the foot, as\nfar as their stated goals are concerned.\n\n&gt;\n&gt; The contention seems to be this:  we would encourage developers to use\n&gt; registered media types and you say they must use registered media\n&gt; types.\n&gt; \n\nI keep bending over backwards to explain that my point is only valid\nwhen the context is the Web.  When that context is the Web, yes, you\nMUST use registered identifiers, as there is no other defined means of\nmeeting the self-descriptive messaging constraint in that context.\n\nIf your API is only meant for limited redistribution and you don&#39;t care\nabout scaling, then by all means use HTTPS and don&#39;t worry about it.\nBut if you&#39;re expecting *anybody* else to re-use your system, including\nshared intermediary caches, you must play by the established rules for\nthe Web, i.e. the only registry that anybody (and, in fact, everybody)\nhas agreed to is IANA.\n\nAnd isn&#39;t that at least 80% of what we discuss regarding REST?\nPublishing Web APIs meant for general consumption over the public\nInternet?  That is the one thing all the so-called REST APIs out there\non the Web have in common -- they all attempt to be Internet-scale\nsolutions, which will never happen without self-descriptive messaging.\n\n&gt;\n&gt; I&#39;m interested in what system properties[1] are negatively effected\n&gt; under the following scenarios:\n&gt; \n\nREST itself provides all the explanations necessary regarding the\ntradeoffs of the uniform interface.  Without self-descriptive messaging,\nnone of the benefits of the uniform interface will be realized, because\nthe interface won&#39;t be uniform.\n\n&gt;\n&gt; - suppose I use a well-known, widely used, but un-registered\n&gt; specification (e.g. OpenSearch)\n&gt; \n\nLast I looked, OpenSearch results are just an Atom extension, which\nmeans re-using the ubiquitous, registered application/atom+xml\nidentifier -- the fact that the content happens to be a search result\nis an implementation detail that&#39;s between sender and recipient, and is\nnot required to be exposed over the wire in Content-Type, because it\ndoesn&#39;t affect the intended processing model for the payload.\n\n&gt;\n&gt; - suppose I use a roll-my-own format, but specify it and it&#39;s readily\n&gt; discoverable via google by all would-be clients.\n&gt; \n\nHow do you ensure, without a registry (which Google isn&#39;t), that nobody\nelse will ever use the same identifier to mean something else?  This\ncollision problem is exactly what the registry concept is meant to\nsolve.\n\nForcing sysadmins configuring intermediaries to Google in order to\ndetermine intent (which is an unrealistic expectation if the goal is\nserendipitous re-use) is exactly the problem self-descriptive messaging\nis meant to avoid:\n\n&quot;Self-descriptive means that the type is registered and the registry\npoints to a specification and the specification explains how to process\nthe data according to its intent.&quot;\n\nGoogle, or any other search engine, is not a substitute.  A self-\ndescriptive message is one where the identifier&#39;s meaning is\nunambiguous.  The IANA registry is the means for achieving this on the\nWeb -- search results aren&#39;t unambiguous, like registry entries.\n\n-Eric\n\n"}}