{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":23186829,"authorName":"Paul Prescod","from":"Paul Prescod &lt;paul@...&gt;","profile":"papresco","replyTo":"SENDER","senderId":"4TVjQIeplkrCO04_aRLAq4gbs7LQ4VQ63s6-7NmO8emSG26jt9YlCh1oi8HbSpNzyZLoMscSEXxgis5BrAyc_wvlNjo1YQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [xml-dev] ANN: Building Web Services the REST Way","postDate":"1025892998","msgId":1693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEMjVFMjg2LjkyMjAxRjIxQHByZXNjb2QubmV0Pg==","referencesHeader":"PDAwMGMwMWMyMjQyNiRlY2U2YTE5MCQ2NjAxYThjMEByYWluYm93Pg=="},"prevInTopic":1692,"nextInTopic":1694,"prevInTime":1692,"nextInTime":1694,"topicId":1677,"numMessagesInTopic":16,"msgSnippet":"... In a mailing list thread you are usually trying to discuss some specific topic. I didn t just file it, I also told you how to do the equivalent in HTTP. ","rawEmail":"Return-Path: &lt;paul@...&gt;\r\nX-Sender: paul@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_0_7_4); 5 Jul 2002 18:16:43 -0000\r\nReceived: (qmail 75426 invoked from network); 5 Jul 2002 18:16:43 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m4.grp.scd.yahoo.com with QMQP; 5 Jul 2002 18:16:43 -0000\r\nReceived: from unknown (HELO smtp1.ActiveState.com) (209.17.183.249)\n  by mta3.grp.scd.yahoo.com with SMTP; 5 Jul 2002 18:16:43 -0000\r\nReceived: from smtp3.ActiveState.com (smtp3.ActiveState.com [192.168.3.19])\n\tby smtp1.ActiveState.com (8.11.6/8.11.6) with ESMTP id g65IGgW14112;\n\tFri, 5 Jul 2002 11:16:42 -0700\r\nReceived: from prescod.net (ssh1.ActiveState.com [192.168.3.32])\n\tby smtp3.ActiveState.com (8.11.6/8.11.6) with ESMTP id g65IGe231993;\n\tFri, 5 Jul 2002 11:16:41 -0700\r\nMessage-ID: &lt;3D25E286.92201F21@...&gt;\r\nDate: Fri, 05 Jul 2002 11:16:38 -0700\r\nX-Mailer: Mozilla 4.76 [en] (Windows NT 5.0; U)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: Don Park &lt;donpark@...&gt;, rest-discuss@yahoogroups.com\r\nSubject: Re: [xml-dev] ANN: Building Web Services the REST Way\r\nReferences: &lt;000c01c22426$ece6a190$6601a8c0@rainbow&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nX-Filtered-By: PerlMx makes it fast and easy.  See http://www.ActiveState.com/Products/PerlMx/Header\r\nFrom: Paul Prescod &lt;paul@...&gt;\r\nX-Yahoo-Group-Post: member; u=23186829\r\nX-Yahoo-Profile: papresco\r\n\r\nDon Park wrote:\n&gt; \n&gt;...\n&gt; \n&gt; Paul,\n&gt; \n&gt; Why do you insist on arguing over the individual trees instead of\n&gt; looking at the forest?  I didn&#39;t bother replying when you casually filed\n&gt; away my previous comments as not being relevant to Rich&#39;s specific\n&gt; problem.  \n\nIn a mailing list thread you are usually trying to discuss some specific\ntopic. I didn&#39;t just file it, I also told you how to do the equivalent\nin HTTP.\n\n&gt; ... Now you insist on examining the value  of individual SOAP\n&gt; specs when I was pointing out that REST doesn&#39;t seem to be catching fire\n&gt; unlike SOAP.\n\nREST caught fire sometime in the mid-1990s. I first did a Web Service\n(an ad server) using REST techniques (and a pre-XML encoding) in 1996.\nPlus, REST has more real-world Internet-deployed apps than SOAP,\nincluding (AFAIK) Hotmail, Exchange, the whole RSS &quot;system&quot;, etc. And\nthe CIO of Utah has decided to use it. ;)\n\n * http://www.windley.com/2002/07/03.html#a64\n\nIf you see SOAP &quot;catching fire&quot; then you have a different perspective\nthen the people I meet who are trying to make money selling web services\ntools or services. Also, I see an article every week about how\nbusinesses are taking a &quot;wait and see&quot; attitude towards Web Services:\nthis is after *5* years of development. So &quot;catching fire&quot; does not seem\nto be the right word to me. SOAP is catching fire with software vendors\nwho want to send a new round of tools.\n\n&gt; &gt; J2EE and Expat are all you need for a &quot;REST toolkit and\n&gt; &gt; library.&quot; I&#39;m sorry to be so anticlimatic but the basic REST\n&gt; &gt; tools have been deployed for around eight years now. It&#39;s\n&gt; &gt; pretty hard to do better when the industry has already spent\n&gt; &gt; a *billion dollars* on REST toolkits.\n&gt; \n&gt; This display of trivialization and delusion does not become you.\n\nThere is nothing trivial about a the amount of money industry has spent\nimplementing the REST architecture. I&#39;m sorry if it seems that way to\nyou. One of the main inventors of REST is also one of the lead designers\nof Apache (Fielding). So surprise, surprise, Apache has REST ideas deep\ndown in its core. I see nothing trivial about pointing that out. PHP&#39;s\ndevelopers are strongly influenced by the Apache group, so PHP has REST\nideas deep down in its core too. etc. etc. for IIS.\n\nFielding&#39;s REST thesis was a description of the architecture of the\n*existing tools*. Let me stress that again: the term REST is a way of\ndescribing the architecture of the tools that *already existed* when he\nwrote the thesis.\n\nI&#39;ve also talked to people deeply involved with the standardization of\nJ2EE and they immediately &quot;GOT&quot; REST and described how J2EE supports it\nimplicitly. I can guarantee I&#39;ll have the same experience with the\ndevelopers of Zope when I see them next (it&#39;s the response I&#39;ve gotten\nfrom Zope users -- &quot;oh, that&#39;s what I&#39;m already doing&quot;). So these are my\nobservations from the real world. XML developers haven&#39;t caught on to\nthe extent that HTML developers have yet. That&#39;s true. But they have the\ninfrastructure, they just don&#39;t know how to use it (after all, it took\nyears for HTML developers to learn how to use the tools also).\n\nThis idea that something doesn&#39;t exist if it doesn&#39;t have a boxed\ntoolkit is bizarre to me. Where is the toolkit for GOF patterns or XP or\nstructured programming? Insofar as REST is an architectural style, it\nhas more in common with structured programming than with SOAP. What is\nthe SOAP architectural style? Who writes the best practices for SOAP\nservices?\n\n&gt; &gt; I&#39;m curious, have you read the SOAP spec?\n&gt; \n&gt; I have read 1.1 and earlier specs.  I have not yet read the 1.2 drafts.\n\nI&#39;ll just be interested to see, when you do, whether you still see the\nspirit of XML-RPC in there.\n\n&gt; PS: I find this sudden and unilateral shift to REST mailing list\n&gt; distasteful, Paul.\n\nWhen I post about REST to XML-DEV, I&#39;m told that it is tiresome and\noff-topic. Therefore I try not to keep threads running there for long. I\nasked on at least one occasion to move the thread to rest-discuss and\nnobody either agreed or disagreed. Furthermore, if I respond to a\nmessage on XML-DEV and then ask you to do your next response to\nrest-discuss, that could be perceived as a way for me to have my &quot;last\nword&quot; on XML-DEV and shunt your comments onto a different forum. I\nthought it was better to let you have the last work on that list and\nmove my comments to a more appropriate one.\n\nIf you prefer to discuss it on XML-DEV then we can go back there and\nI&#39;ll merely comment in my messages that you wanted to discuss it there.\n-- \nCome discuss XML and REST web services at:\n  Open Source Conference: July 22-26, 2002, conferences.oreillynet.com\n  Extreme Markup: Aug 4-9, 2002,  www.extrememarkup.com/extreme/\n\n"}}