{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":124198377,"authorName":"William Martinez Pomares","from":"&quot;William Martinez Pomares&quot; &lt;wmartinez@...&gt;","profile":"willmarpo","replyTo":"SENDER","senderId":"9s_I8ELNvCLLpWZ3nHtDZ96V_6vpabCychb3PpZM9e4Dt0uo1p4nLdypnFxNw9Z07R0QvQcQihI0gYqjCJxGRxlno6wdWO4jBpt5AyyGUGMqIyfYofIKmAmv","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: XForms vs. WSDL?","postDate":"1293143132","msgId":17123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlmMGk4cyttYTE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGltNFhmclNPUG12RW5WZT00S3U4LStLckNPR2QtWFBkOV9DaS15S0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":17122,"nextInTopic":17124,"prevInTime":17122,"nextInTime":17124,"topicId":17114,"numMessagesInTopic":23,"msgSnippet":"Mike. Ok, this is interesting, we can get several valid points in the discussion. But first, let me clarify I m not in favor of WSDL as a hard believer it will","rawEmail":"Return-Path: &lt;wmartinez@...&gt;\r\nX-Sender: wmartinez@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 60518 invoked from network); 23 Dec 2010 22:25:34 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m7.grp.sp2.yahoo.com with QMQP; 23 Dec 2010 22:25:34 -0000\r\nX-Received: from unknown (HELO n40b.bullet.mail.sp1.yahoo.com) (66.163.168.154)\n  by mta2.grp.sp2.yahoo.com with SMTP; 23 Dec 2010 22:25:34 -0000\r\nX-Received: from [69.147.65.171] by n40.bullet.mail.sp1.yahoo.com with NNFMP; 23 Dec 2010 22:25:34 -0000\r\nX-Received: from [98.137.35.12] by t13.bullet.mail.sp1.yahoo.com with NNFMP; 23 Dec 2010 22:25:34 -0000\r\nDate: Thu, 23 Dec 2010 22:25:32 -0000\r\nTo: rest-discuss@yahoogroups.com\r\nMessage-ID: &lt;if0i8s+ma14@...&gt;\r\nIn-Reply-To: &lt;AANLkTim4XfrSOPmvEnVe=4Ku8-+KrCOGd-XPd9_Ci-yK@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;William Martinez Pomares&quot; &lt;wmartinez@...&gt;\r\nSubject: Re: XForms vs. WSDL?\r\nX-Yahoo-Group-Post: member; u=124198377; y=AA2QHpSpLHWDvyYNH7eRb9d1u_upWNjdtG2w8Lh5MqwXvE-e\r\nX-Yahoo-Profile: willmarpo\r\n\r\nMike.\nOk, this is interesting, we can get several valid points in the discu=\r\nssion. But first, let me clarify I&#39;m not in favor of WSDL as a hard believe=\r\nr it will make the world happier, or that it is the only way to work on RES=\r\nT. It is just that, without a context, running away from it with no reason =\r\nis such non-sense that makes me wonder, and I end up like a defender of the=\r\n lost cause.\n\nNow. Let&#39;s see:\n\n&lt;snip&gt;\n Well, any arch discussion will have =\r\na context. In the context of the REST arch model, I find the WSDL pattern (=\r\nWSDL, WADL, GData Python API, etc.) to be inappropriate. I&#39;ve already menti=\r\noned a handful of reasons. Possibly one I did not emphasize is the lack of =\r\nhypermedia in this external definition pattern. \n&lt;/snip&gt;\n\nThat&#39;s an interes=\r\nting POV. I would not to see WSDL as a pattern, linked to external addition=\r\nal things. Just think of it as a document format for a moment.\n \n&lt;snip&gt;\nWhi=\r\nle WSDL can do a good job of expressing the request and response details, I=\r\n&#39;ve yet to see WSDL do a good job expressing the state transition details. =\r\nIOW, which steps are first, second, third, etc. These &quot;steps&quot;, in my experi=\r\nence almost always depend on the state of things at the moment and are not =\r\nat all easy to properly express in a static document.\n&lt;/snip&gt;\n\nTotally agre=\r\ne with you. I would not recommend either trying to define the complete stat=\r\ne machine in one doc, unless you have particular need to have instances of =\r\na state machine that may run longer and in parallel with other instances (v=\r\nersioning). And that is beyond REST.\n\nFor REST, all the transitions may be =\r\nbased on the actual state. I would not use WSDL for a one place description=\r\n of those transitions, and it is not made for that. It is made for defining=\r\n the document formats, bindings and message delivery patterns.\n\nI guess wha=\r\nt gets confused here with REST transitions is the message pattern idea. Tho=\r\nse patterns may go beyond the REST style, as they were not designed for tha=\r\nt. Actually, the messages are one way, delivery, while a REST interaction i=\r\nn HTTP implementation requires a request and a response. \n\nAnd you are righ=\r\nt, the articles I posted are just an example of how WSDL is thought to be c=\r\nompatible with REST, but following that philosophy of enclosing all the int=\r\neractions. That, let&#39;s say, is a pattern (or antipattern, so to speak). \n\n&lt;=\r\nsnip&gt;\nI&#39;ve been toying with pulling more and more details on these transiti=\r\nons out of client code and into the message. I&#39;ve even been experimenting w=\r\nith putting some of the state transition detail in _external_ documents, bu=\r\nt have yet to find the WSDL pattern helpful for that work.\n&lt;/snip&gt;\nYes, act=\r\nually I cheer the state transition info IN the message. Not in the code nor=\r\n in external docs. If the WSDL is part of it, then the WSDL should be THE m=\r\nessage, not an external doc.\n\nLast point on WSDL and REST: WSDL is not the =\r\nwhole, but a document you may get in one get operation, that should tell yo=\r\nu the format of the document you need to send next, the URI, and any expect=\r\ned response, if any, once you get the response, that one should drive you t=\r\no the next one and so on. Just like an XFORM, but yes, awfully verbose.\n\nNo=\r\nw, about what architectural style may WSDL be suitable? Well some SOA of co=\r\nurse. WSDL was meant to be a web services implementation definition, descri=\r\nbing the messages in XML format, the message exchange pattern and the under=\r\nlying protocol binding. If you have a system not totally built on top of HT=\r\nTP, with complex exchange patterns and a mix of data and processing intensi=\r\nve operations, then WSDL may (MAY) help you with little bits of automation =\r\nfor client construction. WSDL was not built for REST, and surely REST was n=\r\not defined for the system I describe, although one or two of the nodes are =\r\non the web. Still, WSDL is not magical and may not fit all implementations,=\r\n may work for integrated application, not necessarily for distributed ones.=\r\n\n\nBut describing about the essential SOA constrains and properties may take=\r\n longer in this comment. \n\nAnd, I hope you now know that I&#39;m not totally co=\r\nmfortable with the idea of REST being the natural SOA solution. It isn&#39;t, a=\r\nnd maybe that is a discussion we need to start in another thread.\n\nCheers!\n=\r\n\nWilliam Martinez Pomares.\n\nBTW even Wooden seems abandoned, so that is why=\r\n you see almost no practical work on this. Frank Cohen, when I told him WSD=\r\nL 2.0 was official, smiled back and said: &quot;Who cares?&quot;.  Oh, well.\n\n\n\n"}}