{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":471953390,"authorName":"Alistair Miles","from":"Alistair Miles &lt;alimanfoo@...&gt;","profile":"alistair.miles","replyTo":"SENDER","senderId":"Pkbua144yZATdXhl8_THCmiCCD1_Gi3c-H1odpBNbJ2qZbzz0asJh6sz5zPSbj1hAsyTa7VvUG5QL_BOvxDPsOy-BWhxoVvIy8jyQAP2hyM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] The relation of Linked Data/Semantic Web to REST","postDate":"1296576663","msgId":17269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMTEwMjAxMTYxMTAzLkdBMzYyOUBhbGltYW4tZGVza3RvcD4=","inReplyToHeader":"PDRENDY5ODE3LjgwNDAwQHdlYnIzLm9yZz4=","referencesHeader":"PGlpMHBocitsbDhoQGVHcm91cHMuY29tPiA8NEQ0Njk4MTcuODA0MDBAd2VicjMub3JnPg=="},"prevInTopic":17268,"nextInTopic":17270,"prevInTime":17268,"nextInTime":17270,"topicId":17242,"numMessagesInTopic":40,"msgSnippet":"Hi all, This doesn t really address the original question on this thread, but I thought I d add a couple of reflections as someone who has come from a","rawEmail":"Return-Path: &lt;alimanfoo@...&gt;\r\nX-Sender: alimanfoo@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 88095 invoked from network); 1 Feb 2011 16:11:06 -0000\r\nX-Received: from unknown (66.196.94.106)\n  by m10.grp.re1.yahoo.com with QMQP; 1 Feb 2011 16:11:06 -0000\r\nX-Received: from unknown (HELO mail-ww0-f54.google.com) (74.125.82.54)\n  by mta2.grp.re1.yahoo.com with SMTP; 1 Feb 2011 16:11:06 -0000\r\nX-Received: by mail-ww0-f54.google.com with SMTP id 31so7374585wwb.23\n        for &lt;rest-discuss@yahoogroups.com&gt;; Tue, 01 Feb 2011 08:11:06 -0800 (PST)\r\nX-Received: by 10.216.52.134 with SMTP id e6mr1517860wec.49.1296576665788;\n        Tue, 01 Feb 2011 08:11:05 -0800 (PST)\r\nReturn-Path: &lt;alimanfoo@...&gt;\r\nX-Received: from aliman-desktop (dhcp326.well.ox.ac.uk [129.67.45.169])\n        by mx.google.com with ESMTPS id i80sm11528798wej.4.2011.02.01.08.11.04\n        (version=SSLv3 cipher=RC4-MD5);\n        Tue, 01 Feb 2011 08:11:04 -0800 (PST)\r\nDate: Tue, 1 Feb 2011 16:11:03 +0000\r\nTo: rest-discuss@yahoogroups.com\r\nMessage-ID: &lt;20110201161103.GA3629@aliman-desktop&gt;\r\nReferences: &lt;ii0phr+ll8h@...&gt;\n &lt;4D469817.80400@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Disposition: inline\r\nIn-Reply-To: &lt;4D469817.80400@...&gt;\r\nUser-Agent: Mutt/1.5.20 (2009-06-14)\r\nFrom: Alistair Miles &lt;alimanfoo@...&gt;\r\nSubject: Re: [rest-discuss] The relation of Linked Data/Semantic Web to REST\r\nX-Yahoo-Group-Post: member; u=471953390; y=QDzwMcipdJaby0WyeHw4YZpj9HZ_JdK_XcwTRVW4D8Om9Bc5usHinsTa7HII\r\nX-Yahoo-Profile: alistair.miles\r\n\r\nHi all,\n\nThis doesn&#39;t really address the original question on this thread, but I thought\nI&#39;d add a couple of reflections as someone who has come from a background\nin developing semweb standards [1,2] and applications [3] but is now working\nmuch more in a restful repositories/web services/applications space [4].\n\nI had a great time going to the dublin core conferences from 2005-2009 and\ngetting to know the DC community. They&#39;re into managing metadata, and mostly\ntend to view metadata in terms of metadata records, being discrete packages\nof information. At the time I waved my RDF stick around a lot (e.g. [5])\nencouraging everyone to stop thinking in terms of records, and start thinking\nin terms of the data as a graph. I.e., melt down the conceptual boundary of\nthe metadata record, and let the metadata inside a record go free and join\nup with all of the other metadata it links to (which you can do relatively\neasily if your metadata is expressed as RDF and published as linked data). You\ncan then use SPARQL to ask and answer questions spanning data merged from any\nnumber of records from any number of sources. Eventually, all the records in\nthe world will have melted away to form one big happy boundary-less open-ended\nweb (meta)data graph, which can answer any question you can think of. Job done.\n\nThen in 2010 I moved to a malaria research group who have made fantastic\nheadway in establishing research data-sharing networks (these are networks of\npeople, not computers) like MalariaGEN [6]. The point of sharing research data\nis, in our case, being able to do new kinds of science which can only happen\nwhen lots of data from many studies are pooled. I&#39;ve since been involved\nin building web-based data repository systems that enable the capture,\nstorage, curation and sharing of data and metadata relating to various kinds\nof malaria research. These are not completely open data-sharing networks -\ndefining a data-sharing agreement between researchers is a key factor,\nwhich limits who can see and do what with what metadata, and protects the\ninterests of the researchers and study participants.\n\nBecause these repository systems tend to be at the hub of a set of other\nsystems for analysing, curating, visualising, ..., the data, some of which are\nweb-based, some of which are not, I&#39;ve tried to build RESTful web services\nin from the beginning, so we have the best possible chance of being able to\nintegrate these systems, and so the core repository services stay as lean\nand simple as possible.\n\nTo cut an already long story short, I&#39;ve found (ironically) that it&#39;s essential\nto draw boundaries around data and metadata, i.e., to think more in terms\nof records (or representations). The reasons are quite simple. Where data is\nbeing entered, updated, deleted, actively managed, ..., you need to be able\nto express access control policies (because not all data are public), and\nyou need to be able to say who has responsibility for doing what on what data\n(because people need to be able to collaborate and coordinate their work). I&#39;ve\nfound it effective in these cases to design resource interfaces where resource\nboundaries are chosen to support these concerns, and not necessarily around a\nlogical data model (e.g., you don&#39;t end up with one resource for each logical\nentity, rather you end up with resources whose representations span some\npart of the data graph, with additional link relations/hypermedia control to\ndrive client applications). AtomPub then gives a pretty good foundation for\ndesigning representations and implementing a restful service, and XForms a\npretty solid vehicle for implementing client applications.\n\nNow, if you told me to break down those boundaries, merge all the data, and\nlet someone query it (say, with SPARQL), right now I&#39;d run a mile, because\nI can&#39;t see how you could do that and still respect access controls. Maybe\nsomeone has done some clever work building access control policies into a\nSPARQL query engine, that would be interesting.\n\nAnyway, I just thought it was interesting that sometimes you want to melt\ndown all the boundaries and see your data as one big open-ended graph, and\nsometimes you want to see your data as (er, information?) resources with\nconcrete representations and well defined boundaries.\n\nI guess this is probably stating the obvious for most people on this list,\nbut hopefully an interesting aside.\n\nCheers,\n\nAlistair\n\n[1] http://www.w3.org/TR/swbp-vocab-pub/\n[2] http://www.w3.org/TR/skos-reference/\n[3] http://alimanfoo.wordpress.com/2011/01/17/using-sparql-for-biological-data-integration-reflections-on-openflydata-org-and-the-flyweb-project/\n[4] http://alimanfoo.wordpress.com/2010/01/08/cggh-and-data-sharing-networks-background/\n[5] http://alimanfoo.wordpress.com/2008/05/13/presentation-at-the-library-of-congress-simple-knowledge-organization-system-skos-in-the-context-of-semantic-web-deployment/\n[6] http://www.malariagen.net/ \n\nOn Mon, Jan 31, 2011 at 11:08:07AM +0000, Nathan wrote:\n&gt; Hi Bob,\n&gt; \n&gt; Generally they are orthogonal, in the same way that a logic statement \n&gt; is orthogonal to a web server.\n&gt; \n&gt; REST is an architectural style and set of constraints one considers \n&gt; and applies when webizing a technology and the components related to \n&gt; the use of that technology.\n&gt; \n&gt; Linked Data is webized information, each datum of information is a \n&gt; logical statement expressed as a typed link, a typed link is a \n&gt; statement which expresses the relation between two things, each thing \n&gt; can be a literal (a string, a number, denoting itself), an unnamed \n&gt; thing that merely exists (a blank node), or a globally named thing (a \n&gt; named node, a logical constant). Each statement can be considered true \n&gt; or false, and when you combine all the statements which you consider \n&gt; true about a thing, that set of statements forms a description of the \n&gt; thing (which can also be considered your current belief state, what \n&gt; you believe to be true about the thing(s) you&#39;re considering). As \n&gt; Linked Data is webized, it uses URIs as names for things and \n&gt; relations, and encourages the exposing of statements about those \n&gt; things or relations when you lookup (dereference) the corresponding URIs.\n&gt; \n&gt; Thus one would apply the style and constraints of REST not to Linked \n&gt; Data, but to the components, the publishing of Linked Data, the \n&gt; retrieval of Linked Data over a network, and to the construction of \n&gt; Agents which interact with the web of linked data.\n&gt; \n&gt; Conversely, since REST is a set of constraints optimized for the &quot;good \n&gt; old fashioned web of documents&quot;, one can review the needs and usage of \n&gt; Linked Data to come up with additional constraints, to identify \n&gt; mismatches, or to create an entirely new architectural style and set \n&gt; of constraints which one would then apply to the web specifications \n&gt; (URI, HTTP etc) in order to optimize it.\n&gt; \n&gt; Such examples may include:\n&gt; \n&gt;   - the tight coupling of URIs to protocols in the common case, for \n&gt; example one may need PUT, POST, DELETE to operate through HTTP+TLS \n&gt; whilst GET is through basic HTTP.\n&gt; \n&gt;   - REST and web optimization for large-grain hypermedia transfer \n&gt; whilst linked data deployment typically needs fine-grained data \n&gt; transfer / huge-grain data-set transfer.\n&gt; \n&gt;   - Analysis and inclusion of composite application state and single \n&gt; client multi-server interactions.\n&gt; \n&gt;   - The missing reverse-links.\n&gt; \n&gt;   - Pipelined requests and async message transfer (allowing for \n&gt; multiple requests to be sent at once and sent back in an optimized \n&gt; fashion).\n&gt; \n&gt; Essentially, REST is over a decade old, and whilst very good, it \n&gt; comprises constraints and a style which was optimized for common use \n&gt; cases which are no longer as common, Linked Data, Client-side &quot;ajax&quot; \n&gt; applications, cloud storage and cloud computing, version control over \n&gt; HTTP and many other now common uses are simply uncatered for, and the \n&gt; REST style is not optimized for these cases.\n&gt; \n&gt; The only other relation between REST and Linked Data, is that they \n&gt; both use HTTP URIs to identify resources, the web specification and \n&gt; REST definitions of the term &quot;resource&quot; is so abstractly defined that \n&gt; this often leads to confusion and inconsistent naming of &quot;resources&quot;, \n&gt; hence httpRange-14 and many other issues.\n&gt; \n&gt; Best,\n&gt; \n&gt; Nathan\n&gt; \n&gt; \n&gt; ------------------------------------\n&gt; \n&gt; Yahoo! Groups Links\n&gt; \n&gt; \n&gt; \n\n-- \nAlistair Miles\nHead of Epidemiological Informatics\nCentre for Genomics and Global Health &lt;http://cggh.org&gt;\nThe Wellcome Trust Centre for Human Genetics\nRoosevelt Drive\nOxford\nOX3 7BN\nUnited Kingdom\nWeb: http://purl.org/net/aliman\nEmail: alimanfoo@...\nTel: +44 (0)1865 287669\n\n"}}