{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":474754157,"authorName":"Bob Ferris","from":"Bob Ferris &lt;zazi@...&gt;","profile":"b.ferris@rocketmail.com","replyTo":"SENDER","senderId":"QJCJuytES1a3B4bPOzx2zlQMZZgguarIeOEalZxcw17Uha4REVJeZ0LzI7ZnM6Z4WVHvu_PMPfNzB593Pf6A0F_VH7qX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Loose coupling - a RESTful myth?","postDate":"1297162254","msgId":17333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENTEyMDBFLjEwMjA3QGVsYmtsYW5nLm5ldD4=","inReplyToHeader":"PDIwMTEwMjA3MTgwNTIxLjQ4MDhjODVmLmVyaWNAYmlzb25zeXN0ZW1zLm5ldD4=","referencesHeader":"PGlpanRtcytwMzRhQGVHcm91cHMuY29tPgk8NEQ1MDRCNEEuNjA3MDEwOEBlbGJrbGFuZy5uZXQ+IDwyMDExMDIwNzE4MDUyMS40ODA4Yzg1Zi5lcmljQGJpc29uc3lzdGVtcy5uZXQ+"},"prevInTopic":17331,"nextInTopic":17336,"prevInTime":17332,"nextInTime":17334,"topicId":17322,"numMessagesInTopic":13,"msgSnippet":"Hi Eric, ... Did I? I think, Semantic Web ontologies are even more portable than media types, or? However, they are relying on the provided and consumable","rawEmail":"Return-Path: &lt;zazi@...&gt;\r\nX-Sender: zazi@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 20756 invoked from network); 8 Feb 2011 10:50:58 -0000\r\nX-Received: from unknown (66.196.94.107)\n  by m11.grp.re1.yahoo.com with QMQP; 8 Feb 2011 10:50:58 -0000\r\nX-Received: from unknown (HELO shoutbox.org) (89.163.163.26)\n  by mta3.grp.re1.yahoo.com with SMTP; 8 Feb 2011 10:50:58 -0000\r\nX-Received: from [192.168.1.100] (p5B2ADC1C.dip.t-dialin.net [91.42.220.28])\n\t(using TLSv1 with cipher AES256-SHA (256/256 bits))\n\t(No client certificate requested)\n\t(Authenticated sender: zazi@...)\n\tby shoutbox.org (Postfix) with ESMTPSA id B47B36C16D7\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Tue,  8 Feb 2011 10:50:57 +0000 (UTC)\r\nMessage-ID: &lt;4D51200E.10207@...&gt;\r\nDate: Tue, 08 Feb 2011 11:50:54 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; de; rv:1.9.2.13) Gecko/20101207 Thunderbird/3.1.7\r\nMIME-Version: 1.0\r\nTo: rest-discuss@yahoogroups.com\r\nReferences: &lt;iijtms+p34a@...&gt;\t&lt;4D504B4A.6070108@...&gt; &lt;20110207180521.4808c85f.eric@...&gt;\r\nIn-Reply-To: &lt;20110207180521.4808c85f.eric@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Bob Ferris &lt;zazi@...&gt;\r\nSubject: Re: [rest-discuss] Loose coupling - a RESTful myth?\r\nX-Yahoo-Group-Post: member; u=474754157; y=xOhw7kqMvIxp9WHenps1u0uvV-5e0tmfB7eLoLhbpULNGMtr2XoFsQfOSVYix-ZZMSs\r\nX-Yahoo-Profile: b.ferris@...\r\n\r\nHi Eric,\n\nAm 08.02.2011 02:05, schrieb Eric J. Bowman:\n&gt;\n&gt; Don&#39;t forget portability, see Chapter 2.3.6.\n&gt;\n\nDid I? I think, Semantic Web ontologies are even more portable than \nmedia types, or? However, they are relying on the provided and \nconsumable serialization media types. A client should be able to consume \nat least one of the provided serialization media types for Semantic Web \nontologies. A server should provide as much as possible serialization \nmedia types for Semantic Web ontologies.\n\n&gt; That any system involves domain-specific vocabulary is pretty much a\n&gt; given; this is not justification for solving this problem through the\n&gt; creation of domain-specific media/data types.\n&gt;\n\nThat&#39;s why, I would prefer the application, reutilization and (if \nneeded) creation of specific appropriated Semantic Web ontologies, \nrather than domain specific media types.\n\n&gt;&gt;\n&gt;&gt; The costs that have to be invested into good ontology design maybe\n&gt;&gt; align with the costs of proper media type design.\n&gt;&gt;\n&gt;\n&gt; No, they are infinitely less.  Since an ontology has no effect on\n&gt; messaging amongst connectors, no standardization is required, allowing\n&gt; the &quot;invisible hand of the market&quot; to decide which ontologies are most\n&gt; useful.  GoodRelations is a de-facto standard (unless and until\n&gt; something better comes along), not an official one.\n&gt;\n&gt; An ontology is an order of magnitude less work to design than\n&gt; data/media types, even without considering the high opportunity cost of\n&gt; marshalling a standards effort (which takes years, followed by even\n&gt; more years until new standardized media types achieve ubiquitous\n&gt; deployment).\n\nThe standardization is the utilization of RDF Model in this case. I \nthink e.g. when I include an RDF triple in a HTTP Link header, than this \nstatement could also be interpreted by a connector, or?\nI truly believe that good ontology design can be quite expensive and \ncould take also several years, but that&#39;s common evolution. An ontology \nwith a quite long evolution is for example the FOAF vocabulary.\nIt&#39;s the inherent freedom that is given us by the Semantic Web to only \ndefine de-facto standards for domain specific ontologies, rather than \n&quot;true standards&quot;. Furthermore, this is a requirement when trying to \nmodel parts of the world. There would never be an ultimate solution of a \nconcrete domain-specific ontology and also for a graspable overall ontology.\n\n&gt;\n&gt; Which is why I believe that REST must be the basis for the Semantic Web.\n\nI guess, that&#39;s the point of view, I tried to argue all the time in the \nrecent discussions here, or? ;)\n\n\n&gt;&gt; Furthermore, &quot;turning a HTTP-based Type || API into a REST API might\n&gt;&gt; be as easy as deleting the API documentation&quot; is a bit paradox from\n&gt;&gt; my point of view.\n&gt;&gt;\n&gt;\n&gt; In some cases, it&#39;s true.  This is kinda the point of the hypertext\n&gt; constraint -- if the API is self-documenting, what&#39;s left to explain?\n\nFollowing Martin Fowler&#39;s explanation of self-documenting protocols[1], \nI would say: yes it might be quite interesting for a developer to \nexplore the protocol. However, it&#39;s hard to imagine that such a \nexploring which should give hints, would satisfy a developer who likes \nto apply an API for programming an application (I guess, client \ndevelopers keep rarely an eye out for unknown links, but rather than for \nannouncements of new API functionalities).\nI think, a developer likes to use parts of that API as needed by mainly \nreading the documentation and viewing examples (which are usually even \nmore important). Okay, I can maybe include these examples in the \n&quot;exploring mode&quot;. Although, pure exploring sounds for me still a bit \nlike hacking ;)\nTo summarize, I currently don&#39;t think that the self-documenting could \noutperform an additionally provided documentation.\nFor example machine processable URI template application descriptions \n(cf. [2]) might be an option that could allow a server to also change \nits URI scheme without breaking the clients.\n\n\n&gt; Browsers are coded against standardized media types; it&#39;s this shared\n&gt; understanding of the processing model which makes out-of-band\n&gt; documentation mostly irrelevant.\n\nYes, but Web browser are simply only one application type (it would be \nnice to exclude this specific type from further discussions of this kind \n;) ; however, this shouldn&#39;t include an exclusion of utilizing \nhypermedia - or does such an utilization even make my application to a \nWeb browser like application?).\nFor example, I thought recently about the combination of XAML and RDFa. \nOn the side, there is the quite comprehensive user interface markup \nlanguage XAML ( there many comparisons of XAML and HTML out there). On \nthe other side, there is RDFa to bring the power of (possibly) \ncomprehensive resource descriptions into other markup languages (see \n[3]). Maybe a combination of them would be delicious.\n\n&gt;&gt; The given examples for REST are not really APIs, or?\n&gt;&gt;\n&gt;\n&gt; Most examples of REST are examples of things which aren&#39;t really REST.\n&gt; Furthermore, just what sort of canonical example are you expecting from\n&gt; a tool which may be used to guide the development of transfer protocols\n&gt; like HTTP, application protocols like AtomPub, and APIs which implement\n&gt; one or even both of the former?  More detailed response pending for the\n&gt; other thread on this topic, still...\n&gt;\n\nI think, you elude my question here. Maybe I&#39;ll find an answer in your \nresponse to the other thread.\n\n&gt;&gt;\n&gt;&gt; 3. Just a small issue: better &quot;REST might be the best solution&quot;,\n&gt;&gt; rather than &quot;REST is the best solution&quot;. I guess, &#39;is&#39; requires a\n&gt;&gt; kind of proof, or? Could we really provide a complete proof about\n&gt;&gt; this? - I currently don&#39;t think so.\n&gt;&gt;\n&gt;\n&gt; Disagree.  If you&#39;re developing a distributed hypertext system, then\n&gt; Roy&#39;s thesis is scientific proof that there&#39;s a set of constraints\n&gt; which describe an optimal behavioral model.  Said thesis is subject to\n&gt; falsification, which hasn&#39;t occurred.  The constraint that&#39;s most\n&gt; susceptible to falsification would be client-server, in an age of P2P\n&gt; protocols, but I&#39;ve not seen it.  Considering all the peer review Roy&#39;s\n&gt; thesis has had, with proof evident in the success of the Web, I&#39;d say\n&gt; that if anything was overlooked or outright wrong, somebody would have\n&gt; spotted it by now.\n\nOkay, then we have to come up with a disagreement here ;)\nI still insist to my argumentation regarding this issue here.\n\nCheers,\n\n\nBob\n\n\n[1] http://martinfowler.com/articles/richardsonMaturityModel.html\n[2] \nhttp://www.semanticoverflow.com/questions/2858/uri-template-specifications-for-linked-data-publishing\n[3] http://www.w3.org/TR/rdfa-core/\n\n"}}