{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Jeff Bone","from":"Jeff Bone &lt;jbone@...&gt;","replyTo":"SENDER","senderId":"1wfBErFcbMF37P-FI2B5hs8l_mzzZAJl3dPjr4SSEvVxQzZonrn78XBjqGFmrWxDw6eldV6m2syio_SwxykHNOWRlcsC","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] The Four REST Contstraints  (was Re: REST and\tonly REST)","postDate":"1026234463","msgId":1771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NTA4MjhGLjNDQ0IlamJvbmVAZGVlcGZpbGUuY29tPg==","inReplyToHeader":"PDAwMWQwMWMyMjc2OCRjNTA5MDU2MCRhMDAwYThjMEBzZWFpcnRobGFwdG9wPg=="},"prevInTopic":1770,"nextInTopic":0,"prevInTime":1770,"nextInTime":1772,"topicId":1770,"numMessagesInTopic":2,"msgSnippet":"... Things to think about:  a URI doesn t have to be an HTTP URI --- you could easily have GTP URIs.  Second, a URI isn t anything more than a name for ","rawEmail":"Return-Path: &lt;jbone@...&gt;\r\nX-Sender: jbone@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_0_7_4); 9 Jul 2002 17:07:43 -0000\r\nReceived: (qmail 80689 invoked from network); 9 Jul 2002 17:07:43 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m10.grp.scd.yahoo.com with QMQP; 9 Jul 2002 17:07:43 -0000\r\nReceived: from unknown (HELO blanco.deepfile.com) (24.242.137.237)\n  by mta1.grp.scd.yahoo.com with SMTP; 9 Jul 2002 17:07:43 -0000\r\nReceived: from [192.168.123.100] ([192.168.123.100])\n\t(authenticated)\n\tby blanco.deepfile.com (8.11.6/8.11.6) with ESMTP id g69H6Cx03774;\n\tTue, 9 Jul 2002 12:06:12 -0500\r\nUser-Agent: Microsoft-Entourage/10.0.0.1331\r\nDate: Tue, 09 Jul 2002 12:07:43 -0500\r\nSubject: Re: [rest-discuss] The Four REST Contstraints  (was Re: REST and\n\tonly REST)\r\nTo: Seairth Jacobs &lt;seairth@...&gt;,\n   rest-discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nMessage-ID: &lt;B950828F.3CCB%jbone@...&gt;\r\nIn-Reply-To: &lt;001d01c22768$c5090560$a000a8c0@seairthlaptop&gt;\r\nMime-version: 1.0\r\nContent-type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-transfer-encoding: 7bit\r\nFrom: Jeff Bone &lt;jbone@...&gt;\r\nX-Yahoo-Group-Post: public\r\n\r\nOn 7/9/02 11:50 AM, &quot;Seairth Jacobs&quot; &lt;seairth@...&gt; wrote:\n&gt; \n&gt; 1) Identification of resources: I am not sure about this one.  In part, I\n&gt; having trouble what it means to &quot;identify a resource&quot; in a RESTful fashion.\n&gt; The most common technique, as I understand it, is the URI.  However, I am\n&gt; not sure that I understand what exactly makes the URI the right\n&gt; identification method for the job (unless this is just because of it&#39;s\n&gt; relationship to HTTP, etc.).\n\nThings to think about:  a URI doesn&#39;t have to be an HTTP URI --- you could\neasily have GTP URIs.  Second, a URI isn&#39;t anything more than a name for\nsomething --- think handle, name, OID, hash, whatever.  The only semantics a\nURI &quot;officially&quot; has is dereference - Axiom of [URI] Opacity.  (In fact,\nthat&#39;s questionable --- but that&#39;s a good first approximation.)  The nice\nthing about HTTP and many other URI schemes is that the naming is\ndecentralized and uncoordinated --- as long as there&#39;s a DNS name or IP\naddress to qualify the namespace, it&#39;s possible to add names with no\ncoordination between administrative concerns whatsoever.  This is an\nimportant point and, IMO, one of the keys to the success of the Web.\n\n&gt; 2) Manipulation of resources through representations: Now, I have always had\n&gt; a question about this one.  How exactly can one manipulate resources over a\n&gt; network any other way?  In other words, it seems to me that any time I\n&gt; communicate with a computer that returns a resource to me, I can only ever\n&gt; get a &quot;representation&quot; of that resource (even if the representation contains\n&gt; all known aspects of that resource).  When I download my e-mail, I am\n&gt; retrieving a representation of what is on the POP server.  When I send an\n&gt; e-mail, the SMTP server is only getting a representation of that e-mail.\n&gt; When I download a file from FTP, I am getting a representation of what is on\n&gt; the FTP server.  If I were to then edit the downloaded representation and\n&gt; upload it back again, I am sending back a request to update the remote\n&gt; resource through my version of the representation.  Does any of what I am\n&gt; saying make sense, or am I just not grasping what is really meant by this\n&gt; constraint?\n\nNope, you&#39;ve basically got it.  In the literal sense, this constraint is a\ntautology.  You can only manipulate things via representations.  I suspect\nthat the purpose of the constraint is to point out and underscore the\ndistinction between the logical entity denoted by the URI --- the resource\n--- and the representation.  Most people get confused the other way around,\nand assume that resources are transferred --- this is still a source of\nconfusion for many very bright people, cf. recent discussion in TAG and\nelsewhere.\n\n&gt; 4) Hypermedia as the engine of applications state:  Okay, I think I\n&gt; understand this one.  All that this is saying is that any given\n&gt; representation of a resource contains some sort of link to other\n&gt; representations of the same or other resource(s).  In HTML, it is the URL in\n&gt; anchors, etc.  These links are the only allowable methods by which a state\n&gt; can be transferred from one representation to another representation (or\n&gt; from one state to another state).  Now, how this applies to GTP is a good\n&gt; question.  In part, I think this is somewhat like the same argument I have\n&gt; for #1 above.  I think that, as GTP stands now, it does not impose the\n&gt; method by which &quot;hypermedia&quot; is achieved.\n\nThis one, IMO, is the most propaganda-like of the constraints:  politically\ncharged and technically not that useful / meaningful.  It simply begs for\nthe definitions of hypermedia, application, application state, and engine.\nNor, IMO, does a literal interpretation of REST - REpresentational State\nTransfer - really require hypermedia.  (IMO, all the rest of REST is useful\nin thinking about i.e. globally distributed filesystems containing objects\nthat do not in fact refer to one another via hyperlinks...  But with the\naddition of this constraint, REST ties itself undesirably and inextricably\nto the existing Web and other Web-like hypermedia systems.  IMHO,\nshort-sightedness on Roy&#39;s part.)  But that&#39;s a controversial dead horse\nthat we&#39;ve already beat up.\n\nHaving said that, the Web is a GOOD THING and distributed systems in general\ngain tremendously by accommodating the Web&#39;s hypermedia data model, REST\narchitecture, and other technical qualities.\n\njb\n\n\n"}}