{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":323709912,"authorName":"Erik Wilde","from":"Erik Wilde &lt;dret@...&gt;","profile":"drethoo","replyTo":"SENDER","senderId":"DB51LN-rj4ZuQjkkfoD1B2hD8B3akod6JOqUbPTn7irG-jpgIUaOzdpEY4JHLzg4xuppFhhwIVVo6ehhwioMOdueZC3p","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Feedback on draft-wilde-profile-link-00","postDate":"1333739884","msgId":18762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGN0Y0MTZDLjMwNTA0MDBAYmVya2VsZXkuZWR1Pg==","inReplyToHeader":"PDA0RkMzRjc5LTkzQjUtNEY4Ni04MkIyLTQyMDI5MTM4RTIwMkBtbm90Lm5ldD4=","referencesHeader":"PDA0RkMzRjc5LTkzQjUtNEY4Ni04MkIyLTQyMDI5MTM4RTIwMkBtbm90Lm5ldD4="},"prevInTopic":0,"nextInTopic":18775,"prevInTime":18761,"nextInTime":18763,"topicId":18762,"numMessagesInTopic":25,"msgSnippet":"hello mark. thanks a lot for the feedback! i am cross-posting this response to rest-discuss@yahoogroups.com, because it may be interesting for that community","rawEmail":"Return-Path: &lt;dret@...&gt;\r\nX-Sender: dret@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 71268 invoked from network); 6 Apr 2012 20:06:15 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m16.grp.sp2.yahoo.com with QMQP; 6 Apr 2012 20:06:15 -0000\r\nX-Received: from unknown (HELO cm04fe.IST.Berkeley.EDU) (169.229.218.145)\n  by mta2.grp.sp2.yahoo.com with SMTP; 6 Apr 2012 20:06:15 -0000\r\nX-Received: from 65-122-15-169.dia.static.qwest.net ([65.122.15.169] helo=dretair.local)\n\tby cm04fe.ist.berkeley.edu with esmtpsa (TLSv1:AES256-SHA:256)\n\t(Exim 4.76)\n\t(auth plain:dret@...)\n\t(envelope-from &lt;dret@...&gt;)\n\tid 1SGFQD-0003fs-Di; Fri, 06 Apr 2012 13:06:15 -0700\r\nMessage-ID: &lt;4F7F416C.3050400@...&gt;\r\nDate: Fri, 06 Apr 2012 12:18:04 -0700\r\nUser-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.7; rv:11.0) Gecko/20120327 Thunderbird/11.0.1\r\nMIME-Version: 1.0\r\nTo: REST Discuss &lt;rest-discuss@yahoogroups.com&gt;, \n &quot;apps-discuss@... application-layer protocols&quot; &lt;apps-discuss@...&gt;\r\nCc: Mark Nottingham &lt;mnot@...&gt;\r\nReferences: &lt;04FC3F79-93B5-4F86-82B2-42029138E202@...&gt;\r\nIn-Reply-To: &lt;04FC3F79-93B5-4F86-82B2-42029138E202@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Erik Wilde &lt;dret@...&gt;\r\nSubject: Re: Feedback on draft-wilde-profile-link-00\r\nX-Yahoo-Group-Post: member; u=323709912; y=5aixO_hjo3l-AJK8SZa5rc0u_jkhnxz5Opbzt9gLnS2H2w\r\nX-Yahoo-Profile: drethoo\r\n\r\nhello mark.\n\nthanks a lot for the feedback! i am cross-posting this response to \nrest-discuss@yahoogroups.com, because it may be interesting for that \ncommunity as well. too bad that the IETF drafts don&#39;t have commenting \nsupport on the IETF page itself, that would be really useful!\n\nOn 2012-04-05 09:25 , Mark Nottingham wrote:\n&gt; Overall, I&#39;m really happy to see this draft; have been considering doing something along these lines too.\n&gt; *** Major issues\n&gt; * &quot;Resource Profiles&quot; - this spec defines the profile is being about the *resource* of its context. This is too loose; in HTML and other uses I&#39;ve seen, profiles are about the *representation* they occur within.\n\nactually, most of the abstract talks about the profile qualifying a \nrepresentation, but you&#39;re correct that this should be made very clear, \nand that it should be about the specific representation containing the \nprofile link. i&#39;ll rewrite all the places where the text says that \nprofiles are about resources.\n\n&gt; In other words, the common idea of a profile, IME, is that it describes the conventions, extensions, etc. that are used in a particular document, but it doesn&#39;t say anything about the resource that the document was retrieved from.\n\nyes, that is how it should be. only that i really would not want to say \n&quot;describes&quot; here, to clearly avoid the expectation that a &#39;profile&#39; link \nMUST resolve to some sort of description. i&#39;d say it &quot;identifies&quot; \nconventions, extensions, etc., and the only dependable operation on a \n&#39;profile&#39; link is to compare the URI to known profile URIs.\n\n&gt; That&#39;s a good design, because link relations are already a defined mechanism to talk about resource behaviours; having two such mechanisms isn&#39;t a good idea (at least without some discussion).\n&gt; E.g., when I interact with a resource, I know it supports particular behaviours, because it&#39;s been linked to with relation &quot;Foo.&quot; When I get a representation from the &quot;Foo&quot; resource, it will have a media type that describes the format, and also a profile (&quot;Bar&quot;) that describes additional features / conventions of that document (such as a particular use of JSON or XML), but that profile won&#39;t -- and shouldn&#39;t! -- be an additional way of describing the behaviours of the &quot;Foo&quot; resource.\n\nnow i am little bit confused. taking your example, i am not concerned \nwith the link relation that was used to discover &#39;foo&#39; at all. all i am \nconcerned with is that if i am retrieving &#39;foo&#39; and i find a &#39;bar&#39; \nprofile identifier in the representation, i know that it follows \nconstraints and conventions beyond the &#39;foo&#39; media type. one example i \nam currently considering adding is atompub. currently, when you retrieve \na feed, there&#39;s no way to tell it&#39;s atompub-capable just by looking at \nit. that could be easily remedied by adding a &#39;profile&#39; link identifying \nthe support of atompub. that&#39;s the kind of scenario i have in mind, but \nit sounds to me you&#39;re thinking about something else, or am i just \nmisunderstanding you?\n\n&gt; *** Nits / minor feedback:\n&gt; * &quot;&quot;&quot;This link relation type is independent of the resource representation it is used in (but the representation must support types links for this mechanism to work)&quot;&quot;&quot;\n&gt; I&#39;d state this in terms of &quot;context&quot;, as per the link RFC.\n\n&quot;This link relation type is independent of the context in which it is \nused (however, the representation must support typed links for this \nmechanism to work)&quot;\n\n&gt; * s/must support types links/must support typed links/\n\ndone.\n\n&gt; * &quot;&quot;&quot;\n&gt;     In fact, for the purpose of this\n&gt;     specification, the URI does not necessarily have to link to a\n&gt;     dereferencable resource, and clients can treat the occurrence of a\n&gt;     specific URI in the same sense as a namespace URI and invoke specific\n&gt;     behavior based on the assumption that a specific profile URI signals\n&gt;     that a resource follows a specific profile.\n&gt; &quot;&quot;&quot;\n&gt; Here, I&#39;d state this in terms of &quot;target URIs&quot;, as does the link RFC.\n\n&quot;In fact, for the purpose of this specification, the target URI does not \nnecessarily have to identify a dereferencable resource (or even use a \ndereferencable URI scheme), and clients can treat the occurrence of a \nspecific URI in the same way as an XML namespace URI and invoke specific \nbehavior based on the assumption that a specific profile target URI \nsignals that a resource representation follows a specific profile.&quot;\n\n&gt; * Your Security Considerations section isn&#39;t going to pass muster; if it were me, I&#39;d talk about how software shouldn&#39;t make security-sensitive assumptions based upon profiles.\n\nany specific suggestions on how to phrase that? ;-)\n\n&gt; *&quot;&quot;&quot;\n&gt;     As one example, consider the case of podcasts, a specific kind of\n&gt;     feed using additional fields for media-related metadata.  Using a\n&gt;     &#39;profile&#39; link, it would be possible for a client to understand that\n&gt;     a specific feed is supposed to be a podcast feed, and that it may\n&gt;     contain entries using podcast-specific fields.  This may allow a\n&gt;     client to behave differently when handling such a feed (such as\n&gt;     rendering a UI), even when the current set of entries in the feed may\n&gt;     not contain any podcast entries.\n&gt; &quot;&quot;&quot;\n&gt; This is an interesting use case. My use cases for &quot;profile&quot; tend to be things like &quot;links that this document contain follow *this* convention&quot;. More examples would be good.\n\nto me, it&#39;s both about those links and about conventions followed in the \ndocument itself. i am currently planning to include three examples in \nthe next version of the draft:\n\n- HCard\n- Dublin Core\n- AtomPub\n\nparticularly this last one might be what you&#39;re looking for, right? if \nyou have any suggestions what to add to this list, please let me know.\n\nthanks a lot for the feedback! i&#39;ll continue working on the examples, \nand as soon as these are finished, i am planning to publish -01 and see \nwhether the additional examples make it easier to understand what this \ndraft is trying to accomplish, and there might be more feedback.\n\ncheers and happy easter everybody,\n\ndret.\n\n-- \nerik wilde | mailto:dret@...  -  tel:+1-510-2061079 |\n            | UC Berkeley  -  School of Information (ISchool) |\n            | http://dret.net/netdret http://twitter.com/dret |\n\n"}}