{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":403399802,"authorName":"Benjamin Carlyle","from":"Benjamin Carlyle &lt;benjamincarlyle@...&gt;","profile":"fuzzybsc","replyTo":"SENDER","senderId":"Kydu55ahZo6js4YGtWuxp5qBM9-s5gsckiROrlCCcDXpSykzKn_An96xGkS_Vzr3iLpdCb_dnIgmP-COQRd07hKDvF7Oslp2uAZLPgdjsrjJ57_jytEqN1NIPQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"SOA with REST title now available worldwide","postDate":"1345381801","msgId":18976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTjJnKzZZWU5zeEVPMVI3MkE9OTMyRkJ2QWtXV1Y4b01TLXpzTjE9SlNHeng0NXE0QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBTjJnKzZic2QtRGRLVF9YK0ZCN1hXWDlUQk15Zitpc2thMV9jYm83ZEhNRUNTdVQ1d0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTjJnKzZaamRCUFRxQjB0ZGhUTXFwdj01YkFyTFBQOXN5Rk1yaU1oTF9VUGRQSE5YZ0BtYWlsLmdtYWlsLmNvbT4JPENBTjJnKzZicjg2WUMrdGJ4UVZUWm00MWMrcUp6NWl3YS1QNzl0ZF9DUkY5dT11KzNYQUBtYWlsLmdtYWlsLmNvbT4JPENBTjJnKzZhTUIyeGpMPS1lNlBZa0xCWWFiQnJxTTZGUFNmbnFtYm1qOVVCckNjb0t4QUBtYWlsLmdtYWlsLmNvbT4JPENBTjJnKzZic2QtRGRLVF9YK0ZCN1hXWDlUQk15Zitpc2thMV9jYm83ZEhNRUNTdVQ1d0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":18977,"prevInTime":18975,"nextInTime":18977,"topicId":18976,"numMessagesInTopic":3,"msgSnippet":"Gentlefolk, I haven t posted here for a while, but many of you know me as having been active to varying degrees in the REST community for about 6 years now. I ","rawEmail":"Return-Path: &lt;fuzzybsc@...&gt;\r\nX-Sender: fuzzybsc@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nX-Received: (qmail 47828 invoked from network); 19 Aug 2012 13:10:03 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m4.grp.sp2.yahoo.com with QMQP; 19 Aug 2012 13:10:03 -0000\r\nX-Received: from unknown (HELO mail-ob0-f174.google.com) (209.85.214.174)\n  by mta2.grp.sp2.yahoo.com with SMTP; 19 Aug 2012 13:10:02 -0000\r\nX-Received: by obbuo13 with SMTP id uo13so8020459obb.19\n        for &lt;rest-discuss@yahoogroups.com&gt;; Sun, 19 Aug 2012 06:10:02 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.50.184.198 with SMTP id ew6mr7138701igc.27.1345381802327; Sun,\n 19 Aug 2012 06:10:02 -0700 (PDT)\r\nX-Received: by 10.64.7.143 with HTTP; Sun, 19 Aug 2012 06:10:01 -0700 (PDT)\r\nX-Received: by 10.64.7.143 with HTTP; Sun, 19 Aug 2012 06:10:01 -0700 (PDT)\r\nIn-Reply-To: &lt;CAN2g+6bsd-DdKT_X+FB7XWX9TBMyf+iska1_cbo7dHMECSuT5w@...&gt;\r\nReferences: &lt;CAN2g+6ZjdBPTqB0tdhTMqpv=5bArLPP9syFMriMhL_UPdPHNXg@...&gt;\n\t&lt;CAN2g+6br86YC+tbxQVTZm41c+qJz5iwa-P79td_CRF9u=u+3XA@...&gt;\n\t&lt;CAN2g+6aMB2xjL=-e6PYkLBYabBrqM6FPSfnqmbmj9UBrCcoKxA@...&gt;\n\t&lt;CAN2g+6bsd-DdKT_X+FB7XWX9TBMyf+iska1_cbo7dHMECSuT5w@...&gt;\r\nDate: Sun, 19 Aug 2012 23:10:01 +1000\r\nX-Google-Sender-Auth: kYXLqO81dzDYaWeodP5CdhJcmk8\r\nMessage-ID: &lt;CAN2g+6YYNsxEO1R72A=932FBvAkWWV8oMS-zsN1=JSGzx45q4A@...&gt;\r\nTo: REST DISCUSS &lt;rest-discuss@yahoogroups.com&gt;\r\nContent-Type: multipart/alternative; boundary=14dae93408ab6a3f4b04c79e1c03\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Benjamin Carlyle &lt;benjamincarlyle@...&gt;\r\nSubject: SOA with REST title now available worldwide\r\nX-Yahoo-Group-Post: member; u=403399802; y=yACrr3J8txTPMSw0mI3_D3Ecp-z558D4ODBpWJ1FVSr2JAk\r\nX-Yahoo-Profile: fuzzybsc\r\n\r\n\r\n--14dae93408ab6a3f4b04c79e1c03\r\nContent-Type: text/plain; charset=UTF-8\r\n\r\nGentlefolk,\n\nI haven&#39;t posted here for a while, but many of you know me as having been\nactive to varying degrees in the REST community for about 6 years now. I\nhave some significant experience implementing REST in machine to machine\nenvironments (browser free environments) in backend business systems,\nrealtime safety-related control systems, and a number of other esoteric\nenvironments that involve leading people and negotiating internal and\nbusiness to business interfaces with people with varying levels of REST\nexpertise and enthusiasm. Over the last few years I have been working with\na number of others on the title mentioned in the subject line.\n\nIt&#39;s a title I don&#39;t expect to pass by this list without criticism. It uses\nvocabulary that is often more on the SOA side than on the REST side. It\nfocuses on REST &quot;service contracts&quot; (the set of urls exposed by a server\nand the server-specific meaning of standard methods and media types in\nthose resources) as a standard tool for governing &quot;REST services&quot; as part\nof an overall service inventory. It focuses almost entirely on machine to\nmachine interaction within the context of IT assets of a single enterprise.\nIt doesn&#39;t deal much with browsers or mashups and it even spends a\nsignificant amount of time addressing issues like transactions and pub/sub.\nPerhaps for some the very fact that Thomas Erl&#39;s name is on the cover well\npush some buttons :)\n\nNevertheless we collectively and I in particular have worked hard not to\ncompromise on REST principles and constraints while still making the\ncontent accessible to SOA people and the general population. Within this\ncontext of heavy machine to machine interaction we deal with defining a\nuniform interface to cover an inventory of services within a particular\nenterprise, and how that should relate to service contracts and to broader\nstandardisation efforts. We look to move past SOA&#39;s traditional limit of\nincreasing intrinsic interoperability only within a given inventory and\ninstead look for standard methods and media types to increase\ninteroperability to more massive scales.\n\nWe have sought to keep hypermedia core to the practice of building\ninventories of services and their related customers and to minimise\ncoupling while also being explicit about why we do this. We have sought to\ndrive a hard line on the stateless constraint and what that means to the\naforementioned patterns of transactions (promoting compensating over\natomic) and pub/sub (promoting cached polling and delta encoding).\n\nSome of you have already seen the material in various stages of completion\nas have many SOA guys. Over the last six months or so the manuscript\nchanged significantly as we worked that feedback into the finished product.\n\nNo book is perfect, but I hope this one will end up bringing the REST and\nSOA worlds together in a closer understanding without compromising one iota\nof what is important to each. I&#39;m confident that despite the unfamiliar\nwording, context and audience that the book is written to be applied to\nthat at its heart is a true application of REST constraints and to every\npossible extent a true application of the years of experience the REST\ncommunity has developed.\n\nThe book is available in ebook and hard cover:\nAmazon - http://amzn.com/0137012519\nBarnes and Noble -\nhttp://search.barnesandnoble.com/SOA-with-REST/Thomas-Erl/e/9780137012510(seriously?\nNo permalink?)\nHome - http://servicetechbooks.com/rest\n\nComments, discussion and criticism (timidly) welcome. I can&#39;t think of a\nbetter place to discuss the end result than this list.\n\r\n--14dae93408ab6a3f4b04c79e1c03\r\nContent-Type: text/html; charset=UTF-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;p&gt;Gentlefolk,&lt;/p&gt;\n&lt;p&gt;I haven&#39;t posted here for a while, but many of yo=\r\nu know me as having been active to varying degrees in the REST community fo=\r\nr about 6 years now. I have some significant experience implementing REST i=\r\nn machine to machine environments (browser free environments) in backend bu=\r\nsiness systems, realtime safety-related control systems, and a number of ot=\r\nher esoteric environments that involve leading people and negotiating inter=\r\nnal and business to business interfaces with people with varying levels of =\r\nREST expertise and enthusiasm. Over the last few years I have been working =\r\nwith a number of others on the title mentioned in the subject line.&lt;/p&gt;\n\n&lt;p=\r\n&gt;It&#39;s a title I don&#39;t expect to pass by this list without criticism=\r\n. It uses vocabulary that is often more on the SOA side than on the REST si=\r\nde. It focuses on REST &quot;service contracts&quot; (the set of urls expos=\r\ned by a server and the server-specific meaning of standard methods and medi=\r\na types in those resources) as a standard tool for governing &quot;REST ser=\r\nvices&quot; as part of an overall service inventory. It focuses almost enti=\r\nrely on machine to machine interaction within the context of IT assets of a=\r\n single enterprise. It doesn&#39;t deal much with browsers or mashups and i=\r\nt even spends a significant amount of time addressing issues like transacti=\r\nons and pub/sub. Perhaps for some the very fact that Thomas Erl&#39;s name =\r\nis on the cover well push some buttons :)&lt;/p&gt;\n\n&lt;p&gt;Nevertheless we collectiv=\r\nely and I in particular have worked hard not to compromise on REST principl=\r\nes and constraints while still making the content accessible to SOA people =\r\nand the general population. Within this context of heavy machine to machine=\r\n interaction we deal with defining a uniform interface to cover an inventor=\r\ny of services within a particular enterprise, and how that should relate to=\r\n service contracts and to broader standardisation efforts. We look to move =\r\npast SOA&#39;s traditional limit of increasing intrinsic interoperability o=\r\nnly within a given inventory and instead look for standard methods and medi=\r\na types to increase interoperability to more massive scales.&lt;/p&gt;\n\n&lt;p&gt;We hav=\r\ne sought to keep hypermedia core to the practice of building inventories of=\r\n services and their related customers and to minimise coupling while also b=\r\neing explicit about why we do this. We have sought to drive a hard line on =\r\nthe stateless constraint and what that means to the aforementioned patterns=\r\n of transactions (promoting compensating over atomic) and pub/sub (promotin=\r\ng cached polling and delta encoding).&lt;/p&gt;\n\n&lt;p&gt;Some of you have already seen=\r\n the material in various stages of completion as have many SOA guys. Over t=\r\nhe last six months or so the manuscript changed significantly as we worked =\r\nthat feedback into the finished product.&lt;/p&gt;\n\n&lt;p&gt;No book is perfect, but I =\r\nhope this one will end up bringing the REST and SOA worlds together in a cl=\r\noser understanding without compromising one iota of what is important to ea=\r\nch. I&#39;m confident that despite the unfamiliar wording, context and audi=\r\nence that the book is written to be applied to that at its heart is a true =\r\napplication of REST constraints and to every possible extent a true applica=\r\ntion of the years of experience the REST community has developed.&lt;/p&gt;\n\n&lt;p&gt;T=\r\nhe book is available in ebook and hard cover:&lt;br&gt;\nAmazon - &lt;a href=3D&quot;http:=\r\n//amzn.com/0137012519&quot;&gt;http://amzn.com/0137012519&lt;/a&gt;&lt;br&gt;\nBarnes and Noble =\r\n- &lt;a href=3D&quot;http://search.barnesandnoble.com/SOA-with-REST/Thomas-Erl/e/97=\r\n80137012510&quot;&gt;http://search.barnesandnoble.com/SOA-with-REST/Thomas-Erl/e/97=\r\n80137012510&lt;/a&gt; (seriously? No permalink?)&lt;br&gt;\nHome - &lt;a href=3D&quot;http://ser=\r\nvicetechbooks.com/rest&quot;&gt;http://servicetechbooks.com/rest&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;Comment=\r\ns, discussion and criticism (timidly) welcome. I can&#39;t think of a bette=\r\nr place to discuss the end result than this list.&lt;br&gt;\n&lt;/p&gt;\n\r\n--14dae93408ab6a3f4b04c79e1c03--\r\n\n"}}