{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":81035509,"authorName":"Vincent D Murphy","from":"Vincent D Murphy &lt;vdm@...&gt;","profile":"johnfoobar1","replyTo":"SENDER","senderId":"LnOsTbhoobX6MUssU4Rpr-GlFIAtJ6mN5Cic03Q_GQGVkQ2iRMXJu0wb7GtAETLpXsWcf-_X5zq7HhyHIXq9cBHR4PI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Implementing a Purchase Order the REST way","postDate":"1027700657","msgId":1987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENDE3N0IxLjgwNzA2MDVAdmRtLmNjPg==","referencesHeader":"PFBpbmUuTE5YLjQuNDQuMDIwNzI1MTcxNjIyMC4zMjE0LTEwMDAwMEBsb2NhbGhvc3QubG9jYWxkb21haW4+IDwzRDQxNURGMC42OEE2RTQ5REBtaXRyZS5vcmc+"},"prevInTopic":1986,"nextInTopic":1988,"prevInTime":1986,"nextInTime":1988,"topicId":1986,"numMessagesInTopic":6,"msgSnippet":"... i suggest that the something is a catch-all resource in the form web page where you can create purchase orders, search for purchase orders, browse","rawEmail":"Return-Path: &lt;vdm@...&gt;\r\nX-Sender: vdm@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_0_7_4); 26 Jul 2002 16:20:39 -0000\r\nReceived: (qmail 77039 invoked from network); 26 Jul 2002 16:20:39 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m8.grp.scd.yahoo.com with QMQP; 26 Jul 2002 16:20:39 -0000\r\nReceived: from unknown (HELO mail.online.ie) (213.159.130.68)\n  by mta1.grp.scd.yahoo.com with SMTP; 26 Jul 2002 16:20:39 -0000\r\nReceived: from vdm.cc (unknown [194.125.156.12]);\n\t  by mail.online.ie with ESMTP id E9B3F19027;\n\t  Fri, 26 Jul 2002 17:20:31 +0100 (IST)\r\nMessage-ID: &lt;3D4177B1.8070605@...&gt;\r\nDate: Fri, 26 Jul 2002 17:24:17 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.0; en-US; rv:1.1b) Gecko/20020721\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: &quot;Roger L. Costello&quot; &lt;costello@...&gt;\r\nCc: rest-discuss@yahoogroups.com,\n\t&quot;Jacobs,David B.&quot; &lt;djacobs@...&gt;\r\nSubject: Re: [rest-discuss] Implementing a Purchase Order the REST way\r\nReferences: &lt;Pine.LNX.4.44.0207251716220.3214-100000@...&gt; &lt;3D415DF0.68A6E49D@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Vincent D Murphy &lt;vdm@...&gt;\r\nX-Yahoo-Group-Post: member; u=81035509\r\nX-Yahoo-Profile: johnfoobar1\r\n\r\nRoger L. Costello wrote:\n&gt; My tutorial guides the reader through the\n&gt; creation of an actual set of Web services.  Things have been proceeding\n&gt; fine for all of the services that involve clients getting something\n&gt; (i.e., doing an HTTP GET).  I am now at the point where I want to\n&gt; provide a service to allow clients to submit a Purchase Order (PO). \n&gt; Presumably, before a client submits a PO he/she \n&gt;  - gets &quot;something&quot; from the Web service, \n&gt;  - takes some actions (e.g., fills in a form), and then \n&gt;  - responds with a completed PO. \n&gt; I am stuck on what that &quot;something&quot; should be.  I need your help in\n&gt; identifying what that &quot;something&quot; should be.\n\ni suggest that the something is a &#39;catch-all&#39; resource in the form web\npage where you can create purchase orders, search for purchase orders,\nbrowse indexes of purchase orders, and so on.  if you would like to see\na prototype of this email me and i will create one.  however this is\nonly really relevant for human user agents.  at the risk of tossing\naround unsubstantiated buzzwords, i think that for machine user agents\nthis is a question of service discovery.  (see zeroconf.org for one\ndefinition of service discovery, e.g. finding a printer on an IP network).\n\n&gt; A relevant side note: One fundamental doctrine of my tutorial is that\n&gt; you should design for maximum usability of your web services.  That is,\n&gt; web services should be usable both by browser-based clients, and by\n&gt; machine-based clients (i.e., machine-to-machine processing). \n&gt; Furthermore, the document that is served up by a Web service should be\n&gt; usable by both types of clients.  Thus, I recommend serving up XML\n&gt; documents containing a stylesheet processing instruction (PI).  Browsers\n&gt; will automatically style the XML using the stylesheet PI (I am gearing\n&gt; this towards the latest versions of the browsers.  I realize earlier\n&gt; versions don&#39;t support this).  Machines will simply consume the raw XML.\n\ni have been thinking about this issue as well.  i think it basically\nboils down to the (jaded) topic of content negotiation.  i see the\nAccept-Encoding (sp?) header as a reasonable way to achieve this.  i\nthink its difficult to support with existing httpd server tools though.\n\nfrom a seperate perspective, i don&#39;t think xml support is adequate in\nhuman user agents.  e.g. take mozilla.  the xlink support is dodgy (am i\nthe only one who thinks xlink is way too complicated?).  don&#39;t even ask\nabout IE.\n\ni&#39;m rambling on here.  basically, i think that at this stage it&#39;s better\nto have human-only and machine-only representations.  for machine user\nagents to use human-oriented (HTML/flash/etc) representations you need\nscreen scraping, which is a short-term kludge; for human user agents to\nuse machine-oriented (XML) representations, you need decent XML\ninfrastructure in the browsers; frankly i don&#39;t think the technology is\nanywhere near mature enough.  clearly the way forward is to migrate\nhuman user agents to XML, but this isn&#39;t where it needs to be for REST\nto use just XML representations, IMHO.  sorry if i come across as a\npessimist; i welcome challenges to this point of view.\n\n&gt; Okay, back to the Purchase Order.  What resource does a client access\n&gt; prior to submitting a PO?  My tutorial says &quot;Step 1. Identify the\n&gt; resources you wish to make available&quot;.  Hmm, it is not clear to me what\n&gt; the resource is.  I don&#39;t think that the resource is &quot;PurchaseOrder&quot;. \n&gt; That is what the client is composing.  Clearly the resource is not\n&gt; &quot;MakePurchaseOrder&quot; as resources are nouns not verbs.  Perhaps it is\n&gt; &quot;PurchaseOrderTemplate&quot;?  I don&#39;t like that but it&#39;s the best that I can\n&gt; think of at the moment.  What do you think the resource is?\n\nreferring to my first point above, i would call it\n\nhttp://www.parts-depot.com/purchase-orders\n\n(you could make it purchaseOrders, purchaseorders, or whatever, but\nthat&#39;s &#39;just&#39; a question of style.)\n\nfurther PUTs or POSTs that create purchase orders can create URIs of the\nform\n\nhttp://www.parts-depot.com/purchase-orders/foo\n\nincidentally, i can&#39;t decide which is more appropriate here; a POST or a\nPUT.  arguably, a POST makes sense as you are inserting a purchase order\ninto the set of all purchase orders.  i think a PUT could make a lot of\nsense as well though.  i haven&#39;t investigated whether contemporary HTML\nuser agents support PUT either; anyone have any input on this?\n\n&gt; Let&#39;s suppose that the resource is &quot;PurchaseOrderTemplate&quot;.  My tutorial\n&gt; says &quot;Step 2. Create a logical URL to the resource&quot;.  I propose this\n&gt; URL: (this is a purchase order for a company, parts-depot, which sells\n&gt; auto, bicycle, and rollerblade parts)\n&gt; \n&gt; http://www.parts-depot/purchase-order-template\n&gt; \n&gt; That seems like a reasonable logical URL.  What do you think?\n\ni prefer mine.  :)  i don&#39;t know whether &#39;template&#39; is too specific.  i\nwould have envisaged this resource as something more general, a &#39;portal&#39;\n(if you&#39;ll forgive the use of that dot-com era word) into everything you\ncould want to do with purchase orders, and i think my name better\nreflects such generality.\n\n&gt; Now the question is: if a client enters this URL what does he/she get\n&gt; back?  Clearly, if the client is sitting at a browser then he/she would\n&gt; like to see an HTML form that can be filled in.  What about the\n&gt; machine-based client, what does it want?  Do we want to send to it an\n&gt; empty PO XML document (i.e., tags but no data)?  Do we want to send to\n&gt; it a pointer to a DTD/Schema?  Any either case, recall that I want to\n&gt; send the same XML to all clients; with a stylesheet PI for browser\n&gt; clients.\n\nsee my point re: service discovery.  prescod&#39;s web pages (thanks paul!)\nrefer to an ongoing effort to provide a mechanism for describing REST\nweb services, if you could call them that.\n\n&gt; The last step, what the client returns, is easy - a completed PO.\n\nagreed.  however the devil is in the details.  for me the details are\nlike this:\n\nthe client returns a specific /representation/ of the resource it\ncreated; in this case a completed PO.  for machines this can be XML, for\n humans (X)HTML.\n\n&gt; So, to summarize my questions:\n\ni&#39;ll summarise my (entirely subjective, nowhere near definitive) answers..\n\n&gt; 1. What should be the resource in this scenario?\n\na portal to everything to do with purchase orders.  indexes, search\nforms, other forms, everything.\n\n&gt; 2. What should be the URL to that resource?\n\nhttp://www.parts-depot.com/purchase-orders or equivalent.\n\n&gt; 3. I want to serve up an XML representation of the resource, so that I\n&gt; can be consistent to all clients.  What XML should I serve up?\n\ni would serve up seperate (X)HTML/XML representations based on content\nnegotiation.  i just think that is the more pragmatic way forward given\nthe status quo in browser technology, and glacial progress in adopting\nnew technology (though my hope is that mozilla will breath new life into\nuser agent innovation if it becomes more mainstream).\n\nhowever if you want to serve up a single XML representation, one\napproach i have which i haven&#39;t experimented with yet is to use XML\nnamespaces; leave XHTML using the default root namespace, and use your\nown namespace for the XML bits.\n\n&gt; Thanks!  /Roger\n\nand thank you being an effective REST pioneer..\n\n-vincent\n\n\n"}}