{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7519858,"authorName":"Mark Baker","from":"Mark Baker &lt;distobj@...&gt;","profile":"gonga_thrash","replyTo":"SENDER","senderId":"6CsLukZalISm2tSqBPjprrzuQlhgeo24v9HE0Zg6CKQPG5F98gAMLzqqmtnMzhCu4amxRmgAm-2j0u6VRwRcyV79yw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[fielding@apache.org: Re: httpRange-14 , what&#39;s the problem]","postDate":"1028218008","msgId":2027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwODAxMTIwNjQ4LkExNTIxMEB3d3cubWFya2Jha2VyLmNhPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":2026,"nextInTime":2028,"topicId":2027,"numMessagesInTopic":1,"msgSnippet":"Long, but *well* worth the read.  Every time I talk to Roy, I learn something new and useful. MB ... Date: Wed, 31 Jul 2002 23:48:05 -0700 Content-Type:","rawEmail":"Return-Path: &lt;mark.baker@...&gt;\r\nX-Sender: mark.baker@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_0_7_4); 1 Aug 2002 16:06:47 -0000\r\nReceived: (qmail 41135 invoked from network); 1 Aug 2002 16:06:47 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m15.grp.scd.yahoo.com with QMQP; 1 Aug 2002 16:06:47 -0000\r\nReceived: from unknown (HELO markbaker.ca) (207.236.3.141)\n  by mta2.grp.scd.yahoo.com with SMTP; 1 Aug 2002 16:06:46 -0000\r\nReceived: (from mbaker@localhost)\n\tby markbaker.ca (8.9.3/8.8.7) id MAA15259\n\tfor rest-discuss@yahoogroups.com; Thu, 1 Aug 2002 12:06:48 -0400\r\nDate: Thu, 1 Aug 2002 12:06:48 -0400\r\nTo: rest-discuss@yahoogroups.com\r\nSubject: [fielding@...: Re: httpRange-14 , what&#39;s the problem]\r\nMessage-ID: &lt;20020801120648.A15210@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nX-Mailer: Mutt 1.0.1i\r\nFrom: Mark Baker &lt;distobj@...&gt;\r\nX-Yahoo-Group-Post: member; u=7519858\r\nX-Yahoo-Profile: gonga_thrash\r\n\r\nLong, but *well* worth the read.  Every time I talk to Roy, I learn\nsomething new and useful.\n\nMB\n\n----- Forwarded message from &quot;Roy T. Fielding&quot; &lt;fielding@...&gt; -----\n\nDate: Wed, 31 Jul 2002 23:48:05 -0700\nContent-Type: text/plain; charset=US-ASCII; format=flowed\nMime-Version: 1.0 (Apple Message framework v482)\nCc: &quot;www-tag&quot; &lt;www-tag@...&gt;\nTo: &quot;Tim Berners-Lee&quot; &lt;timbl@...&gt;\nFrom: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\nIn-Reply-To: &lt;031301c23721$5661e5a0$84001d12@...&gt;\nMessage-Id: &lt;A2224494-A51A-11D6-8895-000393753936@...&gt;\nContent-Transfer-Encoding: 7bit\nSubject: Re: httpRange-14 , what&#39;s the problem\nX-Mailing-List: &lt;www-tag@...&gt; archive/latest/1886\nSender: www-tag-request@...\nList-Id: &lt;www-tag.w3.org&gt;\nList-Help: &lt;http://www.w3.org/Mail/&gt;\nList-Unsubscribe: &lt;mailto:www-tag-request@...?subject=unsubscribe&gt;\nX-Spam-Status: No, hits=-1.8 required=5.0\n\ttests=IN_REP_TO,DOUBLE_CAPSWORD,PORN_3\n\tversion=2.30\nX-Spam-Level: \nStatus: O\nContent-Length: 34095\nLines: 681\n\n\nOn Monday, July 29, 2002, at 09:59  AM, Tim Berners-Lee wrote:\n&gt; http://www.w3.org/DesignIssues/HTTP-URI.html\n\n&gt; Tim Berners-Lee\n&gt; Date: 2002-07-27, last change: $Date: 2002/07/31 20:15:46 $\n&gt; [...]\n\n&gt;  This question has been addressed only vaguely in the specifications.\n&gt;  However, the lack of very concise logical definition of such things had\n&gt;  not been a problem, until the formal systems started to use them. There\n&gt;  were no formal systems addressing this sort of issue (as far as I know,\n&gt;  except for Dan Connolly&#39;s Larch work [@@]), until the Semantic Web\n&gt;  introduced languages such as RDF which have well-defined logical\n&gt;  properties and are used to describe (among other things) web operations.\n\nThere has been quite a lot of work outside the W3C regarding the Web\narchitecture, both in formalisms and mere descriptions.  Google is a\ngood way to find them, though most are intended more as a way of showing\noff the properties of some variation on a formalism than they are of\nactually modeling the Web.\n\n&gt;  The efforts of the Technical Architecture Group to create an architecture\n&gt;  document with common terms highlighted this problem. (It demonstrates the\n&gt;  ambiguity of natural language that no significant problem had been \n&gt; noticed\n&gt;  over the past decade, even though the original author or HTTP , and later\n&gt;  co-author of HTTP 1.1 who also did his PhD thesis on an analysis of the\n&gt;  web, and both of whom have worked with Web protocols ever since, had had\n&gt;  conflicting ideas of what the various terms actually mean.)\n\nTim, when you invented HTTP it only allowed one method (GET), did not\nhave header fields, and interpreted every response as HTML.  HTTP has\nchanged considerably over time.\n\nI don&#39;t think we have conflicting ideas about the terms.  I think that\nthe changes introduced in 1995 for the sake of HTTP caching and content\nnegotiation are absent from your model of how the Web works because we\nneeded to change the model in order for it to work at all. Furthermore,\nthe community made a very conscious decision to stop referring to\nresources as documents because they simply do not always fit the mental\nmodel of the English word &quot;document&quot;.\n\n&gt;  This document explains why the author find it difficult to work in the\n&gt;  alternative proposed philosophies. If it misrepresents those others&#39;\n&gt;  arguments, then it fails, for which I apologize in advance and will\n&gt;  endeavor to correct.\n&gt;\n&gt; 1. Web Concepts as proposed\n&gt;\n&gt;  The WWW is a space of information objects. The URI was originally called \n&gt; a\n&gt;  UDI, and originally all URIs identified information objects. Now, URI\n&gt;  schemes exist which identify more or less anything (eg uuids) or\n&gt;  emailboxes (mailto:) but is we look purely at HTTP URIs, they define a \n&gt; web\n&gt;  of information objects. Information objects -- perhaps in Cyc terms\n&gt;  ConceptualWorks -- are normally things which\n&gt;\n&gt;  * Carry some sort of message, and\n\nWhat does that mean?  Information objects are things that carry \ninformation?\nAll objects carry information by virtue of having state.\n\n&gt;  * Can be represented, to a greater or lesser authenticity, in bits\n\nAny object&#39;s state can be represented in bits.  The state doesn&#39;t have\nto be stored in bits -- it can merely be observed at the time that a\nmethod is applied.\n\n&gt;  I want to make it clear that such things are generic (See Generic\n&gt;  Resources) -- while they are documents, they generally are abstractions\n&gt;  which may have many different bit representations, as a function of, for\n&gt;  example:\n&gt;\n&gt;  * Time -- the contents can vary with revision --\n&gt;  * Content-type in which the bits are encoded\n&gt;  * Natural language in which a human-readable document is written\n&gt;  * Machine language in which a machine-processable document is written\n&gt;  * and a few more\n&gt;\n&gt;  but the philosophy is that an HTTP URI may identify something with a\n&gt;  vagueness as to the dimensions above, but it still must be used to refer\n&gt;  to a unique conceptual object whose various representations have a very\n&gt;  large a mount in common. Formally, it is the publisher which defines the\n&gt;  what an HTTP URI identifies, and so one should look to the publisher for \n&gt; a\n&gt;  commitment as to the exact nature of the identity along these axes.\n\nYes, no argument there.\n\n&gt;  I&#39;m going to refer to this as a document, because it needs a term and \n&gt; that\n&gt;  is the best I have to date, but the reader should be sure to realize that\n&gt;  this does not mean a conventional office document, it can be for example\n&gt;\n&gt;  * A poem\n&gt;  * An order for ball bearings\n&gt;  * A painting\n&gt;  * A Movie\n&gt;  * A reveiw of a movie\n&gt;  * A sound clip\n&gt;  * A record of the temperature of the furnace\n&gt;  * An array a million integers, all zero\n&gt;\n&gt;  and so on, as limited only by our imagination.\n\nNone of which are similar to the examples I gave, wherein an http URI\nis being used to identify the I/O control-system for a physical robot\nor a gateway to SMS-enabled phone devices.  Nor does it lend appropriate\nsignificance to the properties of a Web-enabled refrigerator or a\ncar radio, both of which I have personally interacted with via HTTP.\nIt is therefore far more reasonable to refer to the thing identified\nby an http URI as a resource that is accessible via HTTP.\n\n&gt;  The Web works because, given an HTTP URI, one can in a large number of\n&gt;  cases, get a representation of the document. For a human readable\n&gt;  document, the person is presented with the information by virtue of some\n&gt;  gadget which is given the bits of a representation. In the case of a\n&gt;  hypertext document, a reference to another document is encoded such that,\n&gt;  upon user request, the referenced document can in turn be automatically\n&gt;  presented. In the case of a machine-readable document, identifiers of\n&gt;  concepts, being HTTP URIs, will often allow definitive reference\n&gt;  information about those concepts to be pulled in to guide further \n&gt; actions.\n&gt;\n&gt;  The web, then, is made of documents as the internet is made of cables and\n&gt;  routers. The documents can be about anything, so when we move to talk\n&gt;  about the contents of documents we break away from talking about\n&gt;  information space and the whole universe of human -- and machine --\n&gt;  discourse is open to us. Web pages can compare a renaissance choral works\n&gt;  with jazz pop hits, and discuss whether pigs have wings.\n&gt;  Machine-processable documents can encode information about shoes, and\n&gt;  ships, and sealing-wax. Until recently, the Internet protocol standards\n&gt;  out of which the Web is built had little to say about such things. They\n&gt;  were concerned only with the human-readable side, so it was people,\n&gt;  reading natural language (not internet specs) who formed and communicated\n&gt;  the concepts at this level. Nowadays, however, semantic web languages\n&gt;  allow information to be expressed not only about URIs, TCP ports and\n&gt;  documents, but also about arbitrary concepts - the shoes, and ships and\n&gt;  sealing wax, and whether pigs have wings. Simple semantic web application\n&gt;  allow one to order shoes and travel on ships, and determine that, given\n&gt;  the data, pigs do not have wings.\n&gt;\n&gt;  For these purposes it is of course quite essential to distinguish between\n&gt;  something described by a document and the document itself. Now that we -\n&gt; -\n&gt;  for the first time -- have not only internet protocols which can talk\n&gt;  about document but also those which talk about real world things, we must\n&gt;  either distinguish or be hopelessly fuzzy.\n\nNo argument there either, except that I don&#39;t think that this is\nanything new.  The solution is to use a formalism that understands\nthe difference between an identifier and *use* of that identifier.\n\nIn order for HTTP caching to work, there needs to be a distinction\nbetween the attributes of a resource (whatever is identified by *any*\nscheme accessed via HTTP) and the attributes of one particular\nrepresentation of that resource obtained via GET.  Assertions in\nthe form of HTTP metadata (header fields) are made about each,\nindependently, and without ambiguity because they are defined by\na shared standard, albeit without syntactic clarity and independent\nextensibility due to the limitation of mixing them all together\nin a MIME-like header.  Apparently, RDF is capable of the same\ndistinctions, so there is no technical issue here.\n\n&gt;  And is this bad, is it an inhibition to have to work our way though\n&gt;  documents before we can talk about whatever we desire? I would argue not,\n&gt;  because it is very important not to lose track of the reasons for our\n&gt;  taking and processing any piece of information. The process of publishing\n&gt;  and reading is a real social process between social entities, not\n&gt;  mechanical agents. To be socially responsible, to be able to handle \n&gt; trust,\n&gt;  and so on, we must be aware of these operations. The difference between \n&gt; a\n&gt;  car and what some web page says about it is crucial - not only when you\n&gt;  are buying a car.\n\nCorrect, but in those circumstances we would not be using the &quot;http&quot;\nURI to define the identity of the car.  Instead, we use the http URI\nto provide access via HTTP to a representation of a car that is ALSO\nidentified by a VIN (without any URI form being necessary).  A legal\ndocument that would later be drawn up, or even a transaction via\ncontract passed through a cashier (also identified via a http URI),\nwould use the VIN for physical identification of the car, not\nbecause it is an inherently better string than one beginning &quot;http:&quot;,\nbut because the VIN has been permanently affixed to the dashboard and\nengine block for precisely this purpose.\n\nIf car producers wished such a thing, they could all agree to stamp\neach car with a unique http URI instead and achieve the same\npurpose: unique identification within the class of objects under use.\nThe fact that we could also use that URI to access information about\nthat specific car via the Web, which is a different resource from the\ncar itself, doesn&#39;t change the fact that it uniquely identifies the\ncar within the realm of cars.\n\nHowever, it is a bit of a waste of time to talk about this in terms\nof cars when the real objective, or at least that of the vocal\nminority, is to distinguish between the abstract concept of a\nnamespace and a document describing that namespace.  It is the same\nproblem, but is easier to think about.  When used within an xmlns\nattribute of an XML document, an http URI identifies the namespace.\nWhen used within an xlink:href attribute of an XML document or a\nbrowser&#39;s URI entry field or similar construct, an http URI\nidentifies the namespace by providing a consistent view of that\nnamespace in the form of representations.\n\nThe URI still identifies an unambiguous resource precisely because\nwe do not say that the result of a GET is the thing that is\nidentified, and we do not say that the thing identified is a\ndocument just because access is allowed via HTTP by way of documents.\nPeople who use the Web don&#39;t care about that difference, but the\ntechnology of distributed caching absolutely depends on it.\nIn other words, just because a URI only identifies one resource\ndoes not mean that every use of that URI is equivalent, just as\nusing an http URI as a cache key is not equivalent to using it\nas the target of an anchor href.\n\nI say an http resource is a conceptual object that has state and\nidentity and behavior, just as you define it in your own design notes\nprior to getting involved in this debate, but I do not generally refer\nto it as an object because all of the OOP developers get hot and\nbothered when I do so -- it is a term that is inextricably linked\nwith a common implementation, just like document is a term that is\ninextricably linked to words/images on renderable media.  HTTP is\ndesigned to hide all details of the implementation, so saying http\nURI identify resources is the most accurate statement.\n\n&gt;  Some have opined that the abstraction of the document is nonsense, and \n&gt; all\n&gt;  that exists, when a web page describes a car, is the car and various\n&gt;  representations of it, the HTML, PNG and GIF bit streams. This is however\n&gt;  very weak in my opinion. The various representations have much more in\n&gt;  common than simply the car. And the relationship to the car can be many\n&gt;  and varied: home page, picture, catalog entry, invoice, remote control\n&gt;  panel, weblog, and so on. The document itself is an important part of\n&gt;  society - to dismiss its existence is to prevent us being aware of human\n&gt;  and aspects of information without which we are impoverished. By \n&gt; contrast,\n&gt;  the difference between different representations of the document (GIF or\n&gt;  PNG image for example) is very small, and the relationship between\n&gt;  versions of a document which changes through time a very strong one.\n\nThat argument is weird.  No one has opined that the abstraction of\na document is nonsense -- it is merely insufficient to describe all http\nresources.  Furthermore, if the same URI is used to identify a resource\nwhose representations are a home page, picture, catalog entry, invoice,\nremote control panel, weblog, and so on, then that URI obviously does\nnot identify the car.  It might be said to identify a bunch of random\nthings related to a car of that type, but certainly not the car.\n\nURI in general identify a resource -- one concept, one identity, one\nsameness that might be observable via its representations.  The vast\nmajority of URI do identify documents.  HOWEVER, the architecture is\nnot defined by what is true of the vast majority -- it is defined by\nwhat is true of ALL resources that fit the given criteria.  And if the\ncriteria is &quot;all http URI&quot;, your definition of &quot;document&quot; simply does\nnot fit.  That does not in any way prevent people from using unambiguous\nidentifiers in http or the semantic web, nor does it somehow reduce\nthe value of a document as an abstraction.\n\n&gt; 2. Trying out the Alternatives\n&gt;\n&gt;  The folks who disagree with the model do so for a number of different\n&gt;  arguments. This article, therefore will have to take them one by one but\n&gt;  the ones which come to mind are as follows:\n\nWhy didn&#39;t you simply refer to the arguments that others made, rather\nthan your interpretation of what they meant to say?  My messages have\nbeen a lot more carefully worded than this document.\n\n&gt;     1. Every web page (or many of therm) are in fact themselves\n&gt;  representations of some abstract thing, and the URI really identifies\n&gt;  that thing, not a document at all.\n\nNot *necessarily* a document.\n\n&gt;     2. There are many levels of identification (representation as a set of\n&gt;  bits, document, car which the web page is about) and the URI\n&gt;  publisher, as owner of the URI, has the right to define it to mean\n&gt;  whatever he or she likes;\n\nThey can define it to mean anything, but it only has meaning if it is\nused according to that definition.  Likewise, it may take on meaning\nthat wasn&#39;t intended by the publisher if it can be consistently used\nas such, and may take on a temporary meaning if the temporal period is\nsufficient to be usable.  That&#39;s because the meaning of a URI is\ninsignificant when compared to the reason why the reference is\nbeing made (the meaning of the resource in context of its use), and\nnot all references are made by the publisher of the URI.\n\nIt is possible, though not at all desirable, that the meaning of a\nresource will at some point differ from the intended meaning that\na person had in mind when they used the URI as a reference.  That\nis a well-known problem that will affect the Semantic Web just as\nmuch as it does the current Web.  It is a social problem of any\nsystem that allows identifiers to exist independent of the entity\nbeing identified.  Yes, it has drawbacks, but try identifying a concept\nthat has no current realization within a system that depends on\nthe realization for identity.\n\n&gt;     3. Actually the URI has to, like in English, identify these different\n&gt;  things ambiguously. Machines have to disambiguate using common sense\n&gt;  and logic\n&gt;     4. Actually the URI has to, like in English, identify these different\n&gt;  things ambiguously. Machines have to disambiguate using the fact that\n&gt;  different properties will refer to different levels.\n&gt;     5. Actually the URI has to, like in English, identify these different\n&gt;  things ambiguously. Machines have to disambiguate using extra\n&gt;  information which will be provided in other ways along with the URI\n&gt;     6. Actually the URI has to, like in English, identify these different\n&gt;  things ambiguously. Machines have to disambiguate them by context: A\n&gt;  catalog card will talk about a document. A car catalog will talk about\n&gt;  a car.\n\nNone of the above.  I have consistently stated that the URI identifies\nthe same resource as far as the architecture is concerned, even if the\npeople using that URI are only partially aware of its real sameness\nover time, and even if its meaning changes over time.  The only thing\nthat differs by context is the RESULT of using that URI.  That is the\nseparation of concerns between methods and identifiers which has been\ncentral to the architecture since HTTP/1.0 was introduced.\n\n&gt;     7. They may have been used to identify documents up till now, but for \n&gt; RDF\n&gt;  and the Semantic Web, we should change that and start to use them as\n&gt;  the Dublin Core and RDF Core groups have for abstract concepts.\n\nIMO, there is only one Web.\n\n&gt; 2.1 Identify abstract things not documents\n&gt;\n&gt;  Let&#39;s take the alternatives in order. These alternatives all make sense.\n&gt;  Each one, however, has problems I can&#39;t see any way around when we\n&gt;  consider them as a basis as\n&gt;\n&gt;  The first was,\n&gt;\n&gt;  Every web page (or many of them) are in fact themselves representations\n&gt;  of some abstract thing, and the URI really identifies that thing, not a\n&gt;  docuemnt at all.\n&gt;\n&gt;  Well, that wasn&#39;t the model I had when URIs were invented and HTTP was\n&gt;  written. However, let&#39;s see how it flies. If we stick with the principle\n&gt;  that a URI (or URIref) must unambiguously identify the same thing in any\n&gt;  context, then we come to the conclusion that URIs can not identify the \n&gt; web\n&gt;  page. If a web page is about a car, then the URI can&#39;t be used to refer \n&gt; to\n&gt;  the web page.\n\nIt doesn&#39;t identify both.  It identifies the car.  The web page is\nwhat you GET.  The same URI can then be used, in another context, to\nindirectly identify a representation that was formerly the result of\na GET (which is what caches do when they lookup a response), but the\ncache isn&#39;t even remotely confused between the two because we have\ndefined them as different things.\n\n&gt;  2.1.1 Same URI can identify a web page and a car\n&gt;\n&gt;  What, a web page can&#39;t be a car? At this point a pedantic line reasoning\n&gt;  suggests that we should allow web pages and cars to conceptually overlap,\n&gt;  so that something can be both. This is counterintuitive, as a web page is\n&gt;  in common sense, not a concrete object whereas a car is. But sure, we\n&gt;  could construct a mathematics in which we use the terms rather specially\n&gt;  and something can be at the same time a web page and a car.\n&gt;\n&gt;  Frankly, this doesn&#39;t serve the social purpose of the semantic web, to be\n&gt;  able to deal with common sense concpets and objects. A web page about a\n&gt;  car and a car are in most people&#39;s minds quite distinct (as I argue\n&gt;  further below). A philosophy in which they are identical does not allow \n&gt; me\n&gt;  to distinguish between them. not only conflicts with reality as I see it,\n&gt;  but also leaves us no way to make statements individually about the two\n&gt;  things.\n\nA web page is something that you GET from a resource, not the resource\nitself.\n\nThe only aspect of this that limits the Semantic Web is that it\ncannot pretend the result of a GET and the resource identified by the\nURI that was used to perform the GET are necessarily the same thing,\nwhich is a perfectly reasonable thing to require considering that they\naren&#39;t even the same thing for time-varying documents, let alone cars.\nA URI is an identifier of a resource, not the resource itself.\n\nWhat is necessary for the Semantic Web is that it be able to distinguish\nbetween resources and representations, and further that it can deal with\nthe very common situation where the representation has no known URI\nby which it can be directly referred, because Web sites deliberately\nhide the URI of those resources that they do not wish to be directly\naccessible.  [BTW, Content-Location is not a sufficient fix for this\nproblem simply because the resource provider has no desire to use it.]\n\n&gt;  2.1.2 The URI identifies the car, not the web page\n&gt;\n&gt;  So lets fall back on the idea that the URI identifies the subject of the\n&gt;  web page, but not the web page itself. This makes sense. We can build the\n&gt;  semantic web on top of that easily.\n&gt;\n&gt;  The problem with this is that there are a large number of systems which\n&gt;  already do use URIs to identify the document. This is the whole metadata\n&gt;  world. Think of a few:\n&gt;\n&gt;  * The Dublin Core\n\nuses URI to identify abstract concepts (metadata relationships),\nindirectly obtain sections of a resource that describes, and identify\nother resources that are the target of that relationship.\n\n&gt;  * RSS\n\nuses URI to identify namespaces, indirectly obtain a document\nthat defines a namespace, and other resources that supply\nrepresentations in a given format.\n\n&gt;  * The HTTP headers\n\nrefer to the resource, the representation, or the message, depending\non the definition of the header field.\n\n&gt;  * The Adobe XML system\n\nno idea\n\n&gt;  * Access control systems\n\nalways refer to the resource.\n\nI don&#39;t see any problem.\n\n&gt;  (I&#39;m sticking with the machine-processable languages as examples because\n&gt;  human-processable ones like HTML have a level of ambiguity traditional in\n&gt;  human natural language but quite out of place in the WWW infrastructure \n&gt; --\n&gt;  or the Semantic Web. You can argue that people say &quot;I work for w3.org&quot; or\n&gt;  &quot;http://www.amazon.com/shrdlu?asin=314159265359&quot; is a great book, just as\n&gt;  they happily say &quot;Moby Dick weighs over three thousand tonnes&quot;, &quot;Moby \n&gt; Dick\n&gt;  was finished over a century ago&quot; and &quot;I left Moby Dick on the beach&quot;\n&gt;  without expecting to be misunderstood. So we won&#39;t use human language as \n&gt; a\n&gt;  guide when defining unambiguously the question of what a URI identifies.\n&gt; )\n\nSo you intend to define meaning without reference to humans?  I thought\nthat the purpose of the Semantic Web was to help humans understand\nand operate within the realm of interrelated resources.  What good does\nit do if the human is first required to translate their &quot;real world&quot;\nreference to one that applies to the less-messy-than-the-real-world\nSemantic Web?   I think that is an interface error.\n\n&gt;  Roy Fielding argues the the URI which I associate with his web page\n&gt;  actually identifies him.\n\nNo, I do not.  I never have.  I even explicitly corrected you on\nthis very point while we were in your office talking this over.\nMy home page URI identifies my home page, where I go for a hypertext\nrepresentation of the topics that I am working on so that I can\neasily jump from there to other resources of interest.  It is a\npublic resource so that others can do the same.  Some people use\nthat URI as an indirect way of identifying me, but only in the\nsense that the resource contains more information about me.\nHowever, someone could build a system that accepts the URI of a\nhome page as an indirect identifier of a person and performs some\naction based on that relationship that affects me as a person, such\nas calling my phone number, just as any identifier can be indirectly\nused in ways that are not expected by the identifying authority.\n\nMark Baker has argued in the past that an http URI does identify\nhim, but I think that is reasonable since he owns the naming authority.\nIf you have complete control of the namespace, the identifiers\nwithin it can identify anything provided that you only use them\nconsistently to identify that thing.  I doubt that is the case for\nhis home page URI, but it could be for some other URI.\n\n&gt;  He argues that conventionally people use the\n&gt;  identifier to identify the person. However, consider another Roy Fielding\n&gt;  page put together by freinds who found a photograph of him with no \n&gt; clothes\n&gt;  on. A lot of content filtering systems would collect that URI and put put\n&gt;  into their list. Even though the photo had many represnetations which\n&gt;  different devices could download using content negotiation and/or CC/PP\n&gt;  (color orblack and white and variosu different resolutions) the URI \n&gt; istelf\n&gt;  would be listed as containing nudity. The public are very aware of\n&gt;  different works on the web, even though they have the same topic.\n\nYikes, what an unpleasant mental picture.  Does that identifier provide\nrepresentations of my state, or the state of a nude picture taken at\nsome particular point in time?  The public is capable of distinguishing\nthe two over time, and thus those two resources do not have the same\ntopic/meaning/identity, even though there does exist a relation between\nthe two.  Fortunately, I don&#39;t have &quot;friends&quot; like that.\n\n&gt;  2.2.3 Indirect identification\n&gt;\n&gt;  You can argue that a web page indirectly identifies something, of course,\n&gt;  and I am quite happy with that. If you identify an organization as that\n&gt;  which has home page http://www.w3.org, then you are not saying that\n&gt;  http://www.w3.org/ itself is that organization. This scenario is very \n&gt; very\n&gt;  common, just as we identify people and things by their &quot;unambiguous\n&gt;  properties&quot;: books by ISBN, people by email address, and so forth. So \n&gt; long\n&gt;  as we don&#39;t think that the person is an email address, we are fine. Some\n&gt;  people have thought that in saying &quot;An HTTP URI can&#39;t identify an\n&gt;  organization&quot; I was ruling out this indirect identification, but not so:\n&gt;  I\n&gt;  am very much in favor of it. The whole SQL world, after all, only\n&gt;  identified things indirectly by a key property. This causes no\n&gt;  contradiction. Perhaps I should say &quot;An HTTP URI can&#39;t directly identify\n&gt;  an organization&quot;. But by &quot;identify&quot; I mean &quot;directly identify&quot;, and\n&gt;  &quot;identity&quot; is a fairly direct word and concept, so I will stick with it.\n\nIdentity is not a fairly direct word and concept -- that is why I posted\na very long description of what it means to www-tag, including its\ndefinition according to webster.com.  If this is the source of our\ndisagreement, then I give up.  All identifiers are by their very nature\nan indirect means to establishing identity.\n\nAn http URI, when it is dereferenced, activates a mechanism whereby\nthe string of characters in the URI is used to select a bag of bits\nthat is supposed to represent the state of the abstract thing\nidentified as a resource via the http naming authority.  Does that\nimply that the resource is an HTTP mechanism?  No.  The URI is not\nthe resource, the mechanism is not the resource, and the bag of bits\nis not the resource.  Therefore, an http resource is always\nrestricted to indirect identification.  It is simply impossible to\n&quot;directly&quot; identify a resource for which the representation is\nallowed to change over time.\n\nConsumers don&#39;t give a rat&#39;s ass about the mechanism beyond a desire\nthat it consistently provide representations that match the semantics\nthey intended by referencing it in the first place.  The semantics\nare the resource.  Usually the semantics correspond to a &quot;living\ndocument about a particular subject&quot;, but not always.\n\n&gt;  Conclusion so far: the idea that a URI identifies the thing the document\n&gt;  is about doesn&#39;t work because we can only use a URI to identify one thing\n&gt;  and we have and already do use it to identify documents on the web.\n\nNo, we use it to obtain documents via the Web by identifying a\nresource and asking for a representation of its current state.\nWe indirectly identify information within the representations,\nthe web page, by referring to it as the state obtained by doing\na GET on a resource&#39;s URI.  All http-based Web pages are only\nindirectly identified by http URI, since a Web page is a\nrepresentation obtained at an instance in time and not the\nresource itself.\n\n&gt; 2.2 Author definition\n&gt;\n&gt;  So how can we break free of that line of reasoning? We can try throwing\n&gt;  away the rule that a URI identifies only one thing.\n\nI don&#39;t.\n\n&gt; 2.3 Logic disambiguates\n&gt;\n&gt;  Otherwise,we have to try another way of letting the URI mean sometimes \n&gt; one\n&gt;  thing and sometimes another. Here is another.\n\nNope, not here either.\n\n&gt; 2.4 Different Properties\n&gt;\n&gt;  Actually the URI has to, like in English, identify these different\n&gt;  things ambiguously. Machines have to disambiguate using the fact that\n&gt;  different properties will refer to different levels.\n\nMachines do have to know the realm of identification.  If an identifier\nis used for identifying multiple things in the same realm, then it\nis clearly ambiguous.  However, if the machine knows that it is using\nthe URI in a context that is clearly direct, such as xmlns attributes,\nthen there is no ambiguity just because it is used differently in\nother realms.  It is still better though to remain unambiguous, which\nis the case for the examples I described.  An xmlns attribute doesn&#39;t\naccess the resource -- it only uses the name of the resource as an\nidentifier.  Whether or not the same identifier can be used in a GET\nis irrelevant to the mechanism of xmlns.\n\n&gt; 2.5 Extra info with URI\n&gt;\n&gt;  Actually the URI has to, like in English, identify these different\n&gt;  things ambiguously. Machines have to disambiguate using extra\n&gt;  information which will be provided in other ways along with the URI\n\nNo, that twists the argument. The argument is that people use identifiers\nin an ambiguous way because there is no such thing as universal agreement\nabout the semantics of a resource if the publisher does not make those\nsemantics explicit.  The true nature of a resource cannot be observed at\nany instant in time because its definition depends on how much it varies\nover time, which is outside the perceptive capacity of humans and\nmachines.  The publisher can improve understanding of the semantics\nof a resource by adding external assertions, but the identity of the\nresource itself does not change by those assertions.\n\n&gt; 2.6 Different meaning in different context\n&gt;\n&gt;  Actually the URI has to, like in English, identify these different\n&gt;  things ambiguously. Machines have to disambiguate them by context: A\n&gt;  catalog card will talk about a document. A car catalog will talk about a\n&gt;  car.\n\nThe URI doesn&#39;t identify different things in different contexts.  It is,\nhowever, used for different purposes in different contexts.  An xmlns\nuses the URI of a resource on the Web (or not) to directly identify a\nnamespace whose state may (or may not) be indirectly described by a\nrepresentation found by performing a GET on the resource identified by\nthat URI.  There is no ambiguity here.\n\n&gt; 2.7 Change it for the Semantics Web\n&gt;\n&gt;  They may have been used to identify documents up till now, but for RDF\n&gt;  and the Semantic Web, we should change that and start to use them as the\n&gt;  Dublin Core and RDF Core groups have for abstract concepts.\n\nThere is no need.  In any case, the world doesn&#39;t need another AI system\nfor describing semantic networks in isolation -- they are only useful\nwhen they are allowed to be enmeshed in the real world.\n\n&gt; 2.8 Abandon any identification of abstract things\n\nI can&#39;t imagine anything more abstract than an identifier that identifies\n&quot;Roy&#39;s favorite quote from TimBL&quot;, which is bound to change over time.\nI refuse to let anyone stick an HTTP server in my head just because that\nis the only way to directly identify that resource.  They will have to\nmake do with a URI that I control, wherein I manage an appropriate\nmapping and occasionally drop a bag of bits that represents the\nlast recorded value of the resource.\n\n&gt; 3. Conclusion\n&gt;\n&gt;  I didn&#39;t have this thought out a few years ago. It has only been in\n&gt;  actually building a relatively formal system on top of the web\n&gt;  infrastructure that I have had to clarify these concepts my own mind. I \n&gt; am\n&gt;  forced to conclude that modeling the HTTP part of the web as a web of\n&gt;  abstract documents if the only way to go which is practical and, by the\n&gt;  philosophical underpinnings of the WWW, tenable.\n\nI still disagree, particularly since you still haven&#39;t described how\nyou can hold that position for resources that are clearly not documents,\nnamely the resources that are service gateways to other systems.  POST\ndoes not always mean &quot;append to this document&quot;.  Oh, wait ...\n\n&gt;  Q: Some HTTP URIs can be POSTed to. Can you still say they identify\n&gt;  documents?\n&gt;\n&gt;  A: Wel, some HTTP URIs can&#39;t be accessed at all, and some access is not\n&gt;  allowed, and yes, some URIs are not only documents but also can be posted\n&gt;  to. So they object is more complex than simply a document. But that it \n&gt; has\n&gt;  this extra functionality doesn&#39;t make it any less a HTTP document\n&gt;  formally. Something can have extra features and still remain in the same\n&gt;  class of things.\n\nThat makes no sense to me at all.  There is no stretch of the imagination\nthat would allow an HTTP POST to a URI that consistently identifies an\nHTTP-to-GSM SMS message gateway to be formally equivalent to a document.\nREST defines the message to be a representation of a document and the\nservice to be a resource that consumes representations, resulting in\na state change in the service that is reflected in the response message.\nOne could claim that the state of all SMS messages flying though the\nGSM network is identified by this URI, and that therefore we are only\nappending to that state, but that clearly is not the intention of the\npublisher of the URI and is not consistent with the result of a GET\non that same URI, and is certainly not useful for reasoning about the\ninteraction.  It is an invalid model of the system.\n\nCheers,\n\nRoy T. Fielding, Chief Scientist, Day Software\n                  (roy.fielding@...) &lt;http://www.day.com/&gt;\n\n                  Chairman, The Apache Software Foundation\n                  (fielding@...)  &lt;http://www.apache.org/&gt;\n\n----- End forwarded message -----\n\n"}}