{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":80827773,"authorName":"Seairth Jacobs","from":"&quot;Seairth Jacobs&quot; &lt;seairth@...&gt;","profile":"seairthjacobs","replyTo":"SENDER","senderId":"Dwr-k9YL9JAkF91Pn1iIyFH3hLIZL-1TYkdB6pVkTU-loujXn2nU7V9nNpIFPaeaT5d65plEF7RilrpW5vsgx5e4JcWKY7BV2j0pAOs","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] what is state?","postDate":"1031427087","msgId":2431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWMyNTZhNSQyYTY0YjFmMCQ2NTAwYThjMEBzZWFpcnRobGFwdG9wPg==","referencesHeader":"PDAwMmEwMWMyNTViYiRkZGVkNThjMCQ2NTAwYThjMEBzZWFpcnRobGFwdG9wPiA8M0Q3OTg3REYuMTAyMDkwNUBwb25kLmNvbT4="},"prevInTopic":2426,"nextInTopic":2432,"prevInTime":2430,"nextInTime":2432,"topicId":2410,"numMessagesInTopic":36,"msgSnippet":"From: Chuck Hinson  ... However, ... different ... I have not problem with that.  At this point, I would consider state and resource","rawEmail":"Return-Path: &lt;seairth@...&gt;\r\nX-Sender: seairth@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_1_0_1); 7 Sep 2002 19:30:43 -0000\r\nReceived: (qmail 60148 invoked from network); 7 Sep 2002 19:30:43 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m9.grp.scd.yahoo.com with QMQP; 7 Sep 2002 19:30:43 -0000\r\nReceived: from unknown (HELO mail.bbglobex.com) (208.251.163.4)\n  by mta2.grp.scd.yahoo.com with SMTP; 7 Sep 2002 19:30:46 -0000\r\nReceived: from seairthlaptop [68.10.252.24] by mail.bbglobex.com with ESMTP\n  (SMTPD32-7.12) id A2D24D7100E8; Sat, 07 Sep 2002 15:26:10 -0400\r\nMessage-ID: &lt;001401c256a5$2a64b1f0$6500a8c0@seairthlaptop&gt;\r\nTo: &quot;rest-discuss&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;002a01c255bb$dded58c0$6500a8c0@seairthlaptop&gt; &lt;3D7987DF.1020905@...&gt;\r\nSubject: Re: [rest-discuss] what is state?\r\nDate: Sat, 7 Sep 2002 15:31:27 -0400\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 6.00.2600.0000\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2600.0000\r\nFrom: &quot;Seairth Jacobs&quot; &lt;seairth@...&gt;\r\nX-Yahoo-Group-Post: member; u=80827773\r\nX-Yahoo-Profile: seairthjacobs\r\n\r\nFrom: &quot;Chuck Hinson&quot; &lt;cmhinson@...&gt;\n&gt;\n&gt; Seairth Jacobs wrote:\n&gt;\n&gt; &gt;In all of these conversations, we keep speaking of resource state.\nHowever,\n&gt; &gt;I am losing all understanding of what resource state actually is...\n&gt; &gt;\n&gt; &gt;A resource has a state. One can only retrieve a representation of the\n&gt; &gt;current state of a resource.\n&gt; &gt;\n&gt; &gt;But then we are told that we can receive different representations of the\n&gt; &gt;same state.  For instance, the same resource could be returned in\ndifferent\n&gt; &gt;spoken languages or in different content-types.  However, these are both\n&gt; &gt;indicated by HTTP headers and not within the returned entity itself.\n&gt; &gt;\n&gt; What is the problem with that?  If the resource is &#39;the temperature at\n&gt; which water freezes&#39; then there are at least two representations: 32\n&gt; degrees Farenhiet or 0 degrees Celsius.  (Ignore for now how the server\n&gt; decides which representation to deliver.)\n\nI have not problem with that.  At this point, I would consider &quot;state&quot; and\n&quot;resource&quot; to be one and the same.\n\n&gt; &gt;\n&gt; &gt;However, it you look at the infamous &quot;hit counter&quot;, the returned entity\n&gt; &gt;could differ between calls.  But it seems to me that people are saying\nthat\n&gt; &gt;the state hasn&#39;t necessarily changed.\n&gt; &gt;\n&gt; &gt;If this is true, then it seems to me that the concept of &quot;state&quot; is more\nof\n&gt; &gt;a logical (?) concept than a physical (?) concept.\n&gt; &gt;\n&gt;\n&gt; If I understand your distinction between logical and physical, then I\n&gt; would say that not only is &quot;state&quot; a logical concept, but so is\n&gt; &quot;resource&quot;.  The only thing that is &quot;physical&quot; is the representation.\n\nSure, I too believe that &quot;resources&quot; only logically exist.  It is not\npossible for a client to *know* the physical format of what makes up the\n&quot;resource&quot;.\n\n\nI realize after reading my original post that I wasn&#39;t very clear in my\nthoughts.  So, I&#39;ll try again...\n\n\nIn REST, we have three things (of interest to this topic):\n\n1) Resource : we all agree that a resource is something identified by a URI.\nThe resource itself is only a concept.  It may or may not have a one-to-one\nrelationship with a &quot;physical&quot; entity (file, purchase order, person, car,\netc.).  For instance, one could have a purchase order stored in multiple\ntables on a remote SQL server and we would still be able to consider the PO\nas a resource.  Also, it is possible for more than one URI to identify the\nsame resource.\n\n2) Representation : when one requests a resource, it can never be given the\nactual resource.  Instead, the request gets back a representation of the\nresource.  This representation is unique to the request URI (though more\nthan one URI could return unique representations that are byte-wise\nidentical).  An important point here is that &quot;representation&quot; only has\nmeaning in context to a response from the server.  In other words, one\ncannot speak of sending a representation in a request.\n\n3) State : what is state?  On the one hand, I think of state in the\n&quot;traditional&quot; sense, which just means &quot;what the resource is at a given\nmoment in time (usually &#39;now&#39;)&quot;.  But it is not possible to know what the\nstate of a resource is.  All that one can know is the representation\nreturned, which is presumably the &quot;current state&quot;.  In fact, all that is\never visible is the &quot;current state&quot;.  From what I&#39;ve read so far, there&#39;s\nnothing in REST itself with clearly defines how to know when &quot;state&quot; has\nchanged.  This is left up to the application.\n\nThe other way of thinking of state it to related it to &quot;representation&quot;\ninstead.  In other words, under this view, all that a client knows is the\nstate of a resource, not the resource itself.  When we PUT an entity, we are\nPUTting &quot;the current state&quot; of a resource and not the resource itself.  When\nwe use GET, we get back a &quot;representation of the state of the resource&quot;, not\nthe resource itself.  This view certainly makes it more clear what &quot;state&quot;\nis, but it also raises some questions.\n\n    a) RFC2616 Section 9.6 (PUT) talks about the ability of a client to\nrequest the creation of a resource located at the Request-URI.  Now, in term\ns of REST, would it be more appropriate to say that the client is requesting\nthe creation of a resource whose initial state is that of the\nrequest-entity?\n\n    b) If you have two URIs identifing the same resource, suppose the\nfollowing sequence:\n\n        PUT &lt;entity&gt; uri1\n        GET uri1\n        PUT &lt;entity2&gt; uri2\n        GET uri1\n\n        We would agree that the state of the resource changed after each PUT\nrequest.  However, it would still be possible for the second GET to return a\nbyte-wise identical representation as the first GET.  How would we know that\nthe state changed?  Or is this scenario not allowed when using PUT?  Can\nthis only happen with POST?\n\n    c) When issuing a DELETE against a URI, are we deleting the current\nstate or the resource itself? [note: In an earlier post, I had suggested\nthat the DELETE was actually deleting the identity (i.e. the relationship of\nthe URI to the resource).  It was up to the server to delete the resource or\nnot.]\n\n    d) Does a URI identify the state of a resource or the resource itself?\n\n\n\n\n&lt;sigh&gt;well, I had to step away again and have lost my train of thought...\nagain.  re-reading what I wrote hasn&#39;t helped, so I will stop here.&lt;/sigh&gt;\n\nI guess the nutshell version of all of the above is that &quot;state&quot; obviously\nhas a place in the REST (it&#39;s even in the name!).  But I am not\nunderstanding how it fits.  I have all sorts of individual notions of how\n&quot;state&quot; may be used, but none of them really work with each other and they\nall bring up questions that cause the REST model to be unclear in other\nareas.\n\nNow, I realize that this could also be due to the fact that we use HTTP 1.1\nas a RESTful example.  I am beginning to wonder if this is not so much the\ncase as we are led to believe.  Or it could be that the things I am asking\nabout and the questions I have are mostly &quot;edge cases&quot; and therefore less\nlikely to be an issue for 80% of the people who will use REST....\n\n---\nSeairth Jacobs\nseairth@...\n\n\n"}}