{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":98624433,"authorName":"bhaugen32","from":"&quot;bhaugen32&quot; &lt;bhaugen32@...&gt;","profile":"bhaugen32","replyTo":"SENDER","senderId":"ODDW5DLOcjQ-V9zXYpUPzQDCx1KO1nMQi1jrfVX414zbjLVDbmgWksUoKgwg7k9rOLpCqUgU3H_TIfQixBaaU-nPt2iNOVPz","spamInfo":{"isSpam":false,"reason":"0"},"subject":"conversation (was client-side) state","postDate":"1036798293","msgId":2828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFxaGhnbCtpdGRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDIxMTA4MTMxNzI1LkgxOTM3OEB3d3cubWFya2Jha2VyLmNhPg=="},"prevInTopic":2821,"nextInTopic":0,"prevInTime":2827,"nextInTime":2829,"topicId":2812,"numMessagesInTopic":6,"msgSnippet":"I m still thinking in terms of conversational state. Maybe I spent too much time in ebXML, don t know. But it still seems to me that if everything gets modeled","rawEmail":"Return-Path: &lt;bhaugen32@...&gt;\r\nX-Sender: bhaugen32@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 8 Nov 2002 23:31:34 -0000\r\nReceived: (qmail 80939 invoked from network); 8 Nov 2002 23:31:34 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m3.grp.scd.yahoo.com with QMQP; 8 Nov 2002 23:31:34 -0000\r\nReceived: from unknown (HELO n4.grp.scd.yahoo.com) (66.218.66.88)\n  by mta3.grp.scd.yahoo.com with SMTP; 8 Nov 2002 23:31:34 -0000\r\nReceived: from [66.218.67.177] by n4.grp.scd.yahoo.com with NNFMP; 08 Nov 2002 23:31:34 -0000\r\nDate: Fri, 08 Nov 2002 23:31:33 -0000\r\nTo: rest-discuss@yahoogroups.com\r\nSubject: conversation (was client-side) state\r\nMessage-ID: &lt;aqhhgl+itdj@...&gt;\r\nIn-Reply-To: &lt;20021108131725.H19378@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4465\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;bhaugen32&quot; &lt;bhaugen32@...&gt;\r\nX-Yahoo-Group-Post: member; u=98624433\r\nX-Yahoo-Profile: bhaugen32\r\n\r\nI&#39;m still thinking in terms of conversational state.\n\nMaybe I spent too much time in ebXML, don&#39;t know.\n\nBut it still seems to me that if everything gets modeled as business-\nsemantic concepts and speech acts, and both business-semantic \nconcepts and speech acts are implemented as Web resources, then the \nstate of the conversation is represented by the speech acts that have \nbeen &quot;uttered&quot;.\n\nI haven&#39;t written down all my thoughts on this in any accessible way, \nbut this document might give an idea:\nhttp://www.openebxml.org/information/papers/ecomo02stockholm.pdf \n\nIt&#39;s framed in terms of an ebXML-like model (EDI mailbox-style \nmessages), but one of my goals in joining Rest-discuss was to reframe \nthe speech acts and economic concepts as REST resources.\n\n&lt;excerpt&gt;\n5.1 Pragmatic Actions\nThe basic notion introduced for relating business actions to economic \nconcepts is that of a pragmatic action, see Fig. 5. A Pragmatic \nAction is a speech act, as defined in Section 2, and consists of two \nparts: a content and an illocutionary force. \n\nIn ecommerce applications, the content is always an economic concept. \nThe illocutionary force of a pragmatic action indicates in what way \nthe action is related to its content.\n\nAn agent can perform a pragmatic action and thereby influence an \neconomic concept in a specific way.\n\nDepending on which economic concept a pragmatic action addresses, \ndifferent illocutionary forces are applicable. The pragmatic actions \nare, therefore, divided into several subclasses as indicated in Fig. \n5. The three main subclasses are information actions, deontic \nactions, and fulfilment actions. The underling intuition for \nidentifying these three sub classes of pragmatic actions is that in \nan e-commerce scenario, trading partners exchange business \ninformation, then establish different obligations, and finally \nexchange economic resources, thereby fulfilling the obligations.\n[...]\nA Fulfilment Action has an economic event as its content. The action \nmay declare that an Economic Event has been performed, or it may \nexpress that such a declaration is accepted or rejected. There are \nthree possible illocutionary forces for information actions: Declare \nstates that an economic event has been performed, Accept states that \na preceding declaration of performing an economic event is accepted, \nReject states that such a declaration is rejected. Examples of \nfulfilment actions are &quot;declare shipment completed&quot; and &quot;accept \nshipment&quot;.\n\nA Deontic Action can have a commitment or contract as its content. \nThus, a deontic action concerns obligations to carry out events in \nthe future. There are seven possible illocutionary forces for deontic \nactions: Propose means that an agent proposes the establishment of a \ncommitment or contract. Accept is the acceptance of such a proposal \nwhile Reject is the rejection of a preceding proposal, Request-\nCancellation is a request to cancel an established commitment or \ncontract, AcceptCancellation is the acceptance of such a request, \nwhile RejectCancellation is the rejection of a preceding request to \ncancel, Cancel is a unilateral cancellation.\n\nExamples of Deontic Actions are &quot;request purchase order&quot; and &quot;accept \npurchase order request&quot;.\n&lt;/excerpt&gt; \n\nIt&#39;s clear that some of their Actions should just be GETs.\n\nCommitment and Fulfillment actions are the ones that seem to me to be \nthe basis for making business conversations into resource models.  \nThe state of the conversation is the combination of the Pragmatic \nActions uttered and the states of the economic concepts they \naffected.  \n\nThere&#39;s two levels:  the utterances and their relationships (e.g. \nOffer and Acceptance utterances refer to an Order, Fulfillment \nactions refer to the Order they fulfill, etc.\n\nI think what this means in REST terms is that Pragmatic Actions would \nbe POSTed as statements and result in the creation or updating of \neconomic concept resources, but the Pragmatic Actions would \nthemselves become resources and could refer to each other.  For \nexample, an Accept statement would need to refer to an Offer or \nAssertion statement.\n\nWith a small number of economic concepts and statements and \nrelationships, it would be possible to configure conversations on the \nfly from hyperlinked Web resources, and know what the state of the \nconversation was by examining the resources.\n\nStill not quite soup yet, but coming along, as I get time and figure \nout the details.\n\n-Bob Haugen\n\n\n\n"}}