{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":139691997,"authorName":"Tyler Close","from":"Tyler Close &lt;tyler@...&gt;","profile":"tjclose","replyTo":"SENDER","senderId":"29wJw4wcdL7GwnZhd6BRI4stt2hFKr7v5Mi32PcpVxfrOfkn2UUU5IRQQhxIDqQqSI_mb6DQDwP7CueZDWpapYRpSpaNntA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] W3C Note - User Agent Authentication FORM elements","postDate":"1046748595","msgId":3470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxOHEzN3QtMDAwMnM3LTAwQGNhbnRlZW4+","inReplyToHeader":"PDNFNjNGQTZFLjMwOTAxMDNAcG9uZC5jb20+","referencesHeader":"PFBpbmUuTE5YLjQuNDAuMDMwMzAzMTYyODEyMC4yODgzLTEwMDAwMEBjb2xvc3N1cy5pMng+IDxFMThweXd4LTAwMDJvUC0wMEBjYW50ZWVuPiA8M0U2M0ZBNkUuMzA5MDEwM0Bwb25kLmNvbT4="},"prevInTopic":3469,"nextInTopic":3471,"prevInTime":3469,"nextInTime":3471,"topicId":3351,"numMessagesInTopic":49,"msgSnippet":"... The link between the two topics is that HTTP Authentication is also not terribly helpful for implementing access control. Switching to capabilities","rawEmail":"Return-Path: &lt;tyler@...&gt;\r\nX-Sender: tyler@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 4 Mar 2003 03:46:48 -0000\r\nReceived: (qmail 17384 invoked from network); 4 Mar 2003 03:46:47 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m3.grp.scd.yahoo.com with QMQP; 4 Mar 2003 03:46:47 -0000\r\nReceived: from unknown (HELO canteen) (209.88.232.43)\n  by mta3.grp.scd.yahoo.com with SMTP; 4 Mar 2003 03:46:46 -0000\r\nReceived: from canteen ([127.0.0.1] helo=there)\n\tby canteen with smtp (Exim 3.35 #1 (Debian))\n\tid 18q37t-0002s7-00\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Mon, 03 Mar 2003 23:29:57 -0400\r\nContent-Type: text/plain;\n  charset=&quot;iso-8859-1&quot;\r\nTo: rest-discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nSubject: Re: [rest-discuss] W3C Note - User Agent Authentication FORM elements\r\nDate: Mon, 3 Mar 2003 23:29:55 -0400\r\nX-Mailer: KMail [version 1.3.2]\r\nReferences: &lt;Pine.LNX.4.40.0303031628120.2883-100000@colossus.i2x&gt; &lt;E18pywx-0002oP-00@canteen&gt; &lt;3E63FA6E.3090103@...&gt;\r\nIn-Reply-To: &lt;3E63FA6E.3090103@...&gt;\r\nMIME-Version: 1.0\r\nContent-Transfer-Encoding: 8bit\r\nMessage-Id: &lt;E18q37t-0002s7-00@canteen&gt;\r\nFrom: Tyler Close &lt;tyler@...&gt;\r\nX-Yahoo-Group-Post: member; u=139691997\r\nX-Yahoo-Profile: tjclose\r\n\r\nOn Monday 03 March 2003 20:59, Chuck Hinson wrote:\n&gt; I should note first, that I&#39;m a bit confused where this thread is going.\n&gt;  It seems to me that we started by bitching about how browsers aren&#39;t\n&gt; terribly helpful with HTTP authentication.  Somehow, we&#39;ve ending up\n&gt; talking about capabilities-based security,\n\nThe link between the two topics is that HTTP Authentication is\nalso not terribly helpful for implementing access control.\nSwitching to capabilities improves your GUI, your application\ndesign and your security.\n\n&gt; which you have already\n&gt; indicated isn&#39;t really the best choice for the majority of what&#39;s on the\n&gt; web today.\n\nThat is not the impression I intended to convey. Capability-based\nsecurity is the best choice for implementing access control. Both\ncapabilities *and* ACLs fail to implement DRM, so you might as\nwell stick with ACLs for DRM hacks. (More on this at the end of\nthe message.)\n\n&gt; I think part of the problem I have is that with a capability model, it\n&gt; seems that you end up with everyone having their own private web of\n&gt; resources rather than having a public web of resources that are sharable\n&gt; with others.\n\nWell, that&#39;s kinda the whole point of access control isn&#39;t it? Do\nyou want your bank account to be part of the public web of\nresources?  If so, please send me the first link. ;)\n\nThe point of access control is to create private webs of\nresources, with finely controlled links between them. Capabilities\nare an excellent tool for implementing this.\n\n&gt; As a result, you&#39;ve lost the ability for people to connect\n&gt; those resources together in new ways to create new things on the web.\n\nExactly the opposite.  What you&#39;ve done is empowered people to\nsecurely connect those resource that they want connected. The ACL\nmodel prevents this.\n\nJust as an example, why don&#39;t you post to this list a link to a\nwithdrawal record from your online bank account. With the current\ninterface, this is not possible: you can&#39;t do it without also\nposting the password for your entire account. If your bank account\nwas implemented with a capability-based security model, posting\nthe withdrawal record link would be no problem.  Capabilities\nenable you to create links.  ACLs prevent you from creating links.\n\n&gt; &gt;There are solutions to this, but first I&#39;ll point out that this\n&gt; &gt;issue doesn&#39;t apply to software programs.  &quot;Web services&quot; address\n&gt; &gt;program to program communication. Programs have a stack and a heap\n&gt; &gt;to help them keep track of what they&#39;ve got and what they&#39;re\n&gt; &gt;doing. A program doesn&#39;t &quot;navigate back&quot;, it just dereferences a\n&gt; &gt;variable.\n&gt;\n&gt; I&#39;m not sure I&#39;d agree that &quot;web services&quot; is about program to program\n&gt; communication.  I&#39;m sure there are a lot of &quot;web services&quot; where there&#39;s\n&gt; only a program at one end and some things that look like documents or\n&gt; document processors at the other end.  &quot;Program-to-program\n&gt; communication&quot; the way you  seem to be using it sounds a lot like an RPC\n&gt; model to me, and in my mind REST and RPC don&#39;t mix.\n\nIs it your contention that program to program communication is RPC\nand therefore not REST? If so, this has grave implications for any\nthoughts of business integration with REST.\n\nMy only point from the quoted paragraph is that browser GUI issues\ndo not apply to software integration through REST.\n\n&gt; &gt;It&#39;s also easy to implement &quot;navigate back&quot; from within a web\n&gt; &gt;browser interface to the application. The simplest answer is just:\n&gt; &gt;&quot;Use the &#39;back&#39; button to navigate &#39;back&#39;.&quot;.\n&gt;\n&gt; This is an example of poor usability.\n\nIn which case the more sophisticated techniques I layed out next\nare appropriate.\n\n&gt; Further, what if I&#39;ve got that page bookmarked?\n\nBookmark the page that you want to bookmark. If you want to\nbookmark the top level page, bookmark the top level page.\n\n&gt; So how do you establish an initial context (or whatever its called) in a\n&gt; capability-based system without doing authentication?\n\nYour initial context is whatever set of URIs you start with. If\nyour program is an XSLT stylesheet, your initial context is the\nset of URIs in the input XML document.\n\n&gt; &gt;&gt;If I am the WSJ, how do I restrict access while\n&gt; &gt;&gt;at the same time allow users to refer to the same\n&gt; &gt;&gt;document?\n&gt; &gt;\n&gt; &gt;You were the one who suggested this design, not me. This is now\n&gt; &gt;the third time that I have said that this is a bad idea. You would\n&gt; &gt;not use the capability model to solve this problem.\n&gt;\n&gt; I&#39;m not disagreeing, but how about giving an example of something\n&gt; (web-based) that you would use a capability model to solve.\n\nI did. Your web-based bank account.\n\n&gt; &gt;There&#39;s a long explanation that I could go into on this, but I&#39;ll\n&gt; &gt;just give you the punch line. The WSJ scenario is *not* an access\n&gt; &gt;control problem, it is a DRM (Digital Restrictions Management)\n&gt; &gt;problem. The capability model is used for solving access control\n&gt; &gt;problems, not DRM problems.\n&gt;\n&gt; Well, you may just have go into your long explanation, because if DRM\n&gt; isn&#39;t about controlling access, then I&#39;m pretty confused.\n\nAccess control is about controlling what authority you hand out.\nDRM is about controlling how people use authority they have\nalready been given.\n\nIn the WSJ scenario, a subscribed user is given the authority to\nread WSJ articles. The read authority implicitly carries with it\nthe authority to pass-on the article to others. If you can read\nbits, you can copy bits. Neither capabilities nor ACLs can prevent\nyou from giving a WSJ article to someone who is not a WSJ\nsubscriber. The best you can do is make it less convenient to\nshare the article. That is all the WSJ ACL does. It is just a\nfeeble DRM measure.\n\nFortunately, business integration and trading is about access\ncontrol, not DRM. Capabilities are ideal for this.\n\nTyler\n\n"}}