{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":4849001,"authorName":"S. Alexander Jacobson","from":"&quot;S. Alexander Jacobson&quot; &lt;alex@...&gt;","profile":"shop2it","replyTo":"SENDER","senderId":"QT-n6Ywqyx16W0ftLD5z1bHHeG1-fj0PjBGULPROGtm4BVQmXIrQNhDYWSnc9Jq0xDYFYwVcmnljp0dhcBEz_vwEtUoW2QhH79pxzQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] W3C Note - User Agent Authentication FORM elements","postDate":"1046818533","msgId":3472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBpbmUuV05ULjQuNDMuMDMwMzA0MTcyMjI3MC4xMDcyLTEwMDAwMEBmYW5hdGljPg==","inReplyToHeader":"PDNFNjQzRjA3LjgwMDA4MDVAcG9uZC5jb20+"},"prevInTopic":3471,"nextInTopic":3476,"prevInTime":3471,"nextInTime":3473,"topicId":3351,"numMessagesInTopic":49,"msgSnippet":"As the guy on the fence, here is my review of the state of play so far: 1. There is an obvious conflict between UI and capabilities.  It is obviously better to","rawEmail":"Return-Path: &lt;alex@...&gt;\r\nX-Sender: alex@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 4 Mar 2003 22:48:48 -0000\r\nReceived: (qmail 21657 invoked from network); 4 Mar 2003 22:48:47 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m11.grp.scd.yahoo.com with QMQP; 4 Mar 2003 22:48:47 -0000\r\nReceived: from unknown (HELO mail.vo.com) (208.45.6.99)\n  by mta2.grp.scd.yahoo.com with SMTP; 4 Mar 2003 22:48:47 -0000\r\nX-Envelope-From: alex@...\r\nX-Envelope-To: &lt;rest-discuss@yahoogroups.com&gt;\r\nReceived: from fanatic (66-108-201-235.nyc.rr.com [66.108.201.235])\n\tby mail.vo.com (8.12.8/8.12.1) with ESMTP id h24MmjRs023623\n\t(version=TLSv1/SSLv3 cipher=EXP1024-RC4-SHA bits=56 verify=NO)\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Tue, 4 Mar 2003 17:48:46 -0500\r\nDate: Tue, 4 Mar 2003 17:55:33 -0500 (Eastern Standard Time)\r\nTo: rest-discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nSubject: Re: [rest-discuss] W3C Note - User Agent Authentication FORM elements\r\nIn-Reply-To: &lt;3E643F07.8000805@...&gt;\r\nMessage-ID: &lt;Pine.WNT.4.43.0303041722270.1072-100000@fanatic&gt;\r\nX-X-Sender: alex@...\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII\r\nX-eGroups-From: &quot;S. Alexander Jacobson&quot; &lt;alex@...&gt;\r\nFrom: &quot;S. Alexander Jacobson&quot; &lt;alex@...&gt;\r\nX-Yahoo-Group-Post: member; u=4849001\r\nX-Yahoo-Profile: shop2it\r\n\r\nAs the guy on the fence, here is my review of the\nstate of play so far:\n\n1. There is an obvious conflict between UI and\ncapabilities.  It is obviously better to have\nthe option of having back links on a page rather\nthan being forced to play with frames.  But in\npractice this conflict is not large because the\napplication designer can offer links to\n&quot;safe-to-share&quot; URLs that don&#39;t link back and in\npractice, you rarely want to share access-control\ninformation (as distinct from DRM info).\nAdvantage: HTTP-Auth +.5\n\n2. The practical advantage of capabilities is not\nin sharing data, it is in manipulating it.  If I\nsimply want to share data in a HTTP auth world, I\ncan simply email it.  The only reason capabilities\noffer an advantage over HTTP-Auth is if I need to\noffer another POST/PUT/DELETE on the data and\ndon&#39;t want to go through some annoying ACL update\nprocess to get there.\nNote: if the data is large and complex then you\nmay want a viewer URL, in which case capabilities\nare superior in this repect as well.\nAdvantage: Capabilities +.5\n\n3. Access Control and DRM are different\napplications.  Capabilities and HTTP-AUTH both\nsuck for DRM.  Capabilities are arguably better\nfor DRM because you can put a link on the page\nthat exposes the sender to harm if shared too\nwidely (but then you have to educate the user\nabout the risks of sharing)\nAdvantage Capabilities +.5\n\n4. Getting to a user-specific starting\npoint requires some authentication process.\nSo either you use the standard HTTP-auth process\nor something application specific.  Interop makes\nHTTP-auth preferable, however there is no reason\nthat that presentation of an HTTP-auth credential\ndoes not simply redirect you to a capability\ngraph.  Public login points are shared.  The\nresulting URLs are not (like the bank session-id).\nAdvantage HTTP-auth +.5 Capabilities +.5\n\n4. Many uses of HTTP-AUTH appeare unRESTful?\n&gt; https://www.bank.com/myaccounts/savings/register\n&gt;\n&gt; With http auth, I can give this URL to everyone who has an account at\n&gt; the bank, and that URI means the same thing to all of them - the page\n&gt; that shows the viewer the last 20 entries in their savings account register.\n&gt; I can put that link in a set of help pages that are not protected by any\n&gt; access controls (and that don&#39;t need to be dynamically rendered).  I can\n&gt; bookmark that page and always go straight to it (modulo a login\n&gt;  prompt).  I can send that link to a friend who also has an account at\n&gt; the same bank (to tell him how to get to his saving account register).\n\nShouldn&#39;t a URL uniquely identify a resource?\nHaving the content of the resource be completely\ndifferent depending on the login information\nseems... wrong.\n\nAt minimum you POST authentication information to\na URL and should then get back a redirect to\nunique URL for your savings register.\n\nThe URL you should share would be this POST url\nnot the URL of your actual data....\n\nAdvantage Capabilities +.5\n\nSo, in practice, it looks like the answer is both.\n\n-Alex-\n\n___________________________________________________________________\nS. Alexander Jacobson                   i2x Media\n1-212-787-1914 voice                    1-603-288-1280 fax\n\nOn Tue, 4 Mar 2003, Chuck Hinson wrote:\n\n&gt;\n&gt;\n&gt; Tyler Close wrote:\n&gt;\n&gt; &gt;On Monday 03 March 2003 20:59, Chuck Hinson wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;I should note first, that I&#39;m a bit confused where this thread is going.\n&gt; &gt;&gt; It seems to me that we started by bitching about how browsers aren&#39;t\n&gt; &gt;&gt;terribly helpful with HTTP authentication.  Somehow, we&#39;ve ending up\n&gt; &gt;&gt;talking about capabilities-based security,\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;The link between the two topics is that HTTP Authentication is\n&gt; &gt;also not terribly helpful for implementing access control.\n&gt; &gt;\n&gt; Which isn&#39;t surprising since its HTTP _Authentication_.  But that&#39;s\n&gt; neither here nor there.\n&gt;\n&gt; &gt;Switching to capabilities improves your GUI, your application\n&gt; &gt;design and your security.\n&gt; &gt;\n&gt; &gt;\n&gt; I&#39;ll take your word on the security bit.  I&#39;m not convinced of the other\n&gt; two.  I get the feeling that you&#39;d just end up trading one set of\n&gt; problems for another.  But again, that&#39;s neither here nor there.\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;which you have already\n&gt; &gt;&gt;indicated isn&#39;t really the best choice for the majority of what&#39;s on the\n&gt; &gt;&gt;web today.\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;That is not the impression I intended to convey. Capability-based\n&gt; &gt;security is the best choice for implementing access control. Both\n&gt; &gt;capabilities *and* ACLs fail to implement DRM, so you might as\n&gt; &gt;well stick with ACLs for DRM hacks. (More on this at the end of\n&gt; &gt;the message.)\n&gt; &gt;\n&gt; &gt;\n&gt; So then, I don&#39;t understand your comment from an earlier message:\n&gt; &lt;quote&gt;... you&#39;re right, you wouldn&#39;t use this model to give everyone\n&gt; their own URI to a single, shared, read-only resource. &lt;/quote&gt;\n&gt;\n&gt; As far as I am able to observe, an awful lot of the web consists of\n&gt; shared, read-only resources.  Are you saying that access control isn&#39;t\n&gt; necessary for shared, read-only resources?\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;I think part of the problem I have is that with a capability model, it\n&gt; &gt;&gt;seems that you end up with everyone having their own private web of\n&gt; &gt;&gt;resources rather than having a public web of resources that are sharable\n&gt; &gt;&gt;with others.\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;Well, that&#39;s kinda the whole point of access control isn&#39;t it? Do\n&gt; &gt;you want your bank account to be part of the public web of\n&gt; &gt;resources?  If so, please send me the first link. ;)\n&gt; &gt;\n&gt; &gt;\n&gt; https://www.accountlink.pncbank.com/index.html  :-)\n&gt;\n&gt; Unfortunately, its not a good example because the frame that actually\n&gt; shows my account info has a URL that simply has a session id encoded in\n&gt; it.  Besides, I&#39;m really not interested in sharing my bank account info.\n&gt;\n&gt; A more useful example would be something like\n&gt;\n&gt; https://www.bank.com/myaccounts/savings/register\n&gt;\n&gt; With http auth, I can give this URL to everyone who has an account at\n&gt; the bank, and that URI means the same thing to all of them - the page\n&gt; that shows the viewer the last 20 entries in their savings account register.\n&gt;\n&gt; I can put that link in a set of help pages that are not protected by any\n&gt; access controls (and that don&#39;t need to be dynamically rendered).  I can\n&gt; bookmark that page and always go straight to it (modulo a login\n&gt;  prompt).  I can send that link to a friend who also has an account at\n&gt; the same bank (to tell him how to get to his saving account register).\n&gt;  I can distribute a tool that somehow processes the info from a savings\n&gt; account register at my bank without requiring each user configure the\n&gt; tool with their private URI.\n&gt;\n&gt; Note that I&#39;m not suggesting that this is a good solution for accessing\n&gt; bank accounts - it just illustrates the idea of a public, sharable URI.\n&gt;  My understanding of the capability model leads me to conclude that I\n&gt; can&#39;t do anything like the above because every user would have to have\n&gt; their own URI.\n&gt;\n&gt; &gt;The point of access control is to create private webs of\n&gt; &gt;resources, with finely controlled links between them. Capabilities\n&gt; &gt;are an excellent tool for implementing this.\n&gt; &gt;\n&gt; &gt;\n&gt; I dont disagree.  But it appears to me that the private web that is\n&gt; created is only useful to one individual.  What about groups of people?\n&gt;  If the answer is that everyone in the group shares the same, private\n&gt; URI, then how do I revoke access to just one member of the group. (I\n&gt; suspect your answer to this is going show that I don&#39;t understand the\n&gt; capability model after all.)\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;As a result, you&#39;ve lost the ability for people to connect\n&gt; &gt;&gt;those resources together in new ways to create new things on the web.\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;Exactly the opposite.  What you&#39;ve done is empowered people to\n&gt; &gt;securely connect those resource that they want connected. The ACL\n&gt; &gt;model prevents this.\n&gt; &gt;\n&gt; &gt;Just as an example, why don&#39;t you post to this list a link to a\n&gt; &gt;withdrawal record from your online bank account. With the current\n&gt; &gt;interface, this is not possible: you can&#39;t do it without also\n&gt; &gt;posting the password for your entire account. If your bank account\n&gt; &gt;was implemented with a capability-based security model, posting\n&gt; &gt;the withdrawal record link would be no problem.  Capabilities\n&gt; &gt;enable you to create links.  ACLs prevent you from creating links.\n&gt; &gt;\n&gt; &gt;\n&gt; I&#39;m not sure why.  Assuming the withdrawal record has a URI, I dont see\n&gt; why I couldn&#39;t do that using a non-capability-based solution.  (I&#39;ve\n&gt; also just realized that we&#39;re probably using the word _link_ differently.)\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;&gt;There are solutions to this, but first I&#39;ll point out that this\n&gt; &gt;&gt;&gt;issue doesn&#39;t apply to software programs.  &quot;Web services&quot; address\n&gt; &gt;&gt;&gt;program to program communication. Programs have a stack and a heap\n&gt; &gt;&gt;&gt;to help them keep track of what they&#39;ve got and what they&#39;re\n&gt; &gt;&gt;&gt;doing. A program doesn&#39;t &quot;navigate back&quot;, it just dereferences a\n&gt; &gt;&gt;&gt;variable.\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;I&#39;m not sure I&#39;d agree that &quot;web services&quot; is about program to program\n&gt; &gt;&gt;communication.  I&#39;m sure there are a lot of &quot;web services&quot; where there&#39;s\n&gt; &gt;&gt;only a program at one end and some things that look like documents or\n&gt; &gt;&gt;document processors at the other end.  &quot;Program-to-program\n&gt; &gt;&gt;communication&quot; the way you  seem to be using it sounds a lot like an RPC\n&gt; &gt;&gt;model to me, and in my mind REST and RPC don&#39;t mix.\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;Is it your contention that program to program communication is RPC\n&gt; &gt;and therefore not REST? If so, this has grave implications for any\n&gt; &gt;thoughts of business integration with REST.\n&gt; &gt;\n&gt; &gt;\n&gt; No, that is not my contention - but only because I don&#39;t know what form\n&gt; that program-to-program communications takes.  If it is RPC, then no, it\n&gt; is not REST.  And yes, that does have implications for business\n&gt; integration with REST, but I wouldn&#39;t call them grave.\n&gt;\n&gt; &gt;My only point from the quoted paragraph is that browser GUI issues\n&gt; &gt;do not apply to software integration through REST.\n&gt; &gt;\n&gt; &gt;\n&gt; I agree.\n&gt;\n&gt; &gt;&gt;So how do you establish an initial context (or whatever its called) in a\n&gt; &gt;&gt;capability-based system without doing authentication?\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;Your initial context is whatever set of URIs you start with. If\n&gt; &gt;your program is an XSLT stylesheet, your initial context is the\n&gt; &gt;set of URIs in the input XML document.\n&gt; &gt;\n&gt; But how do I (as a client) get that initial set of URIs without\n&gt; participating in some kind of authentication process?  What do I click\n&gt; on (or reference) to get started?\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;&gt;&gt;If I am the WSJ, how do I restrict access while\n&gt; &gt;&gt;&gt;&gt;at the same time allow users to refer to the same\n&gt; &gt;&gt;&gt;&gt;document?\n&gt; &gt;&gt;&gt;&gt;\n&gt; &gt;&gt;&gt;&gt;\n&gt; &gt;&gt;&gt;You were the one who suggested this design, not me. This is now\n&gt; &gt;&gt;&gt;the third time that I have said that this is a bad idea. You would\n&gt; &gt;&gt;&gt;not use the capability model to solve this problem.\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;I&#39;m not disagreeing, but how about giving an example of something\n&gt; &gt;&gt;(web-based) that you would use a capability model to solve.\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;I did. Your web-based bank account.\n&gt; &gt;\n&gt; Ok - I guess I meant an example of how you would solve it.  What does\n&gt; the URI namespace look like?  How do you navigate among the various\n&gt; resources?\n&gt;\n&gt; &gt;&gt;&gt;There&#39;s a long explanation that I could go into on this, but I&#39;ll\n&gt; &gt;&gt;&gt;just give you the punch line. The WSJ scenario is *not* an access\n&gt; &gt;&gt;&gt;control problem, it is a DRM (Digital Restrictions Management)\n&gt; &gt;&gt;&gt;problem. The capability model is used for solving access control\n&gt; &gt;&gt;&gt;problems, not DRM problems.\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;Well, you may just have go into your long explanation, because if DRM\n&gt; &gt;&gt;isn&#39;t about controlling access, then I&#39;m pretty confused.\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;Access control is about controlling what authority you hand out.\n&gt; &gt;DRM is about controlling how people use authority they have\n&gt; &gt;already been given.\n&gt; &gt;\n&gt; &gt;\n&gt; I wont contest your definition, but my impression is that most people\n&gt; dont use that definition (rightly or wrongly).  Controlling access to a\n&gt; Resource (the R in URI) is about determining whether or not you are\n&gt; allowed to perform an operation on that resource - are you allowed to\n&gt; perform a GET/PUT/POST/DELETE.\n&gt;\n&gt; Which brings me to another question.  I understand that you control who\n&gt; can access a URI by controlling to whom you give the URI, but how do you\n&gt; control how they access the named resource.  That is, how do you control\n&gt; whether or not they can POST vs GET?\n&gt;\n&gt; &gt;In the WSJ scenario, a subscribed user is given the authority to\n&gt; &gt;read WSJ articles. The read authority implicitly carries with it\n&gt; &gt;the authority to pass-on the article to others. If you can read\n&gt; &gt;bits, you can copy bits. Neither capabilities nor ACLs can prevent\n&gt; &gt;you from giving a WSJ article to someone who is not a WSJ\n&gt; &gt;subscriber. The best you can do is make it less convenient to\n&gt; &gt;share the article. That is all the WSJ ACL does. It is just a\n&gt; &gt;feeble DRM measure.\n&gt; &gt;\n&gt; I don&#39;t even think they&#39;re attempting DRM - its not necessary.  But\n&gt; that&#39;s a different discussion (one that I&#39;m not interested in having\n&gt; either).\n&gt;\n&gt; --Chuck\n&gt;\n&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; rest-discuss-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n&gt;\n&gt;\n\n\n\n\n"}}