{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":131511758,"authorName":"Roy T. Fielding","from":"&quot;Roy T. Fielding&quot; &lt;fielding@...&gt;","profile":"roy_fielding","replyTo":"SENDER","senderId":"qOHeD34M9UTYdDyJYh86A42DA2FIAISu4j_nm4F67IpvcNkHPokOaMDfLXtoifG5mw-EqR4bclxYRhDkCTaQIudGTz3tKFZfW7WW14_0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Jot, RNA and ReST vs MoST","postDate":"1060385145","msgId":3882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyRTZCQjVFLUM5RjctMTFENy05OTZDLTAwMDM5Mzc1MzkzNkBhcGFjaGUub3JnPg==","inReplyToHeader":"PDI2Nzc4NTc3NS4xMDYwMzYyOTQ0QGxvY2FsaG9zdD4="},"prevInTopic":3881,"nextInTopic":3883,"prevInTime":3881,"nextInTime":3883,"topicId":3846,"numMessagesInTopic":32,"msgSnippet":"... No.  Information comes in many different representations.  That does not change the semantics of GET or PUT -- not even a tiny bit.  IF the server allows a","rawEmail":"Return-Path: &lt;fielding@...&gt;\r\nX-Sender: fielding@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 22809 invoked from network); 8 Aug 2003 23:27:58 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m11.grp.scd.yahoo.com with QMQP; 8 Aug 2003 23:27:58 -0000\r\nReceived: from unknown (HELO mac.wakasoft.com) (65.208.153.194)\n  by mta1.grp.scd.yahoo.com with SMTP; 8 Aug 2003 23:27:58 -0000\r\nReceived: from apache.org (localhost [127.0.0.1])\n\tby mac.wakasoft.com (8.12.9/8.12.9) with ESMTP id h78NPlQF002392;\n\tFri, 8 Aug 2003 16:25:47 -0700 (PDT)\r\nDate: Fri, 8 Aug 2003 16:25:45 -0700\r\nSubject: Re: [rest-discuss] Jot, RNA and ReST vs MoST\r\nContent-Type: text/plain; charset=US-ASCII; format=flowed\r\nMime-Version: 1.0 (Apple Message framework v552)\r\nCc: rest-discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nTo: Alex Jacobson &lt;alex@...&gt;\r\nIn-Reply-To: &lt;267785775.1060362944@localhost&gt;\r\nMessage-Id: &lt;A2E6BB5E-C9F7-11D7-996C-000393753936@...&gt;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Apple Mail (2.552)\r\nFrom: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\r\nX-Yahoo-Group-Post: member; u=131511758\r\nX-Yahoo-Profile: roy_fielding\r\n\r\n&gt; MoST says that the semantics of this generic interface should apply to \n&gt; the exposed representation rather than the &quot;hidden&quot; one.  Because, if \n&gt; HTTP methods apply only to the exposed representation of a resource, \n&gt; then their semantics are constrained entirely by the HTTP protocol and \n&gt; the content-type of the subject resource and HTTP thereby becomes a \n&gt; truly generic interface (at least on a per-content-type basis).\n&gt;\n&gt; However, if HTTP methods are intended to apply to the &quot;hidden&quot; \n&gt; representation then, aside from the fact that the &quot;hidden&quot; \n&gt; representation would not be truly hidden, the semantics of HTTP \n&gt; methods would need to include the mapping between hidden and external \n&gt; representations.  If this mapping varies from resource to resource \n&gt; then the semantics of HTTP methods cease to be generic as they depend \n&gt; on the behavior of each resource server&#39;s mapping functions.\n\nNo.  Information comes in many different representations.  That does not\nchange the semantics of GET or PUT -- not even a tiny bit.  IF the \nserver\nallows a resource to be negotiable in terms of representations, then the\nresource (that abstract concept mapping) is independent of the bits.\nThat means the server either must disallow PUT on that resource,\npossibly redirecting the request to some other resource that is\nbit-for-bit equivalent, or be capable of inspecting each PUT\nrepresentation for the new abstract state.  The latter is not too\ndifficult for many practical uses: Day&#39;s Communique product extracts\nthe atoms of content from the individual cells of table whether it\nis PUT as an excel spreadsheet, an HTML table, or a Word RTF table.\n\n&gt; Although, based on your comments quoted above, I believe MoST follows \n&gt; logically and necessarily from ReST, many of the people on this list \n&gt; appear to disagree.  They believe that HTTP methods should be \n&gt; interpreted as applying to the internal representations rather than \n&gt; the external ones, forcing me so articulate this issue as &quot;ReST vs \n&gt; MoST&quot; rather than &quot;ReST implies MoST.&quot;\n\nThey apply to representations depending upon how the resource is \ndefined,\nbut they apply to the resource (as in changing its state) uniformly.  \nThe\nproblem is the way you view a resource -- if you constrain the notion of\na resource to being a stored representation, then you simply eliminate\nthe freedom of the server to choose whether the resource is going to\nbe negotiable in bit format.  There are good things and bad things\nabout such a model, but it certainly isn&#39;t necessary.  The Web works\nfine without such a constraint.\n\n&gt;&gt;&gt; * Without an *explicit* model of exactly how the server maps the &gt;&gt;\n&gt; state of a resource into a response to a GET request, a client &gt;&gt; can \n&gt; have ABSOLUTELY NO IDEA what the content of that response\n&gt;&gt;&gt; means; it is simply has bits that can mean anything at all.\n&gt;&gt;\n&gt;&gt; What does &quot;mean&quot; mean in this context?\n&gt;\n&gt; If I GET a number and that number is intended to *represent* another \n&gt; number, how do I know what functions were applied to the represented \n&gt; number to produce the representing number.  Was it only the identity \n&gt; function? Was ln() applied?  Was round() or floor() applied?  If I \n&gt; don&#39;t know the mapping function between the internal and external \n&gt; representations, exactly what do I know about a represented resource \n&gt; simply from GETting a  representation from its server?\n\nWhatever is applied, it cannot change the information state.  Obviously,\nthat means round() and floor() are out of the question.\n\n&gt;&gt;&gt; * Without an *explicit* model of exactly how the server uses\n&gt;&gt;&gt; PUT/POST-ed content to change the state of a resource, a client\n&gt;&gt;&gt; can have ABSOLUTELY NO IDEA what the effect of a PUT or POST\n&gt;&gt;&gt; actually will be.\n&gt;&gt;\n&gt;&gt; That just says that REST doesn&#39;t mandate one single model.  Nothing\n&gt;&gt; prevents the server from establishing a model and telling the client\n&gt;&gt; what it is.  That is how hypertext works: the engine of application\n&gt;&gt; state change.\n&gt;\n&gt; Exactly how does hypertext tell me the relationship between a resource \n&gt; and its representation?\n\nBy including the identifier in a context of use wherein the relationship\nis predefined, just as it is for an HTML anchor.\n\n&gt; Following the above example, if I PUT a number to the server, how does \n&gt; hypertext tell me what transformations the server applies to that \n&gt; number to change the actual state of the resource?\n\nIt doesn&#39;t, because you don&#39;t need to know.\n\n&gt; Note absent this hypothetical hypertext engine, what you are really \n&gt; saying is that ReST allows every server to choose its own semantics \n&gt; for GET, PUT, POST and that all the advantages ReST claims from \n&gt; delivering a generic interface would be bogus.\n\nThat&#39;s just bullshit.\n\n&gt;&gt;&gt; Roy thinks these explicit models should be entirely arbitrary\n&gt;&gt;&gt; and specified at the whim of the server operator on a per-URI\n&gt;&gt;&gt; basis.  I think these models should be standardized in some\n&gt;&gt;&gt; manner and be URI independent.\n&gt;&gt;\n&gt;&gt; They aren&#39;t entirely arbitrary; they are merely chosen by the server.\n&gt;\n&gt; They are arbitrarily chosen by the server operator because the server \n&gt; operator can choose whichever internal representation suits his/her \n&gt; fancy.\n\nWhich is irrelevant because the interface is to a RESOURCE.\n\n&gt;&gt; In some cases they will be selected from a standard (such as webdav).\n&gt;&gt; In other cases they will be defined by an interface language (like \n&gt;&gt; WSDL).\n&gt;\n&gt; You used to think differently.  In your dissertation you say:\n&gt;\n&gt; &quot;&quot;&quot;\n&gt; The semantics are thus not defined by the network interface (IIOP), \n&gt; but by the object&#39;s IDL spec. Whether this is a good thing or not \n&gt; depends on the application -- for distributed objects it is a \n&gt; necessity, for the Web it isn&#39;t.\n&gt; &quot;&quot;&quot;\n&gt;\n&gt; Now you tell us that we need these IDLs (now taking the form of WSDL). \n&gt; What changed?\n\nNo, I said that what you wanted to do (define an interface model for \nsome\nset of resources) can be done with something like WSDL.  The Web still\ndoesn&#39;t need them.\n\n&gt; You used to want &quot;generic interface with standard semantics that can \n&gt; be interpreted by intermediaries almost as well as by the machines \n&gt; that originate services.&quot;\n&gt;\n&gt; You now appear to have abandoned that project in favor of per-service \n&gt; semantics.  What happened?\n\nNothing -- you are just wrong about them being necessary.\n\n&gt;&gt;&gt; Allowing clients to interact with agents of this power and\n&gt;&gt;&gt; complexity through HTTP then requires that service operators be\n&gt;&gt;&gt; permitted to overload HTTP methods to have essentially arbitrary\n&gt;&gt;&gt; meanings.\n&gt;&gt;\n&gt;&gt; That doesn&#39;t follow at all.  Service operators control the \n&gt;&gt; implementation\n&gt;&gt; of HTTP methods.  Methods get overloaded because service operators do \n&gt;&gt; want\n&gt;&gt; additional semantics, but normal people don&#39;t know how to extend them \n&gt;&gt; and\n&gt;&gt; implementers can&#39;t read protocol specs.  It is an artifact of the \n&gt;&gt; social\n&gt;&gt; process surrounding standardized protocols.  You can&#39;t fix it by\n&gt;&gt; forbidding the extension of methods.\n&gt;\n&gt; In another thread on this topic, Yannick wants to create an &quot;inbox&quot; \n&gt; resource that is represented by plaintext lines of &quot;subject : uri&quot;.  \n&gt; He says that this format actually represents a container of MIME \n&gt; messages, that one can add a message to this container by POSTing \n&gt; message/rfc822, and that a GET of a URI in the inbox representation \n&gt; should return a message/rfc822.\n&gt;\n&gt; In other words, Yannick arbitrarily overloads GET to return his new \n&gt; index format as a representation of a &quot;hidden&quot; container rather than \n&gt; e.g. a multipart/digest containing all the messages (no downloading of \n&gt; mail archives allowed!).  He arbitrarily overloads POST to take a \n&gt; message/rfc822 and add it to this imaginary container (in what \n&gt; order?),  rather than e.g. taking text/xml+message and converting and \n&gt; rather than taking the POST content as a message body and constructing \n&gt; message headers from the HTTP headers.\n\nWhy &quot;overloads&quot;?  He is simply using those methods as they were defined.\nHe isn&#39;t defining an interface of bits -- he is defining an information\ninterface.\n\n&gt; I&#39;m pretty sure that Yannick is doing nothing that contravenes any \n&gt; spec. But I am also pretty sure that there is a problem if all of \n&gt; these methods can mean so many different things for such a tiny \n&gt; application.  It means that we need documentation of how to use HTTP \n&gt; for each and every actual and hypothetical URI on the Internet.  It \n&gt; means we lose the whole notion of simple interoperability.\n\nNo, it doesn&#39;t -- you have no basis for such a claim.\n\n&gt; Perhaps we could use WSDL, but why not simply follow the rule that \n&gt; HTTP semantics operate on external representations.  Then Yannick&#39;s \n&gt; index format specifies everything about you need to know and we don&#39;t \n&gt; need him to tell us how to use HTTP to operate on his resources.  (See \n&gt; the other thread for details).\n\nBecause HTTP semantics do not operate on external representations,\nand therefore any attempt to claim such a rule for the general case\nis false.  HTTP needs to be flexible to support gateways and legacy\nsystems for which the semantics you are demanding simply do not apply.\n\nThat does not prevent you from applying that rule in a specific case,\nsuch as in a specific set of resources that your software is going\nto be interacting with -- such an additional constraint is still\ncompatible with REST-based systems and may have some additional\nproperties that make it worthwhile, but you should also document\nthe trade-offs: those properties that are degraded by applying\nthat rule.\n\n....Roy\n\n\n"}}