{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":131511758,"authorName":"Roy T. Fielding","from":"&quot;Roy T. Fielding&quot; &lt;fielding@...&gt;","profile":"roy_fielding","replyTo":"SENDER","senderId":"YSzR4QZPB6V5oMGhrsvPgVXRjWfGMmxdzipg7v6sKawhjmgHdni-O_mkTKOWIfvm5Om3ytFW9GLSqjEXUKEMFJpr7R_rgJOG3AyuaCBw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] REST&#39;s Definition of Resource","postDate":"1065142192","msgId":4010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGRjgzQ0NGLUY1M0ItMTFENy1CRDA3LTAwMDM5Mzc1MzkzNkBhcGFjaGUub3JnPg==","inReplyToHeader":"PDAwNDQwMWMzODhlZiQ5M2FmNWIxMCQwOTAyYThjMEBBVFRJQzU2Q09WRT4="},"prevInTopic":4007,"nextInTopic":0,"prevInTime":4009,"nextInTime":4011,"topicId":3986,"numMessagesInTopic":19,"msgSnippet":"... That s an excellent summary, Walden.  REST does not seek to be a framework for KR, but it is a framework for communication.  The KR systems that I am","rawEmail":"Return-Path: &lt;fielding@...&gt;\r\nX-Sender: fielding@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 16047 invoked from network); 3 Oct 2003 00:50:04 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m10.grp.scd.yahoo.com with QMQP; 3 Oct 2003 00:50:04 -0000\r\nReceived: from unknown (HELO mac.wakasoft.com) (65.208.153.194)\n  by mta5.grp.scd.yahoo.com with SMTP; 3 Oct 2003 00:50:03 -0000\r\nReceived: from apache.org (localhost [127.0.0.1])\n\tby mac.wakasoft.com (8.12.9/8.12.9) with ESMTP id h930nrvh026001;\n\tThu, 2 Oct 2003 17:49:53 -0700 (PDT)\r\nDate: Thu, 2 Oct 2003 17:49:52 -0700\r\nSubject: Re: [rest-discuss] REST&#39;s Definition of Resource\r\nContent-Type: text/plain; charset=US-ASCII; format=flowed\r\nMime-Version: 1.0 (Apple Message framework v552)\r\nCc: algermissen@..., rest-discuss@yahoogroups.com\r\nTo: Walden Mathews &lt;waldenm@...&gt;\r\nIn-Reply-To: &lt;004401c388ef$93af5b10$0902a8c0@ATTIC56COVE&gt;\r\nMessage-Id: &lt;7FF83CCF-F53B-11D7-BD07-000393753936@...&gt;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Apple Mail (2.552)\r\nFrom: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\r\nX-Yahoo-Group-Post: member; u=131511758\r\nX-Yahoo-Profile: roy_fielding\r\n\r\nOn Thursday, October 2, 2003, at 07:15  AM, Walden Mathews wrote:\n\n&gt; I don&#39;t think it would ever be correct to say that &quot;REST [or\n&gt; any architectural style, for that matter] is only about the technical\n&gt; aspects...&quot;.  The purpose of studying architectural styles is so\n&gt; that we can reason about the properties of the system.\n&gt;\n&gt; In this case, there are two properties driving the definition of\n&gt; &quot;resource&quot; within the REST style:\n&gt;\n&gt; (1) consistency of reference.  When you say &quot;GET the algorithm\n&gt; for computing the area of a circle&quot; or &quot;GET the current weather\n&gt; in Norwalk&quot;, you want those requests to have consistent semantics\n&gt; over time.  Even if the particular answers vary.\n&gt;\n&gt; (2) scaleability.  One way to achieve that consistency is to let\n&gt; identifiers identify representations, and rely on centralized link\n&gt; services to\n&gt; track state changes.  Every time the current weather in Norwalk\n&gt; changed, a new document and a new identifier would have to be\n&gt; minted, and all existing documents with a reference to Norwalk\n&gt; weather would need their links updated, the overall cost of the \n&gt; operation\n&gt; being commensurate with the total number of such links.  The other,\n&gt; more scaleable, way to achieve that is to do what REST does:\n&gt;\n&gt; &quot;&quot;&quot;\n&gt; Traditional hypertext systems [61], which typically operate in a \n&gt; closed or\n&gt; local environment, use unique node or document identifiers that change \n&gt; every\n&gt; time the information changes, relying on link servers to maintain \n&gt; references\n&gt; separately from the content [135]. Since centralized link servers are \n&gt; an\n&gt; anathema to the immense scale and multi-organizational domain \n&gt; requirements\n&gt; of the Web, REST relies instead on the author choosing a resource \n&gt; identifier\n&gt; that best fits the nature of the concept being identified. Naturally, \n&gt; the\n&gt; quality of an identifier is often proportional to the amount of money \n&gt; spent\n&gt; to retain its validity, which leads to broken links as ephemeral (or \n&gt; poorly\n&gt; supported) information moves or disappears over time.\n&gt; &quot;&quot;&quot;\n&gt;\n&gt; I don&#39;t think REST seeks to be a framework for knowledge\n&gt; representation or semantics.  I think the requirements above led\n&gt; to its definition being inevitably &quot;conceptual&quot;.\n\nThat&#39;s an excellent summary, Walden.  REST does not seek to be a\nframework for KR, but it is a framework for communication.  The KR\nsystems that I am familiar with are primarily based on models of\nfacts/claims/reality instead of perceptions, since building a\nreasoning system with multiple perspectives is a bit like\nworking with a schizophrenic.  However, since communication is\nat the heart of learning, they end up with similar challenges.\nand similar terminology.\n\n&gt; REST &quot;resource&quot; is unlike any other architectural component\n&gt; I am aware of in this sense.  A &quot;filter&quot; component in a pipe &\n&gt; filter style makes promises about the consistency and relative\n&gt; statelessness of the transform, but not any semantic consistency\n&gt; of the output.\n\nYep, I struggled with that in writing the dissertation -- is\neach resource a datum, a connector, a component, or something\nelse that just hasn&#39;t been talked about in the literature?\nI think of it as an abstract goal, more than anything else,\nbut classified it as data because it didn&#39;t fit elsewhere.\nIt is, essentially, data that is only used by reference.\n\n&gt; In modeling REST formally, you can remove &quot;resource&quot; from\n&gt; the picture without harming the purely technical aspects of the\n&gt; system.  What you then end up with is a many-to-many relation\n&gt; from URI to representations.  Perhaps that&#39;s all the Web *really*\n&gt; is, but it&#39;s hard to find any guidance in the building of useful\n&gt; systems in that.  Put another way, it&#39;s hard to decide what value\n&gt; such a system might be providing.\n\nAnd that is the key, really, since the main reason we know that a\nconceptual resource must exist is because of the number of ways\nthat a link can fail.  It is only when people complain bitterly\nabout the lack of an expected sameness that you realize the goal\nof the link has nothing to do with the listener at the end of\nthe HTTP address, but rather the expectation that it identifies\n(indirectly, as there is no such thing as direct HTTP\nidentification) something other than the address.\n\nPeople don&#39;t create links to server software; they create links to\ninformation.  If the system pretends that the target of a link is\nnothing more than a communication point, then the system cannot\nanticipate and correct for the kinds of information failures that\npeople actually care about.  Or, more to the point, people won&#39;t\ndesign the system (which doesn&#39;t care either way) such that it\ndetects such failures when possible and includes the features\nnecessary for indirection, redirection, etc.\n\nBTW, the definition of resource in REST applies only to information\nsystems.  The one that applies to all uses of URI is in the\nrfc2396bis draft, which has larger scope but ends up being less\nuseful as a result.  There are no other generally agreed upon\ndefinitions of resource for the Web technologies, though many people\nstill think of it as a &quot;document&quot; and simply change the definition\nof document to have the same properties as a resource.\n\n....Roy\n\n\n"}}