{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"lgaWXBAQxK7Gn0pL9Tewjn44wSQRL5aAaZiB4qoypL1uDcP9ljdLElEZAs-OZolqxkP2d7LaFjdc2o04X99cd-VqNTCPJp9YmQqRE5JPGw","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Resources as Orange Apples","postDate":"1156394427","msgId":6508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFc5NDE5MDM0MzgzODkzMTE1NjM5NDQyN0BtYWlsLm1haWxzbmFyZS5uZXQ+"},"prevInTopic":0,"nextInTopic":6511,"prevInTime":6507,"nextInTime":6509,"topicId":6508,"numMessagesInTopic":17,"msgSnippet":"My friends have asked me to attempt to explain REST to them in terms they can understand.  Which means I can t use the word semantics , basically.  ;)  I ","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 65067 invoked from network); 24 Aug 2006 04:40:51 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m25.grp.scd.yahoo.com with QMQP; 24 Aug 2006 04:40:51 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (206.246.200.187)\n  by mta3.grp.scd.yahoo.com with SMTP; 24 Aug 2006 04:40:50 -0000\r\nReceived: from mail.mailsnare.net (unknown [206.246.200.167])\n\tby mail.mailsnare.net (Postfix) with ESMTP id CAF332BDA2\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Thu, 24 Aug 2006 04:40:27 +0000 (UTC)\r\nTo: rest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W94190343838931156394427@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Thu, 24 Aug 2006 04:40:27 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;utf-8&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nX-eGroups-Msg-Info: 2:3:4:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: Resources as Orange Apples\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\nMy friends have asked me to attempt to explain REST to them in terms they can \nunderstand.  Which means I can&#39;t use the word &quot;semantics&quot;, basically.  ;)  I \nthought it best to use analogy instead of software-architecture examples, for \nstarters my primary concern is explaining &quot;Resource&quot; in terms of basic set \ntheory by sticking with apples and oranges.\n\nI&#39;ve come up with what I believe to be a good analogy to bridge the gap, and \nI have a friend or two willing to write the copy of the final result with \nvastly reduced usage of the word &quot;semantics&quot; in an effort to make me \ncomprehensible to others.  :)  We&#39;ll have a running conversation between \n&quot;Captain Obvious&quot;, who pulls an orange out of a box of apples and calls it an \norange, and &quot;Mr. Stubborn&quot; who insists that since it comes from a box of \napples it must be an apple.\n\nI would like some feedback on the technical correctness of the analogy, \nhopefully without sidetracking into the possibility of orange, pine or even \nhorse apples at every step of the way by remembering the intended audience -- \nlay terms is the goal.  I think everyone here is familiar with where the \nquotes come from, I hacked &#39;em up a bit though:\n\n&gt;\n&gt;    5.2.1.1 Resources and Resource Identifiers\n&gt;\n&gt;    The key abstraction of information in REST is a esource. Any information \n&gt;    that can be named can be a resource: a document or image, a temporal \n&gt;    service (e.g. &quot;today&#39;s weather in Los Angeles&quot;), a collection of other \n&gt;    resources, a non-virtual object (e.g. a person), and so on. In other \n&gt;    words, any concept that might be the target of an author&#39;s hypertext \n&gt;    reference must fit within the definition of a resource.\n&gt;\n\nThe resource this example identifies is &quot;a box of apples&quot;. Since a resource \nis a set (though it may have only one member) and since this set implies \nmembers must be apples, any dereferenceable target in the box must be an \napple. Since this is only a conceptual mapping we don&#39;t need to specify what \ntype of apples may be contained in the box.\n\n&gt;\n&gt;    A resource is a conceptual mapping to a set of entities, not the entity \n&gt;    that corresponds to the mapping at any particular point in time.\n&gt;\n\nThe entities in this example are individual apples.  Older apples go bad or \nget eaten and newer apples take their place.  The resource is always &quot;a box \nof apples&quot;, it does not become &quot;a box of rotten apples&quot; if a rotten apple is \ndereferenced.\n\n&gt;\n&gt;    More precisely, a resource R is a temporally varying membership function \n&gt;    MR(t), which for time t maps to a set of entities, or values, which are \n&gt;    equivalent.\n&gt;\n\nOver time, we may have all sorts of different apples coming into and going \nout of our box of apples. The set is limited to the apples in the box, but \nthe number and types of apples represented in the box does not change the \ndefinition of &quot;box of apples&quot;. If an object inside the box does not fit with \nthe description of the contents of the box then that object simply does not \nbelong inside that box -- oranges are not allowed.\n\n&gt;\n&gt;    The values in the set may be resource representations and/or resource \n&gt;    identifiers. A resource can map to the empty set, which allows \n&gt;    references to be made to a concept before any realization of that \n&gt;    concept exists...\n&gt;\n\nJust because we have a container we want to label &quot;box of apples&quot; does not \nimply that it must first contain any apples before we can label it. It may be \nempty. The &quot;box of apples&quot; might also just contain pictures of types of \napples. So long as having a picture of an apple inside a &quot;box of apples&quot; \ndoesn&#39;t change the meaning of &quot;box of apples&quot; we&#39;re OK, and we never said it \nwas a &quot;box of fresh apples&quot;.\n\n&gt;\n&gt;    Some resources are static in the sense that, when examined at any time \n&gt;    after their creation, they always correspond to the same value set.\n&gt;\n\nIf we have a picture of an apple which identifies the bin within our box set \naside for apples of that variety, we don&#39;t need to change it regardless of \nhow often that type of apple comes and goes, even if we run out of stock.  \nThe picture of a Red Delicious apple inside our apple box is static.  It is \nnot a Red Delicious apple, a resource identifier which corresponds to a \ndifferent apple each time.\n\n&gt;\n&gt;    Others have a high degree of variance in their value over time... For \n&gt;    example, the &quot;authors&#39; preferred version&quot; of an academic paper... These \n&gt;    are two distinct resources, even if they both map to the same value at \n&gt;    some point in time.\n&gt;\n\nThe &quot;Apple of the Month&quot; resource is an identifier, much like a &quot;picture of \nan apple&quot; is an identifier, neither are actually apples. As long as the \npicture of which apple is featured varies no more or less than once each \nmonth, the semantics of this resource identifier are static because it is \nnever equal to &quot;a Red Delicious apple&quot; even when that variant is the Apple of \nthe Month, nor is it equal to &quot;still January, 1998&#39;s Apple of the Month&quot;.\n\n&gt;\n&gt;    The only thing that is required to be static for a resource is the \n&gt;    semantics of the mapping, since the semantics is what distinguishes one \n&gt;    resource from another.\n&gt;\n\n-----------------\nIn the spirit of Chemistry&#39;s &quot;Maxwell&#39;s Demon&quot; and John Muir&#39;s &quot;The Complete \nIdiot&#39;s Guide to Repairing Your Volkswagen&quot;:\n\nCaptain Obvious: Sir, this would appear to be an orange!\n\nMr. Stubborn: Why would you say that? It came out of an apple box!\n\n...And so on and so forth a bit, the previous Fielding quote is repeated at \nthe end with an explanation.  Under development...\n\n[1] http://www.iwdn.net/images/smilies/paul_h_style/icon_obvious.gif\n[2] http://www.iwdn.net/images/smilies/paul_h_style/icon_stubborn.gif\n\nThose guys have been around for a while along with some others...\n-----------------\n\n&gt;\n&gt;    This abstract definition of a resource enables key features of the Web \n&gt;    architecture. First, it provides generality by encompassing many sources \n&gt;    of information without artificially distinguishing them by type or \n&gt;    implementation.\n&gt;\n\nWe don&#39;t have to limit our options by calling our box a &quot;box of Red Delicious \napples&quot;.  More importantly, we aren&#39;t actually prohibited from mixing apples \nwith oranges, since some oranges can also be a type of apple there would be \nan artificial distinction imposed by excluding oranges from our box \naltogether. Good thing we didn&#39;t label our resource a &quot;box of Apples -- no \noranges allowed&quot; or putting orange apples (even if they&#39;re just apples which \nhappen to be orange-colored) inside the box would be a problem, instead we \nhave provided generality with &quot;box of apples&quot;.\n\nhttp://en.wikipedia.org/wiki/Apples_and_oranges#Oranges_as_a_type_of_apple\n\n&gt;\n&gt;    Second, it allows late binding of the reference to a representation, \n&gt;    enabling content negotiation to take place based on characteristics of \n&gt;    the request.\n&gt;\n\nA guy walks into the apple bar, the waitress (Connie Neg) spots him and says, \n&quot;Ya want the usual, hon?&quot; and fetches him his preferred variety, a Golden \nDelicious apple. &quot;You ready to order, sugar?&quot; she asks the next patron. \n&quot;Yeah, I think I&#39;ll just have your special.&quot; he gets a Red Delicious, since \nit&#39;s Apple of the Month. When you want an apple, you just have to go to the \napple bar, you don&#39;t need to decide what type of apple you actually want (or \neven what you want to do with it once you have it -- I may wind up feeding it \nto my neighbor&#39;s horse) until you get there and see what they have.\n\n(Also, for those following the orthogonally-related discussion, you can&#39;t \nsend Connie down the street to Barney&#39;s house when Fred shows up and asks her \nfor Barney&#39;s apple so why give Connie a key in the first place?  If Barney \nasks Connie to go get his apple instead of one she has at the apple bar she \nshould say, &quot;Get lost, I&#39;m busy here.&quot;  Let Fred and Barney worry about \nhiding and finding any apples they don&#39;t intend for public consumption.  This \nis certainly beyond Connie&#39;s job description.  If Fred or Barney want a \nspecific type of private apple they can negotiate with Wilma or Betty when \nthey get home. -1 service doc.)\n\n&gt;\n&gt;    Finally, it allows an author to reference the concept rather than some \n&gt;    singular representation of that concept, thus removing the need to \n&gt;    change all existing links whenever the representation changes (assuming \n&gt;    the author used the right identifier).\n&gt;\n\nIf we&#39;ve designed the Apple of the Month function properly, we just change \nthe picture of the apple on the placard. If we&#39;ve designed it poorly, we need \nto move the old apples out of the special Apple of the Month bin at the end \nof each month to make way for the new variety and decide how to sort our \nnewly-featured apple into two bins for one month, instead of just \n(re)directing people to the existing bin of the desired variety temporarily.\n\n&gt;\n&gt;    REST uses a resource identifier to identify the particular resource \n&gt;    involved in an interaction between components. REST connectors provide a \n&gt;    generic interface for accessing and manipulating the value set of a \n&gt;    resource, regardless of how the membership function is defined or the \n&gt;    type of software that is handling the request.\n&gt;\n\nThe only thing anyone needs to manipulate an apple inside a box of apples is \nwhatever they would normally pick up, deposit, bite or smash an apple with. \nRegardless of which employee is putting new apples into the box or which type \nof apples are involved, the interface is still manual labor.\n\n&gt;\n&gt;    The naming authority that assigned the resource identifier, making it \n&gt;    possible to reference the resource, is responsible for maintaining the \n&gt;    semantic validity of the mapping over time (i.e., ensuring that the \n&gt;    membership function does not change).\n&gt;\n\nIf you label a placard &quot;Apple of the Month&quot; and you aren&#39;t responsible enough \nto change the picture and the bin it is on each month, or get a lackey \n(script) to do it, then you&#39;re a slacker and you have broken the semantic \nvalidity of your identifier (and most likely your website if you think you&#39;re \nimplementing REST). If you tell people your box contains apples, don&#39;t fill \nit with oranges every third month and tell people that makes it temporarily a \nbox of oranges.\n\n&gt;\n&gt;    The only thing that is required to be static for a resource is the \n&gt;    semantics of the mapping, since the semantics is what distinguishes one \n&gt;    resource from another.\n&gt;\n\nIf you want people to be able to tell the difference between your apples and \nyour oranges then don&#39;t mix your apples with your oranges. If someone wonders \nwhether or not your orange apples are actually citrus fruits, you can point \nthem to a box labeled &quot;citrus fruit&quot; which may not help if they&#39;re looking \nfor oranges but certainly clarifies that you have a type of apple that is \norange.  If nobody cares whether they dereference an apple or an orange then \nlabel it a &quot;box of fruit&quot;.\n\n-Eric\n\n\n\n\n"}}