{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"s8gtSeCBmFh81ZTUdm058wE9jJD6SQJIzVyrCkFwuECzOF8q7WPVpDCOCH8xnC7LFHN7TLreZ24XP0COSwFzzCneekeb4La15MgRqXpQsg","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Representations  (Was: Resources as Orange Apples)","postDate":"1156562966","msgId":6518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFc2MjA4MDMwMjc4MzIxMjYxMTU2NTYyOTY2QG1haWwubWFpbHNuYXJlLm5ldD4="},"prevInTopic":0,"nextInTopic":6521,"prevInTime":6517,"nextInTime":6519,"topicId":6518,"numMessagesInTopic":20,"msgSnippet":"... If the resource is a box of apples and its state is Red Delicious then the representation is a Red Delicious apple.  When the representative apple is ","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 10569 invoked from network); 26 Aug 2006 03:29:39 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m24.grp.scd.yahoo.com with QMQP; 26 Aug 2006 03:29:39 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (206.246.200.187)\n  by mta1.grp.scd.yahoo.com with SMTP; 26 Aug 2006 03:29:38 -0000\r\nReceived: from mail.mailsnare.net (unknown [206.246.200.167])\n\tby mail.mailsnare.net (Postfix) with ESMTP id F12E32BC75\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Sat, 26 Aug 2006 03:29:26 +0000 (UTC)\r\nTo: rest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W6208030278321261156562966@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Sat, 26 Aug 2006 03:29:26 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;utf-8&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nX-eGroups-Msg-Info: 2:3:4:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: Representations  (Was: Resources as Orange Apples)\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\n&gt;\n&gt;    5.2.1.2 Representations\n&gt;\n&gt;    REST components perform actions on a resource by using a representation \n&gt;    to capture the current or intended state of that resource and \n&gt;    transferring that representation between components. A representation \n&gt;    [includes] representation metadata to describe itself.\n&gt;\n\nIf the resource is a box of apples and its state is Red Delicious then the \nrepresentation is a Red Delicious apple.  When the representative apple is \nremoved from the bin labeled &quot;Red Delicious&quot; for transferral from the box \ncomponent to the human component, the human can still tell it&#39;s a Red \nDelicious by reading the little sticker of metadata.\n\n&gt;\n&gt;    Other commonly used but less precise names for a representation \n&gt;    include: document, file, and HTTP message entity, instance, or variant.\n&gt;\n\nIn this example we sometimes use &quot;variety&quot;, &quot;varietal&quot; or &quot;variant&quot; to \ndescribe the representative apples.\n\n&gt;\n&gt;    Response messages may include both representation metadata and resource \n&gt;    metadata: information about the resource that is not specific to the \n&gt;    supplied representation.\n&gt;\n\nThe sticker on the apple may include both representation metadata indicating \nthe variety of apple, and resource metadata indicating the name of the \ncompany the grocer obtains all apples from.\n\n&gt;\n&gt;    Control data defines the purpose of a message between components, such \n&gt;    as the action being requested or the meaning of a response. It is also \n&gt;    used to parameterize requests and override the default behavior of some \n&gt;    connecting elements. For example, cache behavior can be modified by \n&gt;    control data included in the request or response message.\n&gt;\n\nThe grocer DELETEs apples from the bin before they go rotten, PUTs new apples \nin their place, and may POST an entirely new variety of apples not available \nthe day before.  Customers GET their apples, some of which have an additional \nlittle sticker stating, &quot;This apple is for PIES.&quot;  This is to override the \ncustomer&#39;s expected behavior of purchasing an apple to eat raw.  The apple \nmay also have an &quot;expiration date&quot; sticker to control how long the apple may \nbe cached in a fruit basket.  The customer may override that expiration date \nby eating the apple anyway after it&#39;s expired, or by throwing it out before \nit&#39;s expired and buying a new apple at the store.\n\n&gt;\n&gt;    Depending on the message control data, a given representation may \n&gt;    indicate the current state of the requested resource, the desired state \n&gt;    for the requested resource, or the value of some other resource, such as \n&gt;    a representation of the input data within a client&#39;s query form, or a \n&gt;    representation of some error condition for a response. \n&gt;\n\nThe customer might only be interested in a particular variety of apple, or \nmay prefer one variety over another.  The given representation may not be an \napple at all, it may be a picture of an apple with a message stating that the \nvariety is out of stock (410 Gone).  If we&#39;re talking about an apple vending \nmachine, a GET request includes a query for the desired variety of apple (D-\n2), which yields either a representation of that apple in the vending slot or \nan error message stating, &quot;Sorry, that RED DELICIOUS apple is past its \nexpiration date.&quot;\n\n&gt; \n&gt;    If the value set of a resource at a given time consists of multiple \n&gt;    representations, content negotiation may be used to select the best \n&gt;    representation for inclusion in a given message.\n&gt;\n\nThe error response from the vending machine could also include, &quot;Would you \nlike a GOLDEN DELICIOUS apple instead?&quot; Or even a list of other available \napples to select from (300 Options) with their key combos (i.e. D-3 through D-\n6).\n\n&gt;\n&gt;    The data format of a representation is known as a media type [48]. A \n&gt;    representation can be included in a message and processed by the \n&gt;    recipient according to the control data of the message and the nature of \n&gt;    the media type. Some media types are intended for automated processing, \n&gt;    some are intended to be rendered for viewing by a user, and a few are \n&gt;    capable of both. Composite media types can be used to enclose multiple \n&gt;    representations in a single message.\n&gt;\n\nSome apples are &quot;Cider Apples&quot;, some could be designated as &quot;Pie Apples&quot; and \nof course there&#39;s always the good ol&#39; &quot;Eatin&#39; Apple&quot;.  Some apples can go \nstraight into the juicer, some are for making pies, and some apples used in \nboth juice and pies are also tasty eaten raw.  If I go to the store looking \nfor apples to both eat and bake in pies, and the only varietal they have in \nstock is good for both, I don&#39;t need the apples I buy put into separate bags. \nI might want separate bags if the store had one variety only good for eating \nand another variety only good for baking in pies, which happened to both be \ngreen, especially if the store didn&#39;t use &quot;This apple is for PIES&quot; stickers.\n\n&gt;\n&gt;    The design of a media type can directly impact the user-perceived \n&gt;    performance of a distributed hypermedia system. Any data that must be \n&gt;    received before the recipient can begin rendering the representation \n&gt;    adds to the latency of an interaction. A data format that places the \n&gt;    most important rendering information up front, such that the initial \n&gt;    information can be incrementally rendered while the rest of the \n&gt;    information is being received, results in much better user-perceived \n&gt;    performance than a data format that must be entirely received before \n&gt;    rendering can begin.\n&gt;\n\nApples and Oranges simply won&#39;t do here.\n\nBoth HTML 4.01 and XHTML 1.1 follow the same table model.  To increase user-\nperceived performance it is necessary to use the proper markup, and the CSS \ntable-layout:fixed property.  This does not vary between the &quot;text/html&quot; and \nthe &quot;application/xhtml+xml&quot; media types.  Both &lt;thead&gt; and &lt;tfoot&gt; must \nappear before &lt;tbody&gt; in HTML 4-based markup languages, for the purpose of \nincrementally rendering the table before the HTML file is fully parsed.  I \nhave explained in much greater detail here:\n\n[1] http://www.iwdn.net/showthread.php?t=4114\n\nThere&#39;s a really fine point to be made here.  If we are discussing a simple \nlittle table in an HTML page then the greatest user-perceived performance may \nbe had from the &quot;application/xhtml+xml&quot; media type.  The effect of treating \nXML as XML is that new pages transfer completely before rendering, but on \nsmall pages this tends to make things look &quot;snappier&quot; to a user browsing the \nsite.\n\nIf the page in question is a large data table with thousands of rows, the \nopposite is true -- treating XML as XML means an awful lot of latency for the \nend user because the entire table needs to run through the XML parser before \nrendering begins.  So a better choice for large data tables is &quot;text/html&quot; \nbecause that media type strictly allows user-agents to incrementally render \nthe table before the document has finished SGML parsing.\n\nThe &quot;application/xhtml+xml&quot; media type overrides incremental table layout, \neven when the table is rendered in a single pass by virtue of using the &lt;col&gt;/\n&lt;colgroup&gt; tags and table-layout:fixed, because the whole document must \nfinish parsing before rendering begins.\n\n-Eric\n\n\n\n\n"}}