{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":119917303,"authorName":"Walden Mathews","from":"Walden Mathews &lt;waldenm@...&gt;","profile":"waldenmathews","replyTo":"SENDER","senderId":"8x1IaCYX7xYCNnN3GFxqnyut3EI_mi8lPjijUl1OAizq80Vy9zIJ-hAgeHF97HYIlPbxrPX-vE0fafMYrwNGnYouZultaGZKjcWxCXE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Representations  (Was: Resources as Orange Apples)","postDate":"1156703500","msgId":6528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGUwMWM2Y2EwNyQwYTE5YzI4MCQwOTAyYThjMEBXQUxERU5ERVNLVE9QPg==","referencesHeader":"PFc3MDI4NjMxNDk0MzE4ODIxMTU2NjcwNTczQG1haWwubWFpbHNuYXJlLm5ldD4="},"prevInTopic":6527,"nextInTopic":6529,"prevInTime":6527,"nextInTime":6529,"topicId":6518,"numMessagesInTopic":20,"msgSnippet":"Eric, I think you are misinterpreting the significance of set theory, if there is any, to REST.  It is not about resource containment; it s about ","rawEmail":"Return-Path: &lt;waldenm@...&gt;\r\nX-Sender: waldenm@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 852 invoked from network); 27 Aug 2006 18:31:45 -0000\r\nReceived: from unknown (66.218.67.36)\n  by m39.grp.scd.yahoo.com with QMQP; 27 Aug 2006 18:31:45 -0000\r\nReceived: from unknown (HELO mta7.srv.hcvlny.cv.net) (167.206.4.202)\n  by mta10.grp.scd.yahoo.com with SMTP; 27 Aug 2006 18:31:45 -0000\r\nReceived: from WALDENDESKTOP (ool-435636a7.dyn.optonline.net [67.86.54.167])\n by mta7.srv.hcvlny.cv.net\n (Sun Java System Messaging Server 6.2-6.01 (built Apr  3 2006))\n with SMTP id &lt;0J4O00B2R64ALA61@...&gt; for\n rest-discuss@yahoogroups.com; Sun, 27 Aug 2006 14:31:22 -0400 (EDT)\r\nDate: Sun, 27 Aug 2006 14:31:40 -0400\r\nTo: eric@...\r\nCc: rest-discuss@yahoogroups.com\r\nMessage-id: &lt;000e01c6ca07$0a19c280$0902a8c0@WALDENDESKTOP&gt;\r\nMIME-version: 1.0\r\nX-MIMEOLE: Produced By Microsoft MimeOLE V6.00.2900.2962\r\nX-Mailer: Microsoft Outlook Express 6.00.2900.2869\r\nContent-type: text/plain; charset=iso-8859-1\r\nContent-transfer-encoding: 7BIT\r\nX-Priority: 3\r\nX-MSMail-priority: Normal\r\nReferences: &lt;W7028631494318821156670573@...&gt;\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Walden Mathews &lt;waldenm@...&gt;\r\nReply-To: Walden Mathews &lt;waldenm@...&gt;\r\nSubject: Re: [rest-discuss] Representations  (Was: Resources as Orange Apples)\r\nX-Yahoo-Group-Post: member; u=119917303; y=UMtoqhXI1tLsBokhcBqnOm1Rtsjwf3hSnrWRltoZrhFUjR6d3vBncg\r\nX-Yahoo-Profile: waldenmathews\r\n\r\nEric,\n\nI think you are misinterpreting the significance of set theory, if there is\nany, to REST.  It is not about resource containment; it&#39;s about\nrepresentation.\n\nGiven some resource, there is a set of representations for it, and the\nfollowing are all true:\n\n1. The set may be empty for all time\n\n2. The set may be broken into not necessarily disjoint subsets, each\n    of which represents the resource at some distinct time.\n\n3. Each of the subsets in 2 above may be empty or have any number\n    of members.  The members are equivalent in that they all represent\n    the same resource at the same time.\n\nFurther, to your URI examples and content negotiation discussion,\nthere is no need to implicate more than one resource (and therefore one\nURI) in modeling content negotiation.  I think if you figure that out,\nyou&#39;ll be well on your way to some rest from this subject, no pun\nintended.\n\nWalden\n\n----- Original Message ----- \nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\nTo: &quot;Josh Sled&quot; &lt;jsled@...&gt;\nCc: &lt;rest-discuss@yahoogroups.com&gt;\nSent: Sunday, August 27, 2006 5:22 AM\nSubject: Re: [rest-discuss] Representations (Was: Resources as Orange \nApples)\n\n\n: &gt;\n: &gt;Why so much of a focus on containers, sets and physical objects anyways?\n: &gt;There&#39;s very little -- on the HTTP web, anways -- that actually exploits\n: &gt;a &quot;container&quot; relationship; even Apache directory listings are done by\n: &gt;generating HTML, and simply following links.  The browser doesn&#39;t know.\n: &gt;\n:\n: Because the definition of resource in REST is built on the notion of set\n: theory. REST leaves &quot;equivalent&quot; undefined, which it can get away with by\n: leaving the responsibility for understanding set theory squarely on the\n: shoulders of the reader.  I&#39;m afraid this has led many to interpret\n: &quot;equivalent&quot; to mean &quot;anything I want it to mean&quot;.  REST also defines\n: concepts like content negotiation and redirection without elaborating on\n: them, requiring the reader to first understand equivalence as defined by \nset\n: theory in order to properly implement a REST-based solution.\n:\n: To me, this suggests that the best way to understand or explain REST \nconcepts\n: like content negotiation and redirection is to converse in terms of set\n: theory, because understanding or explaining those concepts first requires \na\n: clear understanding of the semantics of &quot;equivalent&quot;.  The problem is that\n: &quot;equivalent&quot; may only be defined as it pertains to any given example, \nwhich\n: is why I think there needs to be some sort of base vocabulary using non-\n: opaque URIs.\n:\n: Otherwise, parties must first agree on the semantics of the example URIs\n: before proceeding to discuss the issue at hand, even if both are \nwell-versed\n: in REST.  It can take days for a group to even understand that their\n: disagreement comes down to the semantics of a URI&#39;s mapping, not the \nbehavior\n: of that URI when dereferenced, because one side thinks it&#39;s talking about\n: apples and the other side thinks it&#39;s talking about oranges.\n:\n: The semantics of a mapping can be made more obvious by restricting \nexamples\n: to sets whose membership and equivalency are inherent in their naming,\n: regardless of URI allocation scheme, so I chose apples and oranges.  It\n: provides a common-ground example, wholly unrelated to any specific service\n: (flight reservations, weather etc.), which carries over to a wide variety \nof\n: situations and possible URI allocation schemes.\n:\n: This may allow examples to be more easily understood without having to \nfirst\n: define the conceptual sets, and provide a means for parties who disagree\n: about the semantics of a particular mapping to illustrate their positions. \nIf\n: not, hopefully some people besides me will find it useful to explain or\n: understand REST or at least those parts of it which are wholly reliant on \nan\n: understanding of set theory, like &quot;resource&quot;.\n:\n: &gt;\n: &gt;What about focusing on URI&#39;s identifiying application states, and using\n: &gt;hyperlinks (and forms) in the media to transition between them?\n: &gt;\n:\n: I wish you hadn&#39;t asked me that, since I had planned to spend my Saturday\n: differently, but it was cold and rainy so I spent it adding URI-based\n: examples to what I already had.  ;-)  But it just didn&#39;t work.  Problem \nis,\n: whatever URI allocation scheme is chosen for an example comes across as \nsome\n: sort of &quot;preferred&quot; method if it&#39;s an example of good practice, while \nthose\n: used as examples of bad practice look as though it results from the URI\n: scheme itself instead of flawed conceptualization.\n:\n: Some Venn diagrams in the narrative might prove useful, though.\n:\n: If I&#39;ve established the analogy correctly, it may be used as an example-\n: neutral &quot;common notation&quot; to illustrate the situational semantics of that\n: pesky word &quot;equivalent&quot;, and other REST concepts:\n:\n: [1] http://example.com/apple/\n: [2] http://example.com/apple/red-delicious.apple\n: [3] http://example.com/apple/golden-delicious.apple\n:\n: [1] http://example.com/apple\n: [2] http://example.com/apple.red-delicious\n: [3] http://example.com/apple.golden-delicious\n:\n: [1] http://example.com/apples\n: [2] http://example.com/apples/red-delicious/apple.fruit\n: [3] http://example.com/apples/golden-delicious/apple.fruit\n:\n: Considering any of the three URI allocation schemes above, resource [1]\n: sometimes responds with a representation of resource [2] when \ndereferenced,\n: while at other times the response is a representation of resource [3],\n: depending upon user preference. This is a perfectly acceptable use of REST\n: content negotiation, provided that resources [2] and [3] are &quot;proper \nsubsets&quot;\n: of set [1] (they must be both conceptual and hierarchical subsets), AND\n: representations [1], [2] and [3] are all members of set [1]&#39;s &quot;Union of\n: Complements&quot;.\n:\n: The inverse of the Union of Complements is the &quot;Intersection&quot;.  A basic \nVenn\n: diagram consists of two overlapping circles, A and B, inside a rectangle U\n: (for Universal set).  The area where the circles overlap is the \nIntersection,\n: everything else inside the rectangle is the Union of Complements.  URIs \n[1],\n: [2] and [3] so far, have all been in the Union of Complements.  If we\n: conceptualize resource [1] as &quot;fresh apples&quot;, this URI would be in the\n: Intersection:\n:\n: [4] http://example.com/apples/red-delicious/rotten.apple.fruit\n:\n: The representation of a rotten apple is a member of the Red Delicious\n: hierarchical subset, therefore it is a member of the Apples hierarchical\n: subset.  But, if we&#39;ve decided that [4] will never be a response\n: representation when resource [1] is dereferenced, we have excluded [4] \nfrom\n: membership in any conceptual subset of [1] without altering the URI\n: allocation scheme.  REST does not care how you go about defining the\n: semantics of your mappings (configuring your server) so long as they&#39;re\n: valid, and static.\n:\n: Resource [1]&#39;s conceptual set is defined by its mapping, not by its \nmembers,\n: so it is up to the server manager to ensure that all members belong by\n: properly constraining the responses returned when resource [1] is\n: dereferenced.  It is this constraint of the set which defines the resource\n: concept in REST, not the semantics of its members, becasue the resource is\n: the box -- not its contents at any given point in time.\n:\n: A Venn diagram which expresses a hierarchical subset is a rectangle U\n: containing one circle B completely enclosed within another circle A.  To\n: express REST content negotiation for a given resource as a Venn diagram\n: requires both the circle-in-a-circle diagram to constrain it to proper\n: subsets, then the overlapping-circle diagram to constrain the resource set \nto\n: its conceptual Union of Complements.\n:\n: [1] http://example.com/fruit/\n: [2] http://example.com/apples/\n: [3] http://example.com/oranges/\n:\n: [1] http://example.com/fruit\n: [2] http://example.com/apple\n: [3] http://example.com/orange\n:\n: In either sequence above, if resource [1] sometimes responds with a\n: representation of resource [2] when dereferenced and at other times, a\n: representation of resource [3], it is a REST error (aka &quot;URI collision&quot;) \neven\n: though conceptually, [2] and [3] are equivalent subsets of [1]. This is\n: because &quot;Each origin server provides... a resource hierarchy&quot;, which means\n: that [1], [2] and [3] are &quot;disjoint sets&quot; by definition of URIs as\n: hierarchical sets.  URIs [2] and [3] cannot be seen as proper subsets of \n[1]\n: unless they are also hierarchical subsets of [1]:\n:\n: [1] http://example.com/fruit/\n: [2] http://example.com/fruit/apples/\n: [3] http://example.com/fruit/oranges/\n:\n: [1] http://example.com/fruit\n: [2] http://example.com/fruit.apple\n: [3] http://example.com/fruit.orange\n:\n: So far, the examples have assumed content-negotiation situations, where \nthe\n: response representation when resource [1] is dereferenced may be any\n: equivalent member representation contained the Union of Complements with a\n: response code of 200 OK. These are examples of the &quot;late binding of a\n: representation to a resource&quot;. Sometimes, we want to include an equivalent\n: set in our conceptual set, which is NOT in the same hierarchical set. In \nsuch\n: a case, the response when [1] is dereferenced is not a representation of \nthe\n: resource it identifies, instead the response representation &quot;indicates the\n: value of some other resource&quot; by redirection.\n:\n: This redirection serves the purpose of identifying a &quot;disjoint set&quot; as an\n: equivalent resource, which could also be called the early binding of a\n: resource to a request. This redirection must be the same for all users,\n: regardless of the preference settings of their user-agents, in order for \nthe\n: semantics of the resource mapping to remain static. The &quot;late binding of a\n: representation to a resource&quot; may only occur at the target of the\n: redirection, not the dynamically-redirecting resource itself, because that\n: set&#39;s only member representation &quot;indicates an equivalent disjoint set&quot; \nand\n: nothing more.\n:\n: [1] http://example.com/fruit-of-the-month\n: [2] http://example.com/apples/\n: [3] http://example.com/apples/red-delicious.apple\n: [4] http://example.com/oranges/\n:\n: URI [1] indicates some other resource as being a disjoint set of \ntemporarily-\n: equivalent value by responding to requests with a 307 redirect.  Let&#39;s \nassume\n: this month&#39;s fruit is &quot;apples&quot;. For this month, resource [2] is \ntemporarily\n: equivalent to resource [1], the fact that they have no overlapping \nmembership\n: despite their equivalence is the definition of disjoint sets. Next month, \n[2]\n: should no longer be equivalent to [1].\n:\n: The only member representation of set [1] above is a 307 redirect pointer. \nTo\n: express permanent instead of temporary equivalency, the only member\n: representation of set [1] below would be a 301 redirect instead of a 307:\n:\n: [1] http://example.com/2006-fruit-of-the-year\n: [2] http://example.com/apples/\n:\n: Resource [1] may conceptually identify resource [2], but this does not \nmake\n: resource [2] or its members, members of set [1].  The Venn diagram for a\n: disjoint set is a rectangle U containing two circles A and B which do not\n: overlap, it is the only diagram required to express REST redirection.\n:\n: To sum up: content negotiation is the late binding to a requested resource \nof\n: some member representation which is equivalent, defined as the Union of\n: Complements of the resource set and its proper subsets.  Redirection is \nthe\n: early binding to a request of some other resource which is equivalent,\n: defined as a disjoint set.  These relationships may be modeled using \nsimple\n: Venn diagrams as visual aids when conceptualizing a website or web \nservice.\n: These Venn diagrams can be used to derive the URI allocation scheme, and \nbe\n: referred to when designing the function of the various components.\n:\n: (My nutshell objection to the notion of a service document, is its Venn\n: diagram consists of circles A and B on the outside of rectangle U, and I\n: can&#39;t square that with REST.)\n:\n: -Eric\n:\n: &gt;-- \n: &gt;...jsled\n: &gt;http://asynchronous.org/ - `a=jsled; b=asynchronous.org; echo ${a}@${b}`\n: &gt;\n:\n:\n:\n:\n: __________ NOD32 1.1727 (20060826) Information __________\n:\n: This message was checked by NOD32 antivirus system.\n: http://www.eset.com\n:\n: \n\n\n"}}