{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"e4he1wz07kYnYlitrL1CU34dGm4OXOhNFCm1BKIvW8XzgI_fdCRQXgy23kMboKZ9GbHZ-Oc4viw5RxKI8SEssUvdtuObjqaqcm421GUzUg","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re:  [rest-discuss] Resources as Orange Apples","postDate":"1156847800","msgId":6546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFc0NzA0NDI5MjIzMzA5ODMxMTU2ODQ3ODAwQG1haWwubWFpbHNuYXJlLm5ldD4="},"prevInTopic":6544,"nextInTopic":6551,"prevInTime":6545,"nextInTime":6547,"topicId":6508,"numMessagesInTopic":17,"msgSnippet":"... I hope I haven t given offense by editing your words.  :-( ... You know this, I know this, everyone here should know this, but my audience consists of","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 86459 invoked from network); 29 Aug 2006 10:39:54 -0000\r\nReceived: from unknown (66.218.67.34)\n  by m41.grp.scd.yahoo.com with QMQP; 29 Aug 2006 10:39:54 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (206.246.200.187)\n  by mta8.grp.scd.yahoo.com with SMTP; 29 Aug 2006 10:39:54 -0000\r\nReceived: from mail.mailsnare.net (v167.mailsnare.net [206.246.200.167])\n\tby mail.mailsnare.net (Postfix) with ESMTP id 59FF01DEF9;\n\tTue, 29 Aug 2006 10:36:39 +0000 (UTC)\r\nTo: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\r\nCc: &quot;Dave Pawson&quot; &lt;dave.pawson@...&gt;,\n\trest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W4704429223309831156847800@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Tue, 29 Aug 2006 10:36:40 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;utf-8&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nX-eGroups-Msg-Info: 2:3:4:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: Re:  [rest-discuss] Resources as Orange Apples\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\n&gt;&gt;\n&gt;&gt; &quot;[A] resource... maps to a set of entities...&quot;\n&gt;\n&gt;The correct quote is\n&gt;\n\nI hope I haven&#39;t given offense by editing your words.  :-(\n\n&gt;\n&gt;A resource is a membership function. A membership function is not a set.\n&gt;The value of that function for a given time t is a set.  The resource is\n&gt;the continuity of those values over time, not the value at any given\n&gt;instant in time.\n&gt;\n\nYou know this, I know this, everyone here should know this, but my audience \nconsists of people who do not know this.  The problem I have here, is how to \nlead into _any_ analogy in a way which doesn&#39;t stop people here at the first \nparagraph, yet also doesn&#39;t stop my intended audience at the very first \nparagraph.  Your dissertation and your analogy are &quot;whole&quot;, but that&#39;s not \nalways the best strategy for teaching difficult concepts to those with only \nan intermediate level of knowledge.\n\nWhat I&#39;m trying for is &quot;whole-part-whole&quot;, since everyone&#39;s starting place is \nthe dissertation.  I don&#39;t think those who fail to grasp it are incapable of \nlearning REST, I think they need some help, by breaking resource/\nrepresentation down into a simplified &quot;part&quot; which may be modeled using Venn \ndiagrams, which may then be used to build the knowledge level of the target \naudience back up to &quot;whole&quot;.\n\nAll I know about teaching comes from teaching people to swim, and what I \npicked up as a student in my incomplete University education -- what formal \ntraining I have is in Chemistry, but one of my Professors was Tom Cech (had \nhim when he won his Nobel), and I helped Igor Gamow test SUBA in CU&#39;s \ncompetitive diving well.  I managed rec centers back in those days and was \nresponsible for maintaining CU&#39;s pools (and occasionally the Zamboni) while I \nwas a student lifeguard.\n\nWhich is why I brought up Maxwell&#39;s Demon.  In teaching Chemistry and \nPhysics, many advanced concepts are impossible to teach without having a \nmeans to decrease entropy, in violation of the Second Law of Thermodynamics.  \nMaxwell&#39;s Demon is &quot;allowed&quot; to reduce entropy without being considered a \npart of the system -- he may be busy but he does no work.  Maxwell&#39;s Demon \nand the concept of entropy have been applied to a variety of other subjects, \nand I firmly believe that such a device is needed to teach REST, _because_ a \nresource is a temporally varying membership function not a set.\n\nHere, I&#39;m creating a Maxwell&#39;s Demon by considering only one instant in time, \n&quot;removing entropy from the equation&quot; so that the set being mapped by the \nresource may be used to help explain what the resource is.  What results, is \ncalling the resource the set for the purpose of describing the semantics of \nits mapping.  The Venn diagrams serve this purpose even if my analogy is \noff.  I&#39;m not concerned about doing this, as using such a Demon doesn&#39;t \nprevent any analogies, or explanations based on those analogies, from \nintroducing the &quot;temporally varying membership function&quot; bit when it&#39;s time \nto work back to the &quot;whole&quot;.\n\n&gt;\n&gt;Your analogy starts off on the wrong foot by talking about resources\n&gt;in terms of how they might be implemented (a box of apples).\n&gt;\n\nYes, it does, by design.  With a copy of &quot;How to Keep Your Volkswagen Alive: \nA Manual of Step-by-Step Procedures for the Compleat Idiot&quot;, some tools and a \nVW Beetle I can teach a 16-year-old how to set the timing on any vehicle with \na mechanical points-and-condenser ignition system, even a Zamboni.  He&#39;d be \nhelpless faced with a modern electronic ignition system with computer-\ncontrolled variable timing -- that takes some advanced study.\n\nThe book I mention explains the concept of &quot;internal-combustion automobile \nengine&quot; by considering one simplistic implementation, an air-cooled VW boxer \nfour.  The procedures and explanations fundamentally apply to modern internal-\ncombustion auto engines, even the ones which seem laughable by today&#39;s \nstandards -- like setting the timing with a timing light, a wrench, and a \nfeeler guage for the &quot;points&quot;.  The marginalia cartoons are a classic touch.\n\nGive me a Haynes manual, some tools, and a BMW V-12 and I can&#39;t teach a 16-\nyear-old a thing.  I see a need for keeping it simple when explaining REST by \nspeaking of one simplistic implementation, which may be expanded upon in \nfurther study, as my box of apples changes into an apple bar and a vending \nmachine in my examples.  I don&#39;t think my vending machine example and your \ndouble-sided wall of boxes are all that far apart that they couldn&#39;t be \nmodified into something useful for explaining REST, but I think the important \npart is that the result be something familiar and recognizable to people.\n\n&gt;\n&gt;Now you can add apples and oranges to that framework and make an\n&gt;analogy.\n&gt;\n\nMeaning no offense, but I could also teach someone how to use an adding \nmachine by sitting them down at a UNIVAC.  ;-)  Your example is certainly \nsuperior to mine when considering this audience, but this audience is not my \ntarget.\n\n-Eric  (AFK for a few days, sorry)\n\n&gt;\n&gt;....Roy\n&gt;\n\n\n\n"}}