{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"AxtO440PaaGPNefntGBrQqB_yIOjVarP3T9IagBdQu3WQ4uJEzszx3d1RIQKyxYae8tqjXgHmx9L2-sv39jvQyM9AZ6csjp42mRD1imThQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  [rest-discuss] Resources as Orange Apples","postDate":"1157890747","msgId":6556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFc5MDU4MTIwNDM2MjA2MzQxMTU3ODkwNzQ3QG1haWwubWFpbHNuYXJlLm5ldD4="},"prevInTopic":6555,"nextInTopic":6557,"prevInTime":6555,"nextInTime":6557,"topicId":6508,"numMessagesInTopic":17,"msgSnippet":"... Fair enough.  Please realize that my understanding of resources and representations in REST came about through the application of set theory (using those","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 59764 invoked from network); 10 Sep 2006 12:19:40 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m32.grp.scd.yahoo.com with QMQP; 10 Sep 2006 12:19:40 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (206.246.200.187)\n  by mta9.grp.scd.yahoo.com with SMTP; 10 Sep 2006 12:19:40 -0000\r\nReceived: from mail.mailsnare.net (unknown [206.246.200.167])\n\tby mail.mailsnare.net (Postfix) with ESMTP id 4477E2C074;\n\tSun, 10 Sep 2006 12:19:07 +0000 (UTC)\r\nTo: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\r\nCc: &quot;Dave Pawson&quot; &lt;dave.pawson@...&gt;,\n\trest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W9058120436206341157890747@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Sun, 10 Sep 2006 12:19:07 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: Re:  [rest-discuss] Resources as Orange Apples\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\n&gt;\n&gt;I don&#39;t think you were even close.  If you want to teach someone about\n&gt;web architecture, then you can give concrete examples that some people\n&gt;may find easier to understand...  The analogy has to be representative of \n&gt;the subject being taught...  If you want to teach someone about REST,\n&gt;then you have to at least be consistent with the principles of REST\n&gt;as they have been defined.\n&gt;\n\nFair enough.  Please realize that my understanding of resources and \nrepresentations in REST came about through the application of set theory \n(using those diagrams) to my own projects, which make heavy use of content \nnegotiation and redirection.  If the subject being taught is set theory, then \napples and oranges are a consistent analogy.  I only intended for the analogy \nto apply to resources and representations, not REST as a whole.\n\n&gt;\n&gt;REST is not about design-in-the-small.  It can&#39;t be taught by looking\n&gt;at a single implementation at an instant in time any more than you can\n&gt;teach swimming without talking about the nature of water.\n&gt;\n\nIf I understand your point, analogies which focus on one static set risk \nlosing critical aspects of REST overall.  I&#39;ve found a method/tool which \nhelps me analyze the set-related issues I have trouble understanding.  It has \nnothing to do with software architecture, only URI design and response-code \nimplementation.  So, _any_ analogy derived from this particular &quot;part&quot; would \nhave limited value to the &quot;whole&quot;.  OK, I can see that.  I&#39;m done with \nattempts at REST analogies for the forseeable future.\n\n&gt;\n&gt;Time is the single most important aspect of REST as an architectural\n&gt;style.  All of the constraints are designed to moderate the effects\n&gt;of a changing environment over time, enable independent evolution,\n&gt;and reduce latency.  All of the benefits from REST-based design can\n&gt;only be seen when a system is exposed to change over time.\n&gt;\n\nI still have a Maxwell&#39;s Demon with my use of diagrams, but I&#39;ll just say it \nreduces entropy, rather than freezes time, which is a more apt description of \nany form of &quot;site map&quot;.  The purpose is to model three &quot;concrete&quot; constraints \nI derived from &quot;R is a temporally varying membership function MR(t), which \nfor time t maps to a set of entities, or values, which are equivalent&quot; which \nhave proven extremely helpful to me over the past couple of years.\n\nMy aspirations to a degree in Chemistry were doomed from the start -- I \nalways assumed I would be able to learn advanced Calculus but this proved \nfalse.  The final year of undergraduate study is Physical Chemistry, i.e. \nKinetics, which is of course all Calculus.  But Organic Chemistry (not that I \nremember much of it) was a breeze for me.\n\nThere are multiple methods of writing an Organic Chem formula, depending on \nneed, and molecules may be diagrammed on paper or snapped together with those \n3-D model sets (gumdrops and toothpicks, if you took Chem in High School).  \nYeah, I like to model stuff with diagrams, it&#39;s how I learn.  I&#39;m a pen-and-\npaper guy, though, so this is my first effort to describe what I&#39;m up to with \nmy REST modeling and publish it.\n\n&gt;\n&gt;That&#39;s because a VW Beetle contains an implementation of an internal\n&gt;combustion engine.  You can learn a lot by looking at an example of\n&gt;an abstract concept.\n&gt;\n\nWhich is why I think there&#39;s some value in my modeling, aside from any \nanalogy.  Using the document located at the last URL I posted (in response to \ninput from this thread), I was able to determine why my analogy was a bit \nconfused with some help from a few of you on-list, plus Walden Matthews and \nmy friend Michaeljohn (who didn&#39;t like the apples and oranges analogy either) \noff-list.  I understand the mistake I was making and have learned from it.\n\nWe&#39;re using Resin Pro as our httpd.  Clients and intermediary caches only \nreceive responses from the server connector if we bypass the response filter \nwe use in our servlet&#39;s chain to set the cache-control headers.  Otherwise, \nall responses come from the cache connector located on the interface to the \nserver connector.  I was erroneously seeing that cache connector as the \n&quot;origin server&quot; but it isn&#39;t.  Working that out led to this:\n\n[1] http://canuck.bisonsystems.net/dev/rest/cache_alias.html\n\nNic Ferrier was asking me a while back what I meant by my notion of a &quot;cache \nalias&quot;.  Simply put, from the perspective of the cache connector, in the \npresence of VARY and cache-control response headers each representation \nreceived from the server connector becomes a resource with its own set of \nrepresentations, one for each combination of the varied request headers it \nencounters.  MJ reserved judgment on the technical merits, but said he did \nunderstand what I&#39;m saying, albeit he has a better idea of the context.  I \nhaven&#39;t shared [1] with anyone else yet.\n\n-Eric\n\n\n\n\n"}}