{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"_W3tQQ0PvYh4mRgEEJSTYL4IL8s9Y6GwBdh14n3fkAK_LBsXddzsDplENSOzhcvypdTsHFXTHVyzj_Z0Fz9-uXZgpQ2w7i3GX9_rYnZ55Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: &quot;Lightweight Data Access Services&quot; and Well Designed Urls [rest-discuss]","postDate":"1161911288","msgId":6700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMWUwMWM2Zjk2NCQ1ZWZlN2NhMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","inReplyToHeader":"PDQ1NDA5NjUyLjYwNzA5MDVAc3RpY2tkb2cuY29tPg=="},"prevInTopic":6699,"nextInTopic":6701,"prevInTime":6699,"nextInTime":6701,"topicId":6685,"numMessagesInTopic":35,"msgSnippet":"Eran: I was getting the feeling of wasting time which is why I said what I said, but after contemplation the original idea is actually moot. The original idea","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 27029 invoked from network); 27 Oct 2006 01:09:14 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m35.grp.scd.yahoo.com with QMQP; 27 Oct 2006 01:09:14 -0000\r\nReceived: from unknown (HELO wx-out-0506.google.com) (66.249.82.236)\n  by mta3.grp.scd.yahoo.com with SMTP; 27 Oct 2006 01:09:14 -0000\r\nReceived: by wx-out-0506.google.com with SMTP id i30so586716wxd\n        for &lt;rest-discuss@yahoogroups.com&gt;; Thu, 26 Oct 2006 18:08:12 -0700 (PDT)\r\nReceived: by 10.90.83.14 with SMTP id g14mr2133063agb;\n        Thu, 26 Oct 2006 18:08:12 -0700 (PDT)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nReceived: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTP id 11sm255806wrl.2006.10.26.18.08.11;\n        Thu, 26 Oct 2006 18:08:12 -0700 (PDT)\r\nTo: &quot;&#39;Etan Wexler&#39;&quot; &lt;ewexler@...&gt;,\n\t&lt;rest-discuss@yahoogroups.com&gt;\r\nDate: Thu, 26 Oct 2006 21:08:08 -0400\r\nMessage-ID: &lt;011e01c6f964$5efe7ca0$0702a8c0@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nThread-Index: Acb47jdH5pe+slq+SZuaVFUnrDIYRwAbL+4w\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.2962\r\nIn-Reply-To: &lt;45409652.6070905@...&gt;\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: &quot;Lightweight Data Access Services&quot; and Well Designed Urls [rest-discuss]\r\nX-Yahoo-Group-Post: member; u=228155998; y=qYFUDKetWxrEmfs6exAuQbEdTvM7re2Jjtp8yQCW-aR1lqyLN97s\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\nEran:\n\nI was getting the feeling of wasting time which is why I said what I said,\nbut after contemplation the original idea is actually moot. The original\nidea was to piggy back on a proposed campaign to promote Microformats and\nseveral other things. But Tantek shot down the idea of a promo campaign, so\nthat made the idea moot.\n\nHowever, my reasons for wanting to piggyback on the campaign was because I\nfelt that Microformats and Well Designed Urls were synergistic.  In my view,\nI envision Microformats with my understanding of REST to be a combination\nwhich could give us what I am now calling &quot;Lightweight Data Access Services&quot;\n(or possibly &quot;Lightweight Web Services&quot;) I felt that for Microformats+REST\nto be provide usable &quot;lightweight&quot; web services would require that people be\nable to understand the URLs.  \n\nMy view for how LDAS/LWS would be used is that someone could, for example,\ngo to a Barne&#39;s & Noble (BN.COM) web page and notice that they had a button\nthat indicated the page supported LDAS/LWS (I actually have a meme for it,\nbut I&#39;m not making that public until the concept it fleshed out.)  They\nwould then be able use a bookmarklet to grab the data, or even then write a\nsimple program to grab the data from multiple files on their website, which\nwould be possibly documented at http://www.bn.com/ldas/ (this is not a &quot;well\nknown name&quot;; every website would choose how they document on their own.)\n\nYou however debated my use of REST before I could even begin to discuss the\nbenefits of the concept.  You brought up the issue of URI Opacity, which I\nwas unaware of but have since studied significantly. I now realize it is a\nprinciple that has become misunderstood and misapplied as if it were a\n&quot;religious doctrine&quot; with true believers as fervent as any religion and\nlittle debate on the subject that does not contain strong emotion with few\nwilling to even consider other&#39;s positions.  Just like religion.  But\nfortunately, Roy clarified it to say that (essentially) there is nothing\nwrong with humans contructing URIs and guessing, but client&#39;s just can&#39;t\ndepending on that behavior unless documented by the URI authority (i.e\nwebsite.)\n\nThe next issue you debated with me was whether REST required hypermedia. I\nam still unclear as to what hypermedia exactly looks like (I&#39;ve seen zero\nreal world examples in anything I&#39;ve read online) but there does seem to be\nless debate on the subject in the mail list archives and it seem that it is\ngenerally agreed that &quot;hypermedia&quot; is a requirement for REST (although I\nreserve the right to revise my opinion on that.)   Further, after reading I\ndo understand the proposed benefits of REST; i.e. it is easier and faster to\nredirect one URL than all of them, and it is (very arguably) easier to\ndefine &quot;selectors&quot; (my term) for the different services that will not change\nthan it is to define URIs for the different services that will not change,\nright?\n\nHowever, ALL of the examples of web services implementations I have seen\nthat claim to be REST-based DO NOT incorporate a &quot;hypermedia&quot; aspect.\nFurther, all the articles I have read about REST including on XML.com do not\nsay anything at all about a hypermedia requirement.  What that tells me is\nthat, besides the irovy tower academics, almost nobody in industry has any\nidea at all that REST requires hypermedia and as such most if not almost all\nimplements of http-based web services that will be labeled REST will not be\nREST according to the strick sense of this groups definition.  Most on this\nREST-DISCUSS list will know this requirement, but the vast majority of\ndevelopers in the world are not on this list.\n\nSo that then begs the following questions in my mind: If people are\nimplementing http-based web services that are like REST except for the\nhypermedia constraint:\n\n1.) Is it really a _requirement_, or is it just to incorporate hypermedia\ninto the implementation?\n2.) What happens when Real World implementations don&#39;t implement a\nrequirement?  Is it possible that would call into question if it is a\n_requirement_ or just a recommendation?\n3.) Why is it a requirement?  Is it possible that in hindsight it isn&#39;t\nreally a requirement?\n4.) If hypermedia is an absolutely a requirement, then about all those\nhttp-based web services that don&#39;t incorporate hypermedia but that are doing\nreal world legitimate work? Are they invalid?\n5.) And if everyone uses the term REST for something this group says in not\nREST, where does that leave us?  \n\nNote that for many years there were Relational Databases that did not\nincorporate all the requirements to be considered a &quot;Relational Database&quot;\n(I&#39;m actually not sure any commercial product has ever implement 100% of the\nrequirements.)  So does that not call into question what is a &quot;requirement?&quot;\n\n\nThat said, here is my take on it given what I know today:\n\n* I believe a hypermedia requirement raises the bar with respect to the\nrequirements to use.  \n\n* I believe in certain contexts, the benefits of hypermedia are absolutely\nessential such as when implementing a mission critical system where downtime\nhas signficant costs.\n\n* I believe in other contexts, the costs of hypermedia far outweight its\nbenefits, i.e. that is too much must be learned and/or too much code must be\nwritten. Consider &quot;occupational programmers&quot; that struggle to do the\nsimplest programming task because they only program 5% or 10% of their time.\nWhen they use a web service (downloading credit card transactions, for\nexample) they are just trying to streamline their work processes. If it\nbreaks, oh well they&#39;ll go fix it. But the benefits they get from having it\nworking most of the time are far beyond NOT having the implementation, and\nit implementing the hypermedia interface was too difficult they never would.\n\n* Finally I believe that REST-based systems within a corporation or between\ntrading partners is a very different prospect than http-based web services\nthat are published by a company on a publicly accessible website, i.e.\nAmazon, eBay, Google, Yahoo, Flickr, etc. etc.  Intra-company or\nInter-company it is much more likely people will need to move resources. In\na publicly accessible API, they are pretty brain-dead if they publish a URL\nthat needs to be moved.\n\nAnyway, so what would I like us to focus on to begin with?  Let&#39;s focus on\nany one of the following:\n\n* URI Opacity - Is it okay to construct URI assuming the URI authority\npublished specifications?\n* Hypermedia - Does REST *require* it, and if so WHY? Should we erect\nfences, or pave the footpaths?\n* Then, is LDAS/LSW REST?\n* Regardless of whether my LDAS/LWS proposal is REST or not, I think it\nmakes tons of sense (actually, I think it&#39;s codifying the benefits of\nMicroformats); do you disagree?\n\nI look forward to your reply and other people&#39;s input.\n\n-Mike Schinkel\nhttp://www.mikeschinkel.com/blog\nhttp://www.welldesignedurls.org/\n\n\n-----Original Message-----\nFrom: Etan Wexler [mailto:ewexler@...] \nSent: Thursday, October 26, 2006 7:05 AM\nTo: Mike Schinkel\nSubject: Re: &quot;Lightweight Data Access Services&quot; and Well Designed Urls\n[rest-discuss]\n\nMike, you wrote:\n\n&gt; I can&#39;t debate three things at once.\n\nThree things at once would be an improvement!\n\nThere are so many issues that have risen from the discussion.\n\n&gt; We need to stick to one at a time or it just become mental masturbation.\n\nI read that you would really like to discuss the merits of your original\nidea.\n\nWhat was your original idea?\n\nIt seems like you advanced several ideas in that first message to\nMicroformats Discuss\n(&lt;http://microformats.org/discuss/mail/microformats-discuss/2006-October/006\n341.html&gt;).\n\nSincerely,\nEtan.\n\n\n"}}