{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"87ZvELdLUrWsTfYgWPOEiGn1j4b-yFjCCdO7Ed3T_Bzg3lZNkfXgzuckyw9YxnYdEWtmH8n80v-WetLMyUdfc5ZRZ-CIxiUjPXGIb6HqdA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [rest-discuss] RFC for REST?","postDate":"1162929782","msgId":6742,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZTUwMWM3MDJhNyRiYjViZDQ2MCQyMTAyZmVhOUBHdWlkZXMubG9jYWw+","inReplyToHeader":"PDJFRUJDRjRELUMwQzAtNDg4OC05NjVBLTIwRTAxNTZCMjQwRkBnYml2LmNvbT4="},"prevInTopic":6741,"nextInTopic":6743,"prevInTime":6741,"nextInTime":6743,"topicId":6717,"numMessagesInTopic":58,"msgSnippet":"... style, that document is my dissertation. The problem is your PhD requires someone to have a PhD to understand it.  Of course I exaggerate, but I don t","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 21146 invoked from network); 7 Nov 2006 20:03:04 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m25.grp.scd.yahoo.com with QMQP; 7 Nov 2006 20:03:04 -0000\r\nReceived: from unknown (HELO wx-out-0506.google.com) (66.249.82.227)\n  by mta5.grp.scd.yahoo.com with SMTP; 7 Nov 2006 20:03:04 -0000\r\nReceived: by wx-out-0506.google.com with SMTP id t16so1337384wxc\n        for &lt;rest-discuss@yahoogroups.com&gt;; Tue, 07 Nov 2006 12:03:03 -0800 (PST)\r\nReceived: by 10.90.71.12 with SMTP id t12mr2521697aga.1162929783690;\n        Tue, 07 Nov 2006 12:03:03 -0800 (PST)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nReceived: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTP id 33sm7811940wra.2006.11.07.12.03.03;\n        Tue, 07 Nov 2006 12:03:03 -0800 (PST)\r\nTo: &quot;&#39;Roy T. Fielding&#39;&quot; &lt;fielding@...&gt;\r\nCc: &quot;&#39;REST Discuss&#39;&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nDate: Tue, 7 Nov 2006 15:03:02 -0500\r\nMessage-ID: &lt;00e501c702a7$bb5bd460$2102fea9@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.2962\r\nThread-Index: AccCnnHCR4+KtNHNT5W9YvdANRpE/QAB4PAw\r\nIn-Reply-To: &lt;2EEBCF4D-C0C0-4888-965A-20E0156B240F@...&gt;\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: [rest-discuss] RFC for REST?\r\nX-Yahoo-Group-Post: member; u=228155998; y=FUFkLKI5ZMgG4WbI9LGOPvqS6ANNdCrBjHUUNovFhoNvndBz9j81\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\n&gt;&gt; To the extent that such a document is possible for an architectural\nstyle, that document is my dissertation. \n\nThe problem is your PhD requires someone to have a PhD to understand it.  Of\ncourse I exaggerate, but I don&#39;t think you can understand what it&#39;s like not\nbeing able to understand what the heck your disseration is saying without\nweeks of studying just the part about REST.  99% of people aren&#39;t going to\ndo that.\n\n&gt;&gt; The only way that REST changes over time...\n\nI didn&#39;t say anything about it changing over time. I instead was saying that\nit is not very approachable for the average developer.\n\n&gt;&gt; In regards to &quot;untold hours wasted in debate&quot;, ...  It is almost never\nwasted, even when it is poorly informed.\n\nTime debating is almost always wasted when it could have been avoided by\nother more efficient means.\n\n&gt;&gt; Expecting &quot;workaday developer teams&quot; to quickly understand REST, no\nmatter how carefully it is described, is just beyond reasonable\nexpectations.\n\nI completely disagree with you, respectfully.  I think it is possible for\npeople to understand it, if presented in an easier to consume fashion.  It&#39;s\nnot rocket science, after all, it&#39;s just currently made to seem that way.\n\n&gt;&gt; No, at best all you will get is...\n\nSo that would by requirement happen if you reviewed it?\n\nFYI, I was a programming instructor for seven years, I developed all my\ntraining materials during those seven years, and also I attended numerous\ncourses on how to teach.  I also wrote a 1000 page programming book and\nworking in conjunction with a developmental editor from whom I learned a ton\nabout how to present information in an understandable manner. I know a\nlittle bit about the subject of how to present information in an\nunderstandable manner.\n\n-Mike Schinkel\nhttp://www.mikeschinkel.com/blogs/\nhttp://www.welldesignedurls.org/\n\n\n\n\n-----Original Message-----\nFrom: Roy T. Fielding [mailto:fielding@...] \nSent: Tuesday, November 07, 2006 1:57 PM\nTo: Mike Schinkel\nCc: REST Discuss\nSubject: Re: [rest-discuss] RFC for REST?\n\nOn Nov 7, 2006, at 7:01 AM, Mike Schinkel wrote:\n&gt; I think that is one of the key problems with REST, and why so many \n&gt; urban legend have grown up to surround it. Without an authoritative \n&gt; document that explains REST in work-a-day developer terms in addition \n&gt; to the rigorous language required by such authoritative documents, \n&gt; untold hours are wasted in debate and by people simply trying to grok \n&gt; it all.\n\nTo the extent that such a document is possible for an architectural style,\nthat document is my dissertation.  Anyone who claims that REST is something\nother than what is in my dissertation is just babbling nonsense -- the\ndissertation defined the term (and other people making it a buzzword won&#39;t\nchange that).  People are free to claim that there is more to &quot;web\narchitecture&quot; than what I included in REST, and that perhaps some of that\nshould have been included in REST, but REST itself is just a name chosen for\na specific style that I defined as characteristic of the best designed parts\nof the Web.\n\nThe only way that REST changes over time is in the sense that I sometimes\nneed to expand on the terse explanations provided in the dissertation,\nbecause I was in a hurry when I wrote it.  In most cases, such expansion is\nmerely pointing people to other stuff I wrote ten years ago, or about the\nentire topic of media type design which I left out because I ran out of\ntime.  There are also other styles that build upon REST, but they are *other\nstyles*.\n\nIn regards to &quot;untold hours wasted in debate&quot;, that is close to the goal of\nmy dissertation -- to introduce a way of thinking about software\narchitecture that promotes honest debate about the properties that are\ndesired and actual thought applied to the constraints chosen to achieve them\n(and their resulting trade-offs).  It is almost never wasted, even when it\nis poorly informed.\n\nMost people spend six months or so butting their preconceived notions of\nwhat&#39;s &quot;important&quot; against the REST constraints before realizing the\nbenefits of REST.  I am not surprised at all by that, since almost all of\nthe design behind REST is focused on applications that need to survive for\ndecades of independent evolution.  We all know that our software industry\nrarely sees beyond today&#39;s build.  Expecting &quot;workaday developer teams&quot; to\nquickly understand REST, no matter how carefully it is described, is just\nbeyond reasonable expectations.\n\n&gt; Publishing such a\n&gt; document as an RFC or the equivalent for the IETF, with significant \n&gt; examples would go a long way to avoid so much needless thrashing. \n&gt; Especially when you consider how passionate many people on this list \n&gt; are in their beliefs that strict adherence to the tenents of REST are \n&gt; essential.\n&gt;\n&gt; So I guess I&#39;m calling the question! Can we create an RFC, or some \n&gt; other authoritative document that defines REST written in a language \n&gt; understandable by those not accustomed to reading and interpreting \n&gt; specifications?\n\nNo, at best all you will get is a committee that has some vague notion of\nwhat they consider to be design to write down the least common denominator\nof misinformed &quot;best practice&quot; based upon whatever Microsoft chose to\nimplement in its last release.  The IETF has made a habit of that recently.\n\nI might write another book some day, assuming I ever get in the swing of\nwriting on a regular basis (and ignoring email).  I doubt that I would call\nit a REST book, though it would contain REST.  I am sure the publisher would\ntry to market it that way anyway.\n\n....Roy\n\n\n"}}