{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":175757792,"authorName":"Roy T. Fielding","from":"&quot;Roy T. Fielding&quot; &lt;fielding@...&gt;","profile":"roy_fielding","replyTo":"SENDER","senderId":"EB5FwWhgN5KVRaq8oIlpPODlITM-PJZR2YlLT0AphzAl7Wg5Hjaf6YdOSbudUZfHM8zkytqL6OpjlEzBpLgDhbYOEax8ZRCoGEH-QA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] RFC for REST?","postDate":"1162937198","msgId":6757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBM0Q1MjRDLTMzQTctNDAwRC04QUFBLUJGRURFM0U3QkM5M0BnYml2LmNvbT4=","inReplyToHeader":"PFBpbmUuTkVCLjQuNjQuMDYxMTA3MTAwNDU5MC44OTRAcGFuaXgyLnBhbml4LmNvbT4=","referencesHeader":"PDAwNmUwMWM3MDI3ZCQ5MDU2ZTU5MCQyMTAyZmVhOUBHdWlkZXMubG9jYWw+IDwyRUVCQ0Y0RC1DMEMwLTQ4ODgtOTY1QS0yMEUwMTU2QjI0MEZAZ2Jpdi5jb20+IDxQaW5lLk5FQi40LjY0LjA2MTEwNzEwMDQ1OTAuODk0QHBhbml4Mi5wYW5peC5jb20+"},"prevInTopic":6756,"nextInTopic":6758,"prevInTime":6756,"nextInTime":6758,"topicId":6717,"numMessagesInTopic":58,"msgSnippet":"... Yes, but keep in mind that this was early in the process of HTTP/1.1. It is the HTTP object model that I developed in 1994-95 as part of the early","rawEmail":"Return-Path: &lt;fielding@...&gt;\r\nX-Sender: fielding@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 78897 invoked from network); 7 Nov 2006 22:06:17 -0000\r\nReceived: from unknown (66.218.67.36)\n  by m37.grp.scd.yahoo.com with QMQP; 7 Nov 2006 22:06:17 -0000\r\nReceived: from unknown (HELO scorpio.lunarpages.com) (209.200.229.70)\n  by mta10.grp.scd.yahoo.com with SMTP; 7 Nov 2006 22:06:17 -0000\r\nReceived: from wsip-70-183-62-251.oc.oc.cox.net ([70.183.62.251] helo=[10.2.8.56])\n\tby scorpio.lunarpages.com with esmtpa (Exim 4.52)\n\tid 1GhZ6x-0002Or-N9; Tue, 07 Nov 2006 14:08:03 -0800\r\nIn-Reply-To: &lt;Pine.NEB.4.64.0611071004590.894@...&gt;\r\nReferences: &lt;006e01c7027d$9056e590$2102fea9@...&gt; &lt;2EEBCF4D-C0C0-4888-965A-20E0156B240F@...&gt; &lt;Pine.NEB.4.64.0611071004590.894@...&gt;\r\nMime-Version: 1.0 (Apple Message framework v752.2)\r\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\r\nMessage-Id: &lt;6A3D524C-33A7-400D-8AAA-BFEDE3E7BC93@...&gt;\r\nCc: REST Discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nContent-Transfer-Encoding: 7bit\r\nDate: Tue, 7 Nov 2006 14:06:38 -0800\r\nTo: lucas@...\r\nX-Mailer: Apple Mail (2.752.2)\r\nX-AntiAbuse: This header was added to track abuse, please include it with any abuse report\r\nX-AntiAbuse: Primary Hostname - scorpio.lunarpages.com\r\nX-AntiAbuse: Original Domain - yahoogroups.com\r\nX-AntiAbuse: Originator/Caller UID/GID - [0 0] / [47 12]\r\nX-AntiAbuse: Sender Address Domain - gbiv.com\r\nX-Source: \r\nX-Source-Args: \r\nX-Source-Dir: \r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\r\nSubject: Re: [rest-discuss] RFC for REST?\r\nX-Yahoo-Group-Post: member; u=175757792; y=0MdPZroctXaaHcUE1Tlc2uwvLUw35a4cyiQ8V4uez2LyiYzC_X3F\r\nX-Yahoo-Profile: roy_fielding\r\n\r\nOn Nov 7, 2006, at 12:07 PM, Lucas Gonze wrote:\n&gt; On Tue, 7 Nov 2006, Roy T. Fielding wrote:\n&gt;&gt; that document is my dissertation.  Anyone who claims that REST is\n&gt;&gt; something\n&gt;&gt; other than what is in my dissertation is just babbling nonsense\n&gt;\n&gt; I was under the impression that REST was a formalization of the  \n&gt; architectural design that the HTTP 1.1 group developed, the thing  \n&gt; formerly known as &quot;the web object model.&quot;\n\nYes, but keep in mind that this was early in the process of HTTP/1.1.\nIt is the &quot;HTTP object model&quot; that I developed in 1994-95 as part of\nthe early HTTP/1.0 spec authoring and HTTP/1.1 design process, back\nwhen Henrik Frystyk Nielsen and I were the &quot;HTTP 1.1 group&quot; (i.e.,\nbefore the IETF WG was even initiated).  The model was not developed\nby consensus -- only the results after applying it were subjected to\nconsensus.\n\nWe would discuss various proposals for HTTP (including our own) and\nI would try to figure out why each fit (or didn&#39;t fit) the model, and\nuse that to either change the proposal or change the model.  I don&#39;t\neven remember sharing that with Henrik -- we just talked things out,\ntried a few examples on the whiteboard and in various implementations,\nand came to a general understanding of the model through that process.\n[I am probably oversimplifying that process -- we each had our own\nimplementations (CERN libwww and httpd on the one hand, libwww-perl\nand NCSA httpd on the other) and were friends with most of the major\nWeb developers at the time, so everything we did was influenced by a\nlarger cast of characters, most of whom were probably amused by our\nattempts to standardize the Web while they were busy with startups.]\n\nLater, in the summer of 95 when I was at MIT, I had a discussion\nwith TimBL about the Web architecture and the software engineering\nprinciples that he applied during its first few years of development.\nThis was four years into my Ph.D. research in Software (UCI avoided\ncalling it SE research, since our group has a very broad perspective\non software development) and my interest in the Web was only indirectly\nrelated to my studies at the time (a.k.a., my Phase II drift).\nHe suggested that I study the software engineering principles that\ninfluenced him during the early Web development, and the role of\nsimplicity in particular.  I was far too busy with the standards\neffort by that point, but the idea got stuck in the back of my mind.\n\nThroughout the HTTP standardization process, I was called on to defend\nthe design choices of the Web.  That is an extremely difficult thing\nto do within a process that accepts proposals from anyone on a topic\nthat was rapidly becoming the center of an entire industry.  I had\ncomments from well over 500 developers, many of whom were distinguished\nengineers with decades of experience, and I had to explain everything\nfrom the most abstract notions of Web interaction to the finest details\nof HTTP syntax.  That process honed my model down to a core set of\nprinciples, properties, and constraints that are now called REST.\n\nI didn&#39;t consider that to be my dissertation topic until some point\nduring the WebDAV discussions, when Larry Masinter said something along\nthe lines that the model itself was worthy of a dissertation focus.\n\n&gt; Logically, REST really had to predate HTTP 1.1 in order for HTTP  \n&gt; 1.1 to be so RESTful.\n&gt;\n&gt; No?\n\nNo.  That is more of a philosophical question than a logical one.\nHTTP/1.1 is a specific architecture that, to the extent I succeeded\nin applying REST-based design, allows people to deploy RESTful\nnetwork-based applications in a mostly efficient way, within the\nconstraints imposed by legacy implementations.  The design principles\ncertainly predated HTTP, most of them were already applied to the\nHTTP/1.0 family, and I chose which constraints to apply during the\npre-proposal process of HTTP/1.1, yet HTTP/1.1 was finished long before\nI had the available time to write down the entire model in a form\nthat other people could understand.  All of my products are developed\niteratively, so what you see as a chicken and egg problem is more\nlike a dinosaur-to-chicken evolution than anything so cut and dried\nas the conceptual form pre-existing the form.  HTTP as we know it\ntoday is just as dependent on the conceptual notion of REST as the\ndefinition of REST is dependent on what I wanted HTTP to be today.\n\nI guess a better question is: if Roy hadn&#39;t bothered to develop\nthe model and was not the one editing the specification, would HTTP\nbe RESTful today?  *shrug*  Looking at what happened to WebDAV after\nI stopped participating, and then versioning, ACLs, and now CalDAV,\nI know what my biased answer would be.  Contrast those to APP, which\nwas consciously developed according to the style (mostly without\nneed of my participation).\n\n\n....Roy  [who still remembers people saying publicly that any serious\n           standardization of the Web should be based on IIOP, not HTTP]\n\n\n"}}