{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"xxMPanlfZ2pevhhannwja9Pr6eNHzDSxBP1RN5YKC9mKGlIzDpLjv2I2MIxmV1eeZ9biZOmGlq0-6CL8U0w8jYj3WOxPKMEUsW8c2AvYVw","spamInfo":{"isSpam":false,"reason":"3"},"subject":"RE: [rest-discuss] REST design question","postDate":"1163502039","msgId":6964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFcxODQzMjUxNTkyNTUyMDExNjM1MDIwMzlAbWFpbC5tYWlsc25hcmUubmV0Pg=="},"prevInTopic":6963,"nextInTopic":6966,"prevInTime":6963,"nextInTime":6965,"topicId":6804,"numMessagesInTopic":134,"msgSnippet":"... Oh good grief.  Those two URLs were not presented within the context of my _example_, they were presented as _reference_ URLs in a sidebar discussion which","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 17254 invoked from network); 14 Nov 2006 11:00:46 -0000\r\nReceived: from unknown (66.218.67.33)\n  by m28.grp.scd.yahoo.com with QMQP; 14 Nov 2006 11:00:46 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (206.246.200.185)\n  by mta7.grp.scd.yahoo.com with SMTP; 14 Nov 2006 11:00:44 -0000\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nReceived: from mail.mailsnare.net (v167.mailsnare.net [206.246.200.167])\n\tby mail.mailsnare.net (Postfix) with ESMTP id 0430A2273B;\n\tTue, 14 Nov 2006 11:00:38 +0000 (UTC)\r\nTo: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W184325159255201163502039@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Tue, 14 Nov 2006 11:00:39 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 2:3:4:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: RE: [rest-discuss] REST design question\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\n&gt;\n&gt;&gt;&gt; So yes, you&#39;re right, there is such a thing as URI fragment\n&gt;&gt;&gt; identifiers and they are indeed client-side. But we aren&#39;t\n&gt;&gt;&gt; talking about them at all in this example.\n&gt;\n&gt;Uh, beg to differ (and I do appreciate your help and I&#39;m sorry for being\n&gt;pedantic, but...); these were the URLs we had as an example:\n&gt;\n&gt;http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.16\n&gt;http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.35\n&gt;\n&gt;Those follow the semantics of http fragments (i.e. id=&#39;attributes&#39;, not\n&gt;XPATH to element) AFAIU. But my reason for being pedantic is to get to the\n&gt;bottom of understanding what can be done with HTTP given it&#39;s current\n&gt;impementations? According to WebArch[1], HTTP can&#39;t use fragment\n&gt;identifiers for other than bookmarks. Right?\n&gt;\n\nOh good grief.  Those two URLs were not presented within the context of my \n_example_, they were presented as _reference_ URLs in a sidebar discussion \nwhich was not even referring to my example.  If you&#39;re getting confused \nbetween hypothetical URLs using example.org and _references_ to specific \nsections of well-known standards on w3.org, then perhaps you&#39;re in over your \nhead as far as writing any articles is concerned?  The _example_ URLs are \neasily recognized by their example.org domain, the pathnames /people/ and \n/places/, and the resource identifiers /bob, /virginia, /maryland, \n/bighugefile.xml and /bighugefile.xml/root/chapter/verse/h1/text().\n\nAt no point in my _example_ are URI fragment identifiers used, and at no \npoint in the discussion did my _example_ include the use of HTTP range \nrequests.  I&#39;m not sure how you&#39;re confusing the fragment identifier \nassociated with a hypertext anchor in a linked representation of RFC 2616 \ncovering HTTP range requests, with section 3.5 of RFC 3986 which defines URI \nfragment identifiers, or section 12.2.3 of HTML 4.01 covering hypertext \nanchors -- or applying any of the three to the _example_ I&#39;ve given.  They \nare not the same thing, HTTP couldn&#39;t restrict the use of fragment \nidentifiers only to bookmarks because URI fragments have nothing to do with \nHTTP, even if it does say that in the nonnormative WebArch document.\n\nI would say *HTML* can&#39;t use URI fragment identifiers for other than \nbookmarks.  The only thing *HTTP* says about the fragment identifier is... \nnothing.  It&#39;s a client-side implementation not a network issue, URI \nfragments simply are not transferred as part of HTTP requests.  URI fragments \nare an issue of media type design, so they&#39;re taken into consideration under \nthe REST style, but not as a direct issue of architecture.  REST describes \nthe concept of representations and media types, and explains that these \nconsiderations impact user-perceived performance.  So media types are \narchitectural in REST, except for how URI fragment identifiers are handled \nwhich is pure user-agent logic which REST could care less about.\n\nSo the URI fragment rarely if ever comes into play in the context of \narchitectural design.  If I use hypertext anchors to enumerate posts on a \nweblog in such a way that they may have URI fragment identifiers, I am not \nmaking those bookmarks separate resources.  How they factor in to permalink \ndesign and site usability is a good discussion for welldesignedurls.org, \nMike, but like singular vs. plural this whole discussion is beyond the scope \nof REST as an architectural style.  At this point, I can only wish I had \nlinked like so:\n\nhttp://www.ietf.org/rfc/rfc2616.txt (see sections 14.16 and 14.35)\n\n;-)\n\nURI fragments are client-side application logic on the user agent, just as \nquery strings are server-side application logic on the origin server and \n(sometimes) intermediary caches.  Provided URI opacity is understood, REST \ndoesn&#39;t care about application logic, only the interactions between \ncomponents.  The guideline is to choose the most efficient media type for \ntransferring application state on any given request/response, or to use \ncontent negotiation to choose the most efficient media type available for the \nrequesting client -- the quality of those representations varies, not the \ncontent contained within since they&#39;re all representations of the same \nresource.\n\nIn &#39;application/svg+xml&#39;, the fragment identifies the X, Y and Z coordinates \nof a particular item within a resource.  For example, latitude longitude and \nzoom for a map.  The entire map, or fragment of a map as a standalone \nresource with its own URI (/maps/united_states/colorado.svg could be a \nfragment derived from /maps/united_states.svg, either way the fragment would \nrefer to the same geographical point), gets transferred to the client.  The \nclient worries about centering the map on the target, which is bookmarking, \nand the zoom factor -- which isn&#39;t a bookmark so much as a parameter.\n\nWhen a fragment identifier is used in a URI, it is unambiguously and \nexplicitly understood that it is referring to the same resource identified if \nthe fragment is removed.  URI opacity ends at the octothorpe.  No inference \nmay be drawn that two URIs identify the same resource, unless they are \ncharacter-for-character equivalent, but the first step in determining \nequivalence is removing any fragment identifiers.\n\nSo a URI fragment is not anything remotely like a range request, or a request \nfor a partial resource.  Since the URI fragment is not transferred with the \nrequest, it is not actually possible to use it as the basis to retrieve a \ndocument fragment in a server application, REST or not.  You don&#39;t get a \ndocument which contains _just_ section #14.16 or _just_ section #14.35 from \nw3c.org when you dereference those reference links.\n\n&gt;\n&gt;Those follow the semantics of http fragments (i.e. id=&#39;attributes&#39;, not\n&gt;XPATH to element)\n&gt;\n\nThose transfer the entire document, not a fragment of the document.  The \nproblem under discussion here remains the case of &quot;how do we avoid \ntransferring the entire document to scale the application more efficiently?&quot;  \nMy example suggests implementing XPATH as a design pattern for a URI \nallocation scheme, for the purpose of exposing a document fragment at its own \nunique URL as a possible solution to the problem at hand.\n\nThis is hardly an inherent property in URI or a common design pattern, and \nthe w3c isn&#39;t attempting to only serve a partial document, so we wouldn&#39;t \nexpect w3c.org&#39;s URI allocation scheme to follow the semantics of XPATH when \nid attributes (HTML&#39;s hypertext anchors) and URI fragment identifiers provide \nan ideal solution to the bookmarking problem they *are* trying to solve \n(which is why I like to post links to w3c instead of ietf for hyperlinked \nversions of key specs).\n\nNow that you&#39;ve taken a simple, concise example thoroughly off-topic and \nrequired me to use ever-longer replies to straighten out your conflation \nbetween range requests, document fragments and URI fragment identifiers it \nseems to me that my explanations are beginning to exceed the length of the \nRFCs you don&#39;t appear to be reading.  I have to stop replying now out of \nsheer exhaustion, I did try, but if anyone has questions regarding the \nspecific example I gave and not any of this other off-topic discussion of \nsingular vs. plural or fragments vs. fragments etc. I&#39;m always happy to \nclarify (or bore you to tears trying).\n\n-Eric\n\n\n\n\n"}}