{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"17n73VrLLGguZc9oL3TrmXgX3eN5IG87yi4OZZrgjLEArwu2RFoNbsagGXeIA7b6A3-gFiNP98pjidlzaYNjPoMQwK0EJXDEXwbGJj8uMA","spamInfo":{"isSpam":false,"reason":"3"},"subject":"RE: [rest-discuss] REST design question","postDate":"1163605748","msgId":7014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFcxNTY0MTkwNDI4NjQ2MTE2MzYwNTc0OEBtYWlsLm1haWxzbmFyZS5uZXQ+"},"prevInTopic":7013,"nextInTopic":7018,"prevInTime":7013,"nextInTime":7015,"topicId":6804,"numMessagesInTopic":134,"msgSnippet":"... Float to the top, your printout of HTTP response codes.  If there is a response code for something, it is inherently RESTful to implement, like method not","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 54408 invoked from network); 15 Nov 2006 16:26:09 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m39.grp.scd.yahoo.com with QMQP; 15 Nov 2006 16:26:09 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (206.246.200.187)\n  by mta9.grp.scd.yahoo.com with SMTP; 15 Nov 2006 16:26:09 -0000\r\nReceived: from mail.mailsnare.net (v167.mailsnare.net [206.246.200.167])\n\tby mail.mailsnare.net (Postfix) with ESMTP id C23442D06A;\n\tWed, 15 Nov 2006 15:49:07 +0000 (UTC)\r\nTo: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W15641904286461163605748@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Wed, 15 Nov 2006 15:49:08 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nX-eGroups-Msg-Info: 2:3:4:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: RE: [rest-discuss] REST design question\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\n&gt;\n&gt;Please do not assume that I am not reading them.  By now I have (literally)\n&gt;an 8&quot; stack of documents printed 2-up, front & back (using Fineprint) that I\n&gt;have all read and marked up during the past month (and a few I have read\n&gt;several times.) But, as I hope you can appreciate, I don&#39;t have photographic\n&gt;memory so there are parts I don&#39;t remember and there are parts I didn&#39;t\n&gt;understand for lack of examples and for poor writing (i.e. passive voice.)  \n&gt;\n\nFloat to the top, your printout of HTTP response codes.  If there is a \nresponse code for something, it is inherently RESTful to implement, like \n&quot;method not allowed&quot;.  That&#39;s a quick-reference answer that yes, a resource \ncan be restricted by HTTP method.  Keep that close at hand.\n\n&gt;\n&gt; I headed down this road taking this crash course in REST, W3C specs, IETF\n&gt;specs, etc. so I don&#39;t end up looking like an ignorant ass when I start\n&gt;publishing articles about URLs *and* I&#39;m about three weeks behind where I&#39;d\n&gt;hoped to be by now.  Please forgive me that I can&#39;t learn in a few day the\n&gt;fine details of specifications and theory that have been developed over more\n&gt;than they past 15 years. I&#39;m good, but I&#39;m not that good.  \n&gt;\n\nWell, part of the problem is I don&#39;t know where you&#39;re coming from on any of \nthis.  If you were a tech journalist looking to give a rundown on the \nbenefits of REST in terms an executive can understand, then I wouldn&#39;t expect \nyou to even attempt to learn what REST is.  Finding some lay-term \nunderstanding of REST as some sort of a press kit is needed, IMHO.\n\nSo if you&#39;re taking that approach then the rough idea certainly suffices, but \nyou&#39;re coming across _exactly_ how you just described -- like you&#39;re trying \nto pick up the fine details in just a few days.  That, or like you think that \nit should be possible in a few short days to grasp everything about REST you \nneed to know for your problem area of URI design.\n\nThere&#39;s nothing wrong with admitting in your writings that you are not an \nexpert, but a pragmatic advanced user.  Think along the lines of Jerry \nPournelle&#39;s &quot;Chaos Manor&quot; column.  Jerry likes to understand the technologies \nhe is implementing well enough to explain them, and man enough to admit when \nfeedback has shown that he was wrong.  He isn&#39;t interested in explaining why \nthings don&#39;t work, so much as explaining how something can be made to work \nthrough trial and error, common sense and determination.  Once he&#39;s learned \nhow to implement something well by making mistakes, that is when he writes \nabout the experience.  He passes on his learning, not his expertise.\n\nReally, I don&#39;t think you can understand how REST should guide the design of \nURI allocation schemes without actually understanding REST.  You certainly \ncan&#39;t learn or teach REST by focusing on URIs.  As I&#39;ve mentioned, much of \nwhat you want to talk about isn&#39;t actually REST-related anyway.  There is no \nideal URI scheme, there is only the URI scheme which is ideal for the \nsituation at hand.\n\nMaybe you shouldn&#39;t worry about what is and isn&#39;t REST in your writings.  \nFocus on design choices and why they are made for a particular \nimplementation.  One thing Pournelle never does, outside the realm of his \nscience fiction writing, is speculate about technologies he isn&#39;t actually \nimplementing hands-on.  He reports on his experiences, including both his \nsuccesses and failures.  You only come across as an ass when you claim to be \nan authority about something when you aren&#39;t, so don&#39;t claim to write about \nRESTful URI design.\n\nWrite about learning as you go, nothing wrong with that.  Issues like URI \nfragment identifiers, or singular vs. plural, are excellent subjects for your \nwriting just don&#39;t claim that everything URI-related has REST implications.  \nFocus on a problem area.  Find some examples.  Compare and contrast them.  \nSolicit outside opinions on the relative merits of your samples, particularly \nas regards the RESTfulness of these example implementations.  Summarize your \nfindings in an article wherein you are the journalist, not the authority.\n\nFor example.  Have you ever visited salon.com and seen an article, which \nconsists of a summary plus a link to a sponsor such that one must view a \nFlash advertisement before proceeding to the complete article?  Have you ever \nnoticed what a mess that implementation is, URI-wise?  Now there&#39;s a problem \nspace in which devising a RESTful solution consists almost entirely of URI \nallocation scheme design.  (A URI scheme is like http:// or file://, the \ndesign pattern for a set of URIs is called a URI allocation scheme.  I use \n&quot;URL&quot; to mean a URI which has been allocated and is meant to be dereferenced.)\n\nSuch arrangements are quite common on the web, it isn&#39;t hard to isolate out \na brief-but-interesting example article from several different sites which \nimplement such advertwalls and write about the differences in their \nfunctionality and URI allocations.  Can the resource be bookmarked, or only \nthe summary?  Is the advertising requirement a one-time thing, or is there a \ntime limit to read the article like on salon.com before another ad must be \nloaded?\n\nHere&#39;s the important concept, if those application requirements change over \ntime, or don&#39;t exist for some pages (not all of salon.com&#39;s content is \nadvertwalled, but their URI allocation scheme is inconsistent), does the URI \nallocation scheme need to be changed?  If an article is moved from premium to \nnon-premium or vice-versa, will bookmark links to it from other websites \nbreak as a result?  Not if the URLs are well designed, in which case the \nstatus change happens in the server logic where it belongs not in the URLs.\n\nAlso, if an ad strikes me as funny and I want to share it with my friends, \ncan I bookmark it, or will 99.9% of the web keep missing out on this viral \nmarketing opportunity by allowing these advertwall ads to be bookmarked?\n\nDo you see where I&#39;m going with this?  Focus your writings on developing \npragmatic URI-based solutions to problems, by soliciting outside advice on \nREST rather than trying to focus on REST, and you&#39;ll be providing a &quot;REST by \nexample&quot; service without needing to know REST yourself.  I&#39;ll post a followup \nmessage in a minute, first read this link:\n\nhttp://www.25hoursaday.com/weblog/PermaLink.aspx?guid=75a5975d-ca85-452a-94cb-46cfcf0ad67f\n\nWriting a recurring column about any particular topic is tough, the writer \nneeds a &quot;well to draw from often&quot; or &quot;whipping post&quot;.  I like Dare Obasanjo \njust fine, but Microsoft&#39;s URLs need some serious help.  They have so many \ndifferent URI allocation schemes, and not one of &#39;em is RESTful.  But just \nabout anything you come up with, even if it isn&#39;t REST, will likely be an \nimprovement.\n\n-Eric\n\n\n\n"}}