{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"UljxWjhgOR_vLYQ0b3J4K4KxMih-Zo_8Gt0SOXYq2a1bPrnPv3luf2OgoUICS64AGb8BsDa4fzsj3SLxmbp1Q2njJrlZV9HfM3AfS3VtZw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [rest-discuss] Re: Request for feedback: REST for the Rest of Us","postDate":"1167953399","msgId":7444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3MmMwMWM3MzA1OCQ0MDhlNDc3MCQyMTAyZmVhOUBHdWlkZXMubG9jYWw+","inReplyToHeader":"PDc5N0JDM0RFLUEwNTktNDE0Qy1BQ0M2LTUwRTdCMkQzRjRBNkBnYml2LmNvbT4="},"prevInTopic":7443,"nextInTopic":7445,"prevInTime":7443,"nextInTime":7445,"topicId":7355,"numMessagesInTopic":134,"msgSnippet":"... I guess my terminology was confusing. Are you saying then that I CAN have a fully RESTful app that uses the following three URLs the same? ","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 6111 invoked from network); 4 Jan 2007 23:31:36 -0000\r\nReceived: from unknown (66.218.67.33)\n  by m27.grp.scd.yahoo.com with QMQP; 4 Jan 2007 23:31:36 -0000\r\nReceived: from unknown (HELO wx-out-0506.google.com) (66.249.82.236)\n  by mta7.grp.scd.yahoo.com with SMTP; 4 Jan 2007 23:31:36 -0000\r\nReceived: by wx-out-0506.google.com with SMTP id i29so7826027wxd\n        for &lt;rest-discuss@yahoogroups.com&gt;; Thu, 04 Jan 2007 15:30:01 -0800 (PST)\r\nReceived: by 10.70.116.1 with SMTP id o1mr41826775wxc.1167953400803;\n        Thu, 04 Jan 2007 15:30:00 -0800 (PST)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nReceived: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTP id 45sm41497160wri.2007.01.04.15.30.00;\n        Thu, 04 Jan 2007 15:30:00 -0800 (PST)\r\nTo: &quot;&#39;Roy T. Fielding&#39;&quot; &lt;fielding@...&gt;\r\nCc: &lt;rest-discuss@yahoogroups.com&gt;\r\nDate: Thu, 4 Jan 2007 18:29:59 -0500\r\nMessage-ID: &lt;072c01c73058$408e4770$2102fea9@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nIn-Reply-To: &lt;797BC3DE-A059-414C-ACC6-50E7B2D3F4A6@...&gt;\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.3028\r\nThread-Index: AccwTg3Fxzyj2tlFStOdzcN6QP8J6wAAEk/w\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: [rest-discuss] Re: Request for feedback: REST for the Rest of Us\r\nX-Yahoo-Group-Post: member; u=228155998; y=4nRhIFW4sPENeFTj_DunDITnW56jhbjrHgds50fzy7jvEBPkMf7J\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\nRoy T. Fielding wrote: \n&gt; &gt; Roy T. Fielding wrote:\n&gt; &gt; &gt; The resource in HTTP is the mapping from the entire identifier \n&gt; &gt; &gt; (including scheme, authority, path, and query) to a set of values.\n&gt; &gt; &gt; For two resources to be the same, they must map to the \n&gt; same set of \n&gt; &gt; &gt; values for all time. There is no way to determine that by \n&gt; inspecting \n&gt; &gt; &gt; the identifiers, aside from scheme-defined equivalence.\n&gt; &gt;\n&gt; &gt; I think I get what you are saying, but I want to be sure. Basically \n&gt; &gt; you are saying that each of the following URLs point to a DIFFERENT \n&gt; &gt; resource as far as REST is concerned, correct:\n&gt; \n&gt; No.  Why would I have said &quot;For two resources to be the same, \n&gt; ...&quot; if I thought that changing a URI always resulted in \n&gt; different resources?\n&gt; They might be different resources, the client generally won&#39;t \n&gt; be able to figure that out, so the only safe assumption is \n&gt; that they are different resources until stated otherwise by \n&gt; the server.\n\nI guess my terminology was confusing. Are you saying then that I CAN have a\nfully RESTful app that uses the following three URLs the same?\n\n\thttp://www.foo.com\n\thttp://www.foo.com/\n\thttp://www.foo.com/index.php\n\nBTW, I am differentiating from what REST requires of a resource to the\nbroader view of resources on the web because we all know the web is not 100%\nRESTful as globally implemented by many domain holders.\n\n&gt; The ultimate goal is to choose the one true identifier that \n&gt; will always map to the intended resource such that the link \n&gt; author (and the millions of people who subsequently copy or \n&gt; bookmark that link) never have to change the link. \n\nI think you are coupling constraints. I could easily have three indentifiers\nthat point to the same resource (as you implied above, I think) that ALL\nnever change.  I could also limit to one single identifier per resource, and\nthen arbitrarily change it. So I don&#39;t think narrowing the focus to just one\nidentifier necessarily does any better job of ensuring that that one\nidentifier never changes. Yes chances are that in some cases one is easier\nto keep from changing than multiple, but if the URL authority architects its\nsite in advance with multiple persistent URLs per resource in mind then five\nURLs pointing to the same resource are no less likely to change then two\nURLs per resource or even one URLs per resource.\n\nThat said, over than the obvious, what&#39;s wrong with links changing? And I&#39;m\nnot being pedantic, I&#39;m exploring out of the box thinking.  Is it bad to\nchange a link if that link returns a 301 redirect to the new link?  If so,\nwhy?  I have other thoughts on the matter of broken links, but as I plan to\nblog them I&#39;ll hold them for now; I&#39;ll email the list after I make those\nposts.\n\n&gt; If there are many URIs for a given resource, the best \n&gt; implementation is for all of the other URIs to redirect to \n&gt; the one URI that is deemed to be &quot;best&quot; for the resource&#39;s \n&gt; unique semantics.  The reason for that is not REST or Web \n&gt; Architecture (though both are specifically designed to enable \n&gt; it): the reason is network economics as expressed by power \n&gt; laws, Metcalfe&#39;s law, PageRank, and a hundred other \n&gt; restatements of the factors that place value on social networks.\n\nI see the &quot;best practices&quot; you are citing as optimizing for certain benefits\nat the expense of others. I&#39;m currently doing research to determine how we\ncan optimize for both because I don&#39;t think we should have to settle for one\nand not the other.\n\n&gt; REST works because it makes absolutely no attempt to \n&gt; understand what the resource is, how it might be implemented, \n&gt; or the scope of how it will change over time.  It eliminates \n&gt; the semantic burden of understanding by focusing only on the \n&gt; interface as a means of hiding knowledge from the other side, \n&gt; yet communicating all that needs to be said in the same way \n&gt; that two people communicate -- tossing representations across \n&gt; the gap with a relatively small number of pitch inflections \n&gt; to indicate what is expected in return.  In short, REST \n&gt; doesn&#39;t care what the resource is or how many URIs identify \n&gt; the same resource, because to care would require \n&gt; understanding that would lead to coupling which is more \n&gt; dangerous than inefficiency.\n\nThat sounds reasonable. What do you consider to be &quot;the pitch inflections?&quot;\nContent type? Other?\n\n&gt; Such communication theory is a lot more abstract than REST, \n&gt; REST is a lot more abstract than Web Architecture (URI, HTTP, \n&gt; HTML, ...), and Web Architecture is somewhat more abstract \n&gt; than any current implementation of that architecture (Apache \n&gt; httpd, Mozilla Firefox, etc.).  And yet they all need to \n&gt; influence each other, in various ways, when we attempt to \n&gt; design changes to a living system.\n\nBTW, throughout history there have been &quot;specifications&quot; designed to\nconstrict human behaviour. One of the better known sets of specifications in\nthe Western world are &quot;The 10 Commandments&quot; and all it&#39;s derivatives. And as\nwith most other specifications that have followed, including those you\nmention, they really were designed for the good of society. \n\nHowever as we all knowm people often don&#39;t follow them, and sometimes they\nhave good reasons and sometimes bad. My interest is in finding ways to\neither change the enviroment so that the reasons they don&#39;t follow the rules\nno longer apply, or to augment the rules so that new goals can be achieved\nin other ways while still maintaining the fundamental benefits to society.\nIn cases where the rules are &quot;handed down by God&quot; my approach doesn&#39;t play\ntoo well but when we are talking technology one of the beauties is that we\ncan often add another layer to meet the new goals without sacrificing the\nold ones. \n\nAs with any rules or sets of specifications, there are those who are steeped\nin them and have working with them for years. Those people have often\nunconsciously accepted many constraints. Progress is often made by people\nwho &quot;don&#39;t know any better&quot; than to questions those constraints that have\nbeen unconsciously accepted by so many. Understandably, those with\nsignificant experience are upset by the things that the newcomers question\nfor hopefully obvious reasons. And the newcomers usually find that the\nconstraints embraced by the experienced are constraints for good reason. But\nevery so often the newcomers are able to identify unconsciously accepted\nconstraints that really were not constraints after all, and this is when\nprogress and innovation is made.\n\nRoy, I am one of those newcomers and you are clearly highly experienced. I\nhave identified numerous issues that seem to plague the web community\nrelated to my research on URLs, and I researching ways to address some of\nthose issues. I ask in advance for you to forgive me of any questions I may\nask or any concepts I may propose now or in the future even if you feel that\nyou&#39;ve already been down that path with others. As I go about trying to\nidentify some of those unconsciously accepted constraints I will undoubtedly\nlearn the benefits of most of those constaints, but I also hope to uncover\nsome that really were not constraints at all. Understand I have gained great\nrespect for you and the community the brief time I&#39;ve been participating and\nthat whatever my future involvement, my goal is to ensure that I uphold the\nweb&#39;s principles while doing nothing to harm it either.\n\nPlease remember that at one point in time you were the newcomer, and you\nhave great ideas which turned out to be good. Please give me the same\nopportunities you were given to research and then question, and it is\npossible I may ultimately make some important contributions myself.  \n\nThanks for listening.\n\n-- \n-Mike Schinkel\nhttp://www.mikeschinkel.com/blogs/\nhttp://www.welldesignedurls.org/\n\n\n\n"}}