{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":184797058,"authorName":"Benjamin Carlyle","from":"Benjamin Carlyle &lt;benjamincarlyle@...&gt;","profile":"fuzzybsc","replyTo":"SENDER","senderId":"Jwdj7PTEKROHFe4iynzsJtIiIyF1tVHILwv5uosqJ7ijQcsmVhFYsn9AZ4UWfnVH5wRsV2XEZCk6GJap2BXAHI7MB4j_fzuPRrCVC_pwxGuuGoHjHZjX35E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Atompub missed opportunity","postDate":"1168144663","msgId":7482,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNjgxNDQ2NjMuMzE3NzIuNDIuY2FtZWxAbG9jYWxob3N0LmxvY2FsZG9tYWluPg==","inReplyToHeader":"PDkyNzQ0MWIzMDcwMTA1MTI0MWgzMTg5ZGNiZXIxZWFlNDU2M2ZiNWQ2NDY1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDkyNzQ0MWIzMDYxMjI4MTI1N2w3ZTc4MjQyYnM5NTYyMjBiZTFjNTFmZTQ2QG1haWwuZ21haWwuY29tPgkgPDkyNzQ0MWIzMDYxMjMwMTcwOGkyMGE5YWMyZW9mOTdiMGE5YjgwYzk0NmRkQG1haWwuZ21haWwuY29tPgkgPDExNjc2MDgxOTYuNTE1Ny4xNS5jYW1lbEBsb2NhbGhvc3QubG9jYWxkb21haW4+CSA8OTI3NDQxYjMwNzAxMDIxMDMxajNhNDBkZjcxZzQxNGE2NWE3ZWE1YjFlMDBAbWFpbC5nbWFpbC5jb20+CSA8MTE2NzgyNDM3OS4xOTk3NS41NS5jYW1lbEBsb2NhbGhvc3QubG9jYWxkb21haW4+CSA8OTI3NDQxYjMwNzAxMDMxODA2dzQxMDY3ODgzazhmZWYzZDI0ODEwMzFhMGJAbWFpbC5nbWFpbC5jb20+CSA8MTE2NzkxMjAyMi4yMTU4My4zNS5jYW1lbEBsb2NhbGhvc3QubG9jYWxkb21haW4+CSA8MzQzZWNiM2UwNzAxMDQwNDI0bTI3OTVhOTc4cjMyYTdiMTI1MzA4MDk3ZmJAbWFpbC5nbWFpbC5jb20+CSA8OTI3NDQxYjMwNzAxMDQwNDM3djMzYTcwOTY3azc4OWE0NGNlZmViMmRmNWZAbWFpbC5nbWFpbC5jb20+CSA8NDU5RTlFOUUuNTAyMDEwNEBkZWhvcmEubmV0PgkgPDkyNzQ0MWIzMDcwMTA1MTI0MWgzMTg5ZGNiZXIxZWFlNDU2M2ZiNWQ2NDY1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":7473,"nextInTopic":0,"prevInTime":7481,"nextInTime":7483,"topicId":7295,"numMessagesInTopic":25,"msgSnippet":"... But again, it isn t a matter of the protocol being up to it or not. It is about whether the client is up to it. The thing is that you can t communicate","rawEmail":"Return-Path: &lt;benjamincarlyle@...&gt;\r\nX-Sender: benjamincarlyle@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 14518 invoked from network); 7 Jan 2007 04:37:59 -0000\r\nReceived: from unknown (66.218.67.34)\n  by m35.grp.scd.yahoo.com with QMQP; 7 Jan 2007 04:37:59 -0000\r\nReceived: from unknown (HELO mail24.syd.optusnet.com.au) (211.29.133.165)\n  by mta8.grp.scd.yahoo.com with SMTP; 7 Jan 2007 04:37:58 -0000\r\nReceived: from c210-49-93-69.rochd2.qld.optusnet.com.au (c210-49-93-69.rochd2.qld.optusnet.com.au [210.49.93.69])\n\tby mail24.syd.optusnet.com.au (8.13.1/8.13.1) with ESMTP id l074biZn010105;\n\tSun, 7 Jan 2007 15:37:45 +1100\r\nTo: Hugh Winkler &lt;hughw@...&gt;\r\nCc: Bill de hOra &lt;bill@...&gt;,\n        REST Discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nIn-Reply-To: &lt;927441b30701051241h3189dcber1eae4563fb5d6465@...&gt;\r\nReferences: &lt;927441b30612281257l7e78242bs956220be1c51fe46@...&gt;\n\t &lt;927441b30612301708i20a9ac2eof97b0a9b80c946dd@...&gt;\n\t &lt;1167608196.5157.15.camel@...&gt;\n\t &lt;927441b30701021031j3a40df71g414a65a7ea5b1e00@...&gt;\n\t &lt;1167824379.19975.55.camel@...&gt;\n\t &lt;927441b30701031806w41067883k8fef3d2481031a0b@...&gt;\n\t &lt;1167912022.21583.35.camel@...&gt;\n\t &lt;343ecb3e0701040424m2795a978r32a7b125308097fb@...&gt;\n\t &lt;927441b30701040437v33a70967k789a44cefeb2df5f@...&gt;\n\t &lt;459E9E9E.5020104@...&gt;\n\t &lt;927441b30701051241h3189dcber1eae4563fb5d6465@...&gt;\r\nContent-Type: text/plain\r\nDate: Sun, 07 Jan 2007 14:37:43 +1000\r\nMessage-Id: &lt;1168144663.31772.42.camel@...&gt;\r\nMime-Version: 1.0\r\nX-Mailer: Evolution 2.6.3 \r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Benjamin Carlyle &lt;benjamincarlyle@...&gt;\r\nSubject: Re: [rest-discuss] Atompub missed opportunity\r\nX-Yahoo-Group-Post: member; u=184797058; y=WFQpDLA7SsXlKq5kQ_6I14twKKcz6LpB7KFuV4fZT-4U-Mc\r\nX-Yahoo-Profile: fuzzybsc\r\n\r\nOn Fri, 2007-01-05 at 14:41 -0600, Hugh Winkler wrote:\n&gt; On 1/5/07, Bill de hOra &lt;bill@...&gt; wrote:\n&gt; &gt; Hugh Winkler wrote:\n&gt; &gt; &gt; Exactly. RosettaNet is a great standard... the apotheosis of this\n&gt; &gt; &gt; style of exchanging full documents. My point is that style is not\n&gt; &gt; &gt; scalable, and that APP is using the same approach, on a smaller\n&gt; scale.\n&gt; &gt; All the business processing standards I&#39;ve seen are inherently\n&gt; &gt; non-scalable, if by non-scalable you mean the number of actors that\n&gt; can\n&gt; &gt; share information without resorting to effort in out of band\n&gt; agreements.\n&gt; Yes, that&#39;s what I mean.\n...\n&gt; Yeah, well I was hoping this discussion would begin the thinking about\n&gt; &quot;wide adoption on existing infrastructure&quot;. Because if Xforms isn&#39;t\n&gt; up to it, or if RDF forms cannot be brought along far enough, to\n&gt; handle a simple little web service like APP, then we&#39;ll never see web\n&gt; services adopted as broadly as the web -- which the purpose of a lot\n&gt; of discussion on this list.\n\nBut again, it isn&#39;t a matter of the protocol being up to it or not. It\nis about whether the client is up to it. The thing is that you can&#39;t\ncommunicate without human-level agreement. This applies to protocols\nbuilt around document standards in which the agreement is encoded\ndirectly into client and server. It also applies to protocols built\naround forms. In the forms case the server provides enough information\nin the form such that a human-level intelligence can figure out what is\nmeant by all of the fields and attempt to fill them in correctly. The\nform is a user inteface, and the same kind of human intelligence needs\nto be applied to any filling in or manipulating any user interface.\n\nThe terminolgy has to meet basic criteria of collective understanding\neven with human-level intelligence. The human must know what an author\nis in order to fill out the author field, and map it first to the\nconcept of &quot;well, that&#39;s me&quot; and then to their own name as they would\nlike it to appear. They might have to take a guess at how the\ninformation will be used to know what form of their name you want. They\nmay have to refer to a help page to understand all of the necessary\nintricacies involved.\n\nSo I think you really want to to ask are the dual queries of &quot;How to we\nprevent technology issues getting in the way of human-level agreement?&quot;\nand &quot;How do we best achieve human-level agreement in a world of\nsubcultures and individuals?&quot;.\n\nThe machine document-exchange style relies on agreement being made\nbefore the communication. The forms-exchange style relies on agreement\nbeing made with a human in the loop during the conversation as they\ndetermine how to fill out the form in the way the form provider\nintended. An incorrectly filled-out form is a failure to agree. A\ncorrectly filled-out form is the result of agreement via the form\nmonalogue being understood sufficiently well by the form user.\n\nI think there is a sliding scale to this. Will all atom publication use\natompub? Of course not. Most servers will allow users to submit new\narticles online using their web browser. However, when there is no human\nin the loop at the time of submission or it is difficult to engage the\nuser in the communications process you need prior agreement. Consider\nthe program that allowed a user to write their article offline. Now the\nclient has atom-equivalent data to submit. It doesn&#39;t want to fill out a\nform, and can do very little to have the user submit different content\nif the server fails to accept the submission.\n\nYou need good agreement where you want documents to be understood for\ndecades as well. After all, when human agreement is required to be\nsustained for a long time it also takes a long time to come to a point\nof agreement.\n\nWithin the machine document-exchange style there is also a sliding\nscale. I could agree between my client software and your server software\non a document format. This wouldn&#39;t require standardisation over a large\nuser base, although we are still defining a standard. This would be our\nown vocabulary not understood by anyone else. Essentially, our network\neffects would be limited to the size of the network between you and me.\n\nOn the other end of the scale are your htmls, atoms and other\nwidely-agreed document formats. These require a lot more effort to\nagree, and more effort to change once the initial agreement has come\nabout. They will be understood for a long time by a large number of\npeople. They won&#39;t be costly to roll out into new applications. But then\nagain, they are limited in the set of problems they can solve. They can\nonly solve problems that affect a majority or significant minority of\nthe standard&#39;s contributors.\n\nIf we constrast this scale to the development of human language we can\nsee that humans generally know a small number of general purpose\nlanguages that can solve common problems. Uncommon problems tend to\nrequire specialised vocaulary. Various sciences and technology problem\ndomains will often have specific jargon that allows uncommon problems to\nbe solved. I think that the way we define documents for machines will\neventually follow this kind of trend. The jargon could be defined as\npart of problem-specific document standards or as adjuncts to more\ngeneral standards.\n\nPerhaps our common language for expressing client/server interaction is\nHTML, but within html we might define a special language (hCalendar) for\nexpressing information in the time and date problem domain. Perhaps\nrevealingly, this kind of mixed vocabulary set can also be combined with\nform submission for very special purpose problem domains that might\napply only to a single server on the Internet. These problem domains\nafford the least automation and require the greatest application of\nhuman-level intelligence... but a speical problem domain is a special\nproblem domain.\n\nI think an important focus for evolving the general concept of document\ndefinition needs to be built around allowing not only evolution of the\nglobal concepts, but inclusion of vocabularies that may be\nproblem-specific. The main reason that this is difficult is because over\ntime our perspective on the vocabularies may change. What was once\nstandard might one day be shelved as a special vocabulary. What was once\nspecal may become part of a standard vocabulary. This process can be\ndifficult when various special vocabularies overlap or conflict in any\nway.\n\nI think forms are important. Don&#39;t get me wrong. However, I think that\nthe basic approach of using documents to pass information between\nmachines will be an important one for the forseeable future. These\ndocuments must solve most problems with a general vocabulary, but may\nstill require special vocabularies to be built on top of the general and\ncombined in interesting ways. If this makes me sound like I am on the\nRDF bandwagon, well.. I&#39;m yet to be sold.\n\nI&#39;m not convinced RDF solves the evolution problem as particular terms\nchange in meaning or empahsis over time. I&#39;m pretty sure I don&#39;t want my\ndocuments to have to define ten namespaces at the top and make sure I\nselect terms from the appropriate namespace for every element in the\nfile. Perhaps the problem is as simple as placing a &lt;problem-domain&gt;\nmarker into atom for any special problem domain, and allowing its\nsub-elements to float in and out of the main atom feed and entry\nelements over subsequent atom versions. Perhaps a special &lt;vendor&gt;\nelment would make sense to collect anything specific to a particular\napplication. The important thing would be to allow these special\nvocabularies to evolve separately to atom proper as required.\n\nBenjamin.\n\n\n\n"}}