{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":184797058,"authorName":"Benjamin Carlyle","from":"Benjamin Carlyle &lt;benjamincarlyle@...&gt;","profile":"fuzzybsc","replyTo":"SENDER","senderId":"MNjrQOaCeUEcRNgMDkSdNMWvE8Jhf5vEka-5w4xpio-gtCeTctrQ2gsPstvjvlw19fJLkbxKiftOVQzXoVgqE9ECPvgftN-fSNR5zsJaXpdb7cI-gG20ZI8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Re: Request for feedback: REST for the\tRest\tof\tUs","postDate":"1168257507","msgId":7488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNjgyNTc1MDcuNjQ0OS41MC5jYW1lbEBsb2NhbGhvc3QubG9jYWxkb21haW4+","inReplyToHeader":"PDAwMDUwMWM3MzI3MiRjNjc4NDVlMCQ2NjAxYThjMEBXQUxERU5ERVNLVE9QPg==","referencesHeader":"PDA2MDUwMWM3MmZkNCRjNjdkZTRhMCQyMTAyZmVhOUBHdWlkZXMubG9jYWw+CSA8Nzk3QkMzREUtQTA1OS00MTRDLUFDQzYtNTBFN0IyRDNGNEE2QGdiaXYuY29tPgkgPEU1Q0QzMjA5LUEwMzItNDZEMy05MTIyLUY4M0VBNUFCMDdENEBhcnRpbWEuY29tPgkgPDExNjgwMDE3NzcuMjM1ODYuMjMuY2FtZWxAbG9jYWxob3N0LmxvY2FsZG9tYWluPgkgPDAwNmIwMWM3MzEyNyRiZDE5MGU5MCQ2NjAxYThjMEBXQUxERU5ERVNLVE9QPgkgPDExNjgxNDU1MzQuMzE3NzIuNTYuY2FtZWxAbG9jYWxob3N0LmxvY2FsZG9tYWluPgkgPDAwMDUwMWM3MzI3MiRjNjc4NDVlMCQ2NjAxYThjMEBXQUxERU5ERVNLVE9QPg=="},"prevInTopic":7484,"nextInTopic":7489,"prevInTime":7487,"nextInTime":7489,"topicId":7484,"numMessagesInTopic":8,"msgSnippet":"... url ... Would you mind elaborating? I m not sure I understand what you are intending to say. What I am suggesting is that different urls are always ","rawEmail":"Return-Path: &lt;benjamincarlyle@...&gt;\r\nX-Sender: benjamincarlyle@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 97513 invoked from network); 8 Jan 2007 12:00:53 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m27.grp.scd.yahoo.com with QMQP; 8 Jan 2007 12:00:53 -0000\r\nReceived: from unknown (HELO mail32.syd.optusnet.com.au) (211.29.132.63)\n  by mta4.grp.scd.yahoo.com with SMTP; 8 Jan 2007 12:00:53 -0000\r\nReceived: from c210-49-93-69.rochd2.qld.optusnet.com.au (c210-49-93-69.rochd2.qld.optusnet.com.au [210.49.93.69])\n\tby mail32.syd.optusnet.com.au (8.13.1/8.13.1) with ESMTP id l08BwSJF020850;\n\tMon, 8 Jan 2007 22:58:28 +1100\r\nTo: Walden Mathews &lt;waldenm@...&gt;\r\nCc: Bill Venners &lt;bv-svp@...&gt;, &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;,\n        Mike Schinkel &lt;mikeschinkel@...&gt;, rest-discuss@yahoogroups.com\r\nIn-Reply-To: &lt;000501c73272$c67845e0$6601a8c0@WALDENDESKTOP&gt;\r\nReferences: &lt;060501c72fd4$c67de4a0$2102fea9@...&gt;\n\t &lt;797BC3DE-A059-414C-ACC6-50E7B2D3F4A6@...&gt;\n\t &lt;E5CD3209-A032-46D3-9122-F83EA5AB07D4@...&gt;\n\t &lt;1168001777.23586.23.camel@...&gt;\n\t &lt;006b01c73127$bd190e90$6601a8c0@WALDENDESKTOP&gt;\n\t &lt;1168145534.31772.56.camel@...&gt;\n\t &lt;000501c73272$c67845e0$6601a8c0@WALDENDESKTOP&gt;\r\nContent-Type: text/plain\r\nDate: Mon, 08 Jan 2007 21:58:27 +1000\r\nMessage-Id: &lt;1168257507.6449.50.camel@...&gt;\r\nMime-Version: 1.0\r\nX-Mailer: Evolution 2.6.3 \r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Benjamin Carlyle &lt;benjamincarlyle@...&gt;\r\nSubject: Re: [rest-discuss] Re: Request for feedback: REST for the\n\tRest\tof\tUs\r\nX-Yahoo-Group-Post: member; u=184797058; y=yi4e8tVTugQdTADA5BpOzhvHZESCp9NZUfj_DmOfYLQi5jE\r\nX-Yahoo-Profile: fuzzybsc\r\n\r\nOn Sun, 2007-01-07 at 10:44 -0500, Walden Mathews wrote:\n&gt; : So in answer to your question, a resource identified by a particular\nurl\n&gt; : is the same as itself. That is all we need for the purposes of identity.\n&gt; : For other purposes we need more problem-specific concepts of equvalence\n&gt; : to make statements that can be understood.\n\n&gt; In systems design, it is important to collapse concepts which\n&gt; within the system have no real distinction.  We refactor code,\n&gt; establish asias lookup schemes, and probably do a whole\n&gt; raft of other things to factor out redundancy noise in the interest\n&gt; of simplicity and clarity.\n&gt; \n&gt; Obsolete stuff should get garbage collected.  In the system\n&gt; you propose, that can&#39;t happen.  You are making identifiers too\n&gt; important, IMO.  More important than what they identify.\n\nWould you mind elaborating? I&#39;m not sure I understand what you are\nintending to say. What I am suggesting is that different urls are always\ndifferent identifiers, even when they identify loosely- or closely-\nrelated resources.\n\nI see this suggestion as a practical breakdown of the system. No node in\nthe system can sustainably claim equivalence of two urls except as\ndefined by scheme without adding &quot;for my purposes&quot;. The server can talk\nabout the sameness of two urls for the purpose of causing them to use\nthe same processing for requests. That is ephemeral. The authentication\nproxy can talk about sameness of two urls for the purposes of access\ncontrol. That too is emphemeral and is a distinct concept. A client can\ntalk about the sameness of urls for the purposes of its usage. Same is a\nshort-lived perspective-specific notion. Even the notion of an\nidentified resource being the same over time depends on the context in\nwhich the word &quot;same&quot; is used.\n\nI think you are suggesting that a eternity of association between url\nand resource is too much. I&#39;m not sure things are so simple. URLs can be\ndeprecated and fade into obscurity, then be brought back to life in a\ndifferent form. Perhaps the resource at the url is no longer the same\nfrom particular perspectives or even from any perspective, but the value\nin calling it a different resource is probably minimal at that point.\nCertainly, breaking a sameness assumption about a resource anywhere in\nthe system will have negative effects on the nodes that rely on that\nsameness. It is sometimes hard to judge what those effects will be. It\nis sometimes hard to gauge what assumptions are being made in the wild.\n\nSo, &quot;same&quot; for the purpose of identity and &quot;same&quot; for other purposes\ndon&#39;t have to be concepts that line up. The identified resource is the\nsame when the same url is used. We know that. Past that point we can&#39;t\npredict what other kinds of sameness will be applicable. We can only\nrely on social contract with the resource provider that obvious sameness\nis left intact. Social contracts can last for a long time, but we can&#39;t\nrule out the possibility that one day the http://google.com resources\nwon&#39;t be sold out to a goggle retailer and change meanings for most\nuseful purposes.\n\nSo I do suggest that a url identifies a particular resource, and that\nother urls identify different resources. The mapping of that resource to\nrepresentations can change over time to break all of our sameness\nassumptions if it wants to... but I suggest that sameness of\nidentification is the only impartial and absolute way to express the\nsameness concept. A resource is many things to many people. Is\n&lt;http://google.com.au/&gt; the same as &lt;http://google.com/&gt;? It is for me,\nbut likely not for you.\n\nIt is difficult to carry on a conversation about which urls identify the\nsame resource if a resource is simply &quot;what you make of it&quot; from any\nappropriate perspective. Take the google example again. To me they both\nexpress the concept of &quot;google&#39;s search page&quot;, however to someone from\nabroad a different set of urls would fall into the set. It is difficult\nto talk about which urls identify different resources.\n\nI see identity as the rock of vocabulary that allows unambigous\nconversations to be had about what resources are and how we should\ninteract with them. You can then move on to definitions of resources\nthat help express the meaning of the classic HTTP methods:\n\n* A resource is a selection of application state that can be operated on\nby verbs such as the HTTP methods. Different resources may select or\ndemarcate the same or overlapping application state.\n* The selection is expressed as an identifier. The server determines\nwhat mapping should apply from this identifier its objects, tables, or\nother accessible data or state at all times. This mapping is subject to\nchange according to the server&#39;s requirements which will partially\nreflect the requirements of its clients.\n* GET requests a representation of the selected application state in one\nof possibly several representations. Different representations will\nlikely retain different levels of semantic fidelity of the actual\napplication state.\n* PUT replaces the selected application state with the state transferred\nin the request&#39;s representation\n* POST adds the state transferred in the request&#39;s representation to the\nserver&#39;s state.\n* DELETE is a PUT of the null state to the resource\n* The server may handle the requests in a number of ways that don&#39;t\nexactly match the request. Business logic can come into effect to have\narbitrary knock-on consequences, including those that leave the\nidentified resource in a different state to that intended by the method.\nSome consequences can be communicated back to the client as part of the\nrequest, for example a &quot;created&quot; or &quot;no content&quot; response can be\nreturned to a POST request.\n\nThis set of definitions defines the resource concept in a different way\nto REST, and I think forms a subset of theoretical REST that can form\nthe basis of discussion about which methods a particular architecture\nshould have. It lies somewhere between the real web and REST theory as a\npractical bridge of good web style.\n\nBenjamin.\n\n\n"}}