{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"dOHL_XB_z5xIqMfuGOK_YB9pnFZblpuQwZRM7JUQnddajwJ3hxYvjuX3DhvtpcCofNVAkmRmiU2qAlESI6HmFlNRLW0lZbqE2gVMavGdow","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [rest-discuss] Atom, &#39;process-this&#39;-POST and rockets","postDate":"1168394859","msgId":7531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNmUwMWM3MzQ1YyQxYjk4YzFlMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","inReplyToHeader":"PDQ1OUFGMjdELjEwMjAxMDNAbWV0YWxhYi51bmMuZWR1Pg=="},"prevInTopic":7391,"nextInTopic":7536,"prevInTime":7530,"nextInTime":7532,"topicId":7120,"numMessagesInTopic":70,"msgSnippet":"... I believe that the market doesn t care about that level of detail, only academics and standard committees care to that extent. I believe the market cares","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 86802 invoked from network); 10 Jan 2007 02:09:17 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m41.grp.scd.yahoo.com with QMQP; 10 Jan 2007 02:09:17 -0000\r\nReceived: from unknown (HELO wx-out-0506.google.com) (66.249.82.226)\n  by mta4.grp.scd.yahoo.com with SMTP; 10 Jan 2007 02:09:16 -0000\r\nReceived: by wx-out-0506.google.com with SMTP id s13so6001877wxc\n        for &lt;rest-discuss@yahoogroups.com&gt;; Tue, 09 Jan 2007 18:07:42 -0800 (PST)\r\nReceived: by 10.70.30.5 with SMTP id d5mr52266344wxd.1168394861846;\n        Tue, 09 Jan 2007 18:07:41 -0800 (PST)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nReceived: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTP id 8sm44836798wra.2007.01.09.18.07.40;\n        Tue, 09 Jan 2007 18:07:40 -0800 (PST)\r\nTo: &quot;&#39;Elliotte Harold&#39;&quot; &lt;elharo@...&gt;\r\nCc: &lt;rest-discuss@yahoogroups.com&gt;\r\nDate: Tue, 9 Jan 2007 21:07:39 -0500\r\nMessage-ID: &lt;016e01c7345c$1b98c1e0$0702a8c0@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nThread-Index: Accuymg2z+3hEHGKQK2NzLRTwAB21QFiuu+A\r\nIn-Reply-To: &lt;459AF27D.1020103@...&gt;\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.3028\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: [rest-discuss] Atom, &#39;process-this&#39;-POST and rockets\r\nX-Yahoo-Group-Post: member; u=228155998; y=Yxyi8KIu9vDJYwZim08xUYaeXMS6fbIB0GZcruMAKdQ_yKJiLmzH\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\nElliotte Harold wrote:\n&gt; Mike Schinkel wrote:\n&gt; \n&gt; &gt; The internal admins configuring the firewall in many places are \n&gt; &gt; clueless (believe me, I ran a business for a while where that was \n&gt; &gt; truly the case but I couldn&#39;t afford to hire anyone better. And it \n&gt; &gt; will be the case in many small to medium size businesses.)\n&gt; \n&gt; The market will deal with businesses like that. \n\nI believe that the market doesn&#39;t care about that level of detail, only\nacademics and standard committees care to that extent. I believe the market\ncares about what works for them to achieve their specific goals.\n\n&gt; I don&#39;t see why genuinely competent organizations should...\n\nYou are defining &quot;genuinely competent organizations&quot; using one measure;\ntheir adherence to a technical ideal.  There are many other measures of a\ncompetent organization, and the market views earnings of &quot;for-profit&quot;\ncompanies as one of it&#39;s most important concerns. If following a certain\ntechnical ideal depresses earnings then while you would view the\norganization as genuinely competent there are a large group of others,\nespecially shareholders and most employees who would view the company as\ngrossly incompetent.\n\nI don&#39;t mean to discredit your view; I instead mean to point out that they\nare numerous views and that those views should be weighed and balanced\naccordingly. Suggesting the other view is not important may make one feel\nbetter, but it won&#39;t achieve any related improvements.\n\n&gt; have to put up with bad architectures to support their \n&gt; pointy-haired competitors.\n\nAside from the unnecessary denigration which I will ignore, you may have\nmisunderstood; I didn&#39;t mean &quot;support competitors&quot;, I meant &quot;compete with\ncompetitors.&quot;\n\n&gt; It seems suspicious to me that these purported admins who are \n&gt; so incompetent they can&#39;t properly manage PUT and DELETE knew \n&gt; enough to block these methods in the first place. I suspect \n&gt; what may really be going on is unchanged defaults in the \n&gt; firewalls and proxy servers. If indeed that&#39;s the case then \n&gt; it&#39;s much easier to fix the problem at its source by \n&gt; educating a relatively small number of proxy and firewall vendors.\n\nI made an assumption in my comments which you ferreted out; that yes I was\ntalking about defaults where users of proxies and firewalls who barely have\nthe skills (or the money) to get them up and running, let alone optimize\nthem. With many organizations, even large one, use the same &quot;Jell-O&quot; model\n[1] for infrastructure configuration as some companies use for shipping\nsoftware; when it stops quivering it&#39;s done!\n\nOTOH, Nic was speaking about the large organizations where one departments\noften didn&#39;t care about the concerns of others.\n\n&gt; Indeed all you may need to do when a customer tells you your \n&gt; system seems broken is say, &quot;Oh, you&#39;re using proxy X? That&#39;s \n&gt; broken and non-spec compliant. Use proxy Y instead and all \n&gt; will be fine.&quot;\n\nThat&#39;s fine, assuming that information gets to the right person in the\ncompany (which is a huge assumption) and that the right person doesn&#39;t have\nother tasks they view as higher priority (which is another big assumption.)\n\n&gt; Of course, this is not a binary situation. Some will fix \n&gt; their systems and some won&#39;t. My experience leads me to \n&gt; believe that when you insist on spec compliance, more people \n&gt; will fix their systems and come into compliance than won&#39;t. \n\nI wouldn&#39;t disagree with this.\n\n&gt; You will lose a few percent. \n\nThat, unfortunately, is the problem.  When you are in government or academia\nyou can usually afford to be draconian.  But in the business world that &quot;few\npercent&quot; is often the difference between meeting quarterly goals or not. For\nsmall companies it can be the difference between making payroll or not. I&#39;m\nwell aware of the latter as I&#39;ve been in the role of having to meet payroll\nfor more than 20 years of my career. I don&#39;t know your experience; have you?\n\nA for-profit business cannot choose to enforce a standard on its customers\nover achieving either of the aforementioned two things. Taking what many,\nwho are not technical, would view as an overly pedantic posture on standards\nover meeting revenue projections would most certainly lead shareholders to\nreplacing management at best, or to suing them at worst.\n\n&gt; However if you try and support \n&gt; all the broken and brain damaged networks out there, you do\n&gt;   far more damage to everyone. You end up hurting the \n&gt; compliant customers to support the noncompliant ones in a \n&gt; dozen different, subtle ways. Maximum net benefit to all \n&gt; involved is achieved by jettisoning the truly incompetent \n&gt; organizations that will not and cannot learn the proper way \n&gt; to do things.\n\nUnfortunately, only people who are drawn to the technology for personal\ninterest see this as important enough to allow it to affect other factors.\nFor another perspective on this, ask the WHATWG editor Ian Hickson if he\nthinks browser vendors will support standards that could potentially\nminimize their marketshare in any way.[2]  Almost no company will be willing\nto limit it&#39;s marketshare for a technical ideal. The way to achieve the\ntechnical ideal on as broad basis as possible is to make that support\npainless, not by ignoring market realities with the claim that &quot;it is the\nright thing to do for the greater good.&quot; \n\n-- \n-Mike Schinkel\nhttp://www.mikeschinkel.com/blogs/\nhttp://www.welldesignedurls.org/\n\n[1] http://www.google.com/search?q=&quot;Don&#39;t+shake+the+Jell-O&quot;\n[2]\nhttp://listserver.dreamhost.com/pipermail/whatwg-whatwg.org/2006-December/00\n8600.html\n\n\n"}}