{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"bIdANAkNafIl26_xL8DQpJQxsUa00vP2kOs4vaSUSg2aismziQ9fKdxSVGp2AgA2dHxSyPDFnHfzYde9YnSJQm91UYn1EF7YxTg8quGpHg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [rest-discuss] Benefits of Canonical URLs (was Request for feedback: REST for the Rest of Us)","postDate":"1168417685","msgId":7549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZmEwMWM3MzQ5MSQ0MDkzYWE3MCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","inReplyToHeader":"PDQ1QTM2NUUzLjIwNTA0MDFAaGFja2NyYWZ0Lm5ldD4="},"prevInTopic":7548,"nextInTopic":7550,"prevInTime":7548,"nextInTime":7550,"topicId":7355,"numMessagesInTopic":134,"msgSnippet":"... You didn t answer can we change that? ... That is much like we are in a city planning meeting where I say People need a bus to Harold s Cross to which","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 87374 invoked from network); 10 Jan 2007 08:28:09 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m27.grp.scd.yahoo.com with QMQP; 10 Jan 2007 08:28:09 -0000\r\nReceived: from unknown (HELO wx-out-0506.google.com) (66.249.82.230)\n  by mta9.grp.scd.yahoo.com with SMTP; 10 Jan 2007 08:28:09 -0000\r\nReceived: by wx-out-0506.google.com with SMTP id s15so45734wxc\n        for &lt;rest-discuss@yahoogroups.com&gt;; Wed, 10 Jan 2007 00:28:07 -0800 (PST)\r\nReceived: by 10.70.21.10 with SMTP id 10mr134298wxu.1168417687661;\n        Wed, 10 Jan 2007 00:28:07 -0800 (PST)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nReceived: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTP id g5sm21248185wra.2007.01.10.00.28.06;\n        Wed, 10 Jan 2007 00:28:06 -0800 (PST)\r\nTo: &quot;&#39;REST Discuss&#39;&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nCc: &quot;&#39;Jon Hanna&#39;&quot; &lt;jon@...&gt;\r\nDate: Wed, 10 Jan 2007 03:28:05 -0500\r\nMessage-ID: &lt;01fa01c73491$4093aa70$0702a8c0@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nThread-Index: Accz1Dw8WxJs5PEIRAq8THqA6F/nSgAtQmOA\r\nIn-Reply-To: &lt;45A365E3.2050401@...&gt;\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.3028\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: [rest-discuss] Benefits of Canonical URLs (was Request for feedback: REST for the Rest of Us)\r\nX-Yahoo-Group-Post: member; u=228155998; y=HrP-qdOBueR_HR8tSHtxboM-UWscBJLurApI3t7ei4iUh4iDapE9\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\nJon Hanna wrote: \n&gt; Mike Schinkel wrote:\n&gt; &gt; Well, I want to explore why it is harder for search engines to find \n&gt; &gt; that page. And can we change that? Or consider the problem from a \n&gt; &gt; different perspective?\n&gt; \n&gt; This is simple. The search engine finds x pages which it \n&gt; deems equally good as a response to a given query. Which does \n&gt; it link to first? There&#39;s no way of saying.\n\nYou didn&#39;t answer &quot;can we change that?&quot; \n\n&gt; &gt; Google tweaks their algorithms quarterly. Why could they \n&gt; not include an update given new guidance? The rest would \n&gt; follow.\n&gt; \n&gt; We can already give this guidance to Google. Google reacts \n&gt; appropriately when it receives a 301 Moved Permanently by \n&gt; treating the target of the location header as the URI to use.\n\nThat is much like we are in a city planning meeting where I say &quot;People need\na bus to Harold&#39;s Cross&quot; to which you say &quot;Tell them to take a train&quot; to\nwhich I say &quot;There isn&#39;t a train that goes to Harold&#39;s Cross&quot; to which you\nreply &quot;Tell them to take a train&quot; ...\n\nThe point is giving Google a 301 requires the page to be redirected when I\nexplicitly stated that redirection is not appropriate for the use-case and\nin that use-case redirection would confuse users.  \n\nOne option might be to return a 203 Non-Authoritative Information with\nContent-Location pointing to a (more) canonical URL, but I&#39;m certainly not\nthe expert on the uses of return code and http headers so I don&#39;t know if\nthis would be misusing that information or not. Can anyone tell me if this\nwould be a viable use to indicate a canonical URL w/o redirecting the client\nto the canonical URL?\n\n&gt; &gt; It is also a caching minus, because the cache won&#39;t \n&gt; &gt; know it already has something that came via a different \n&gt; &gt; URI. That can be a usability minus in the form of slower \n&gt; &gt; perceived response time, and a business minus in terms \n&gt; &gt; of higher bandwidth costs.\n&gt; &gt; \n&gt; &gt; Again, I&#39;d like to explore why that is and see if there are \n&gt; &gt; not new ways to look at the problem.\n&gt; \n&gt; The same reason you don&#39;t know whether what&#39;s behind \n&gt; door number 1 is the same as what&#39;s behind door number 2.\n\nThat may be why, but it doesn&#39;t explore new ways of looking at the problem.\n\n&gt; Again, but a note behind door number 2 saying &quot;go to door \n&gt; number 1 and open that instead&quot; and your problem is solved. \n&gt; As a bonus we can also control how often we check door number \n&gt; 2 to see if that note is still there.\n\nAgain, you are giving me licorice ice cream after I told you I don&#39;t like\nlicorice simply because all you have is licorice.  It doesn&#39;t get me ice\ncream that I can stand to eat.\n\n&gt; Mike Schinkel wrote:\n&gt; &gt; Also, I just ran across this:\n&gt; &gt; http://www.w3.org/QA/2004/08/readable-uri\n&gt; \n&gt; Being treated as opaque does not mean it can&#39;t be readable or \n&gt; respond well to guesswork.\n\nI didn&#39;t say it did.\n\n&gt; Mike Schinkel wrote:\n&gt; &gt; For one example, look at Wikipedia&#39;s URLs; is it a wonder there are \n&gt; &gt; linked as often at they are?\n&gt; &gt; \n&gt; &gt; http://en.wikipedia.org/wiki/REST\n&gt; &gt; \n&gt; &gt; IF it were instead\n&gt; &gt;\n&gt; http://www.wikipedia.org/topic.php?topicID=7937521&lang=en-US&\n&gt; &gt; source-ie7&en-US&ie=utf8&oe=utf8\n&gt; &gt; \n&gt; &gt; I can guarantee you it would not be linked as much.\n&gt; \n&gt; If one 301&#39;d to the other then the benefits you suggest are \n&gt; there would still hold.\n\nNot at all, you are thinking of different use-cases than I.  Consider\nsomeone is writing a topc on their blog and use the terms &quot;REST&quot;, &quot;HTTP&quot;,\n&quot;HTML&quot;, &quot;URL&quot;, &quot;URI&quot;, &quot;AJAX&quot;, &quot;Javascript&quot;, etc. They want to hyperlink\nthose terms to definitions. Given Wikipedia&#39;s clean and clear URL structure,\nthey know that they can link to &quot;http://en.wikipedia.org/wiki/REST&quot;,\n&quot;http://en.wikipedia.org/wiki/HTTP&quot;, etc. and so they do it.  \n\nBut let&#39;s assume that Wikipedia only offered the &quot;ugly&quot; URL structure I\ndescribed above. The author would often think to themselves &quot;Damn, it&#39;s just\ntoo much trouble to link to all those terms. So I&#39;m just not going to.  Let\nthe user Google them themselves if they want to know what they mean.&quot;  And\nin that case their post has less value for readers and adds less to the web\noverall.\n\nOf course you might say &quot;They can just hyperlink to Google with\n&#39;http://www.google.com/search?q=REST&#39;, etc.&quot;, but then if Google&#39;s URL\nstructure were not easy to grok, that wouldn&#39;t be possible without a lot\nmore work either, so if you suggested that you&#39;d just be helping me make my\npoint.\n\n&gt; &gt; And when people link a site, the benefits acrue to the site.\n&gt; \n&gt; There are more benefits in people linking to one page on your \n&gt; site than 15 equivalent pages.\n\nCurrently yes, but I&#39;m not talking about the current state of the web, I&#39;m\ntalking about an exploration for improving it.  Many people told TimBL that\nthe concept of the web itself made no sense, but that didn&#39;t stop him. I&#39;m\nnot suggesting my ideas are on par with Tim&#39;s; but I am suggesting that\nimpeding the exploration of improvements will increase the likelihood that\nno improvements will be seen.\n\nAs an aside, it never ceases to amaze me how many people are willing to\nproactively debate away attempts to improve the web and make it more\nusable...\n\n&gt; &gt; So you see, there as so many small reasons why \n&gt; &gt; well designed URLs are a benefit. But if you don&#39;t \n&gt; &gt; drill down to see those ways, it doesn&#39;t seem\n&gt; &gt; like much at 50,000 feet.\n&gt; \n&gt; The benefits of well-designed URIs is a different matter to \n&gt; the benefits of canonical URIs. \n\nI agree, but I&#39;d like to explore if it is possible that they are not at odds\neither.\n\n&gt; &gt; 5.) Further, the URI Opacity concern is related to *machines*, not \n&gt; &gt; humans because humans have an error correcting mechanism called \n&gt; &gt; intelligence. If they go to the &quot;/cart/&quot; URL and it displays \n&gt; &gt; information about wheelbarrows instead of a shopping cart, \n&gt; &gt; the human can figure it out and continue looking. The machine is \n&gt; &gt; yet to be capable until programmed in advance for that problem.\n&gt; \n&gt; No, the opacity concern is related to humans because if they \n&gt; phone and complain that they got information about \n&gt; wheelbarrows when they should have gotten a shopping cart I&#39;m \n&gt; going to want to hit someone (not really, I get far worse \n&gt; calls than that, but they do make me want to hit someone). \n&gt; This is because humans have an error-generating mechanism \n&gt; called stupidity.\n\nDo you really think your fellow humans are less intelligent then you? I\nthink you are just voicing the frustation of someone who has been on the\nsupport line for a poorly designed system.  \n\nOn the contrary, one of the reasons humans phone and complain that they got\ninformation about wheelbarrows when they should have gotten a shopping cart\nis because the designer of the shopping cart decided that making the URLs\nunderstandable by humans was either not worth his effort or believed that\nusers couldn&#39;t possibly understand URLs, which is a very arrogant position\nto take.  People didn&#39;t understand automobile controls, postal codes,\ntelephone numbers, automated teller machines, and more when they were first\nintroduced, but now the vast majority of people get on fine with them. The\nsame will be true of URLs as time passes.\n\n&gt; Responding reasonably to guesswork is great. I strive to \n&gt; design URI schemes as intuitively as I can. But I will delete \n&gt; any bug report about guessed URIs not working ...\n\nAnd I would agree that that is an appropriate position. OTOH, if I learned\nthat people frequently entered &quot;http://www.mysite.com/buynow/&quot; and got a\nbroken link, I can tell you I&#39;d go to the effort to ensure they got what\nthey were seeking, and all pedantics aside, I bet you would too. ;-)\n\n&gt; unless its very \n&gt; definitely marked as a suggested enhancement.\n\nHowever, I didn&#39;t understand what you meant by this.\n\n-- \n-Mike Schinkel\nhttp://www.mikeschinkel.com/blogs/\nhttp://www.welldesignedurls.org/\n\n\n\n"}}