{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":184797058,"authorName":"Benjamin Carlyle","from":"Benjamin Carlyle &lt;benjamincarlyle@...&gt;","profile":"fuzzybsc","replyTo":"SENDER","senderId":"cVWjYS5AYR29G68KDZ0n1eoRAQjbkMazJ95XWaO9rEg9QsPgxAgQh4RMlCyLLJPNAauz0tV155SC7EbyzDAqq45pqzkO8C3JoCtcYbXTaW50uhg1J-EO_Cc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Re: Request for feedback: REST for the\tRest\tof\tUs","postDate":"1168465483","msgId":7569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNjg0NjU0ODMuNDY4MC4zOS5jYW1lbEBsb2NhbGhvc3QubG9jYWxkb21haW4+","inReplyToHeader":"PEQzQkM5NEE3LTBBOTUtNDQzMC04RDNELTFGQjhGNTE0N0Q2N0BnYml2LmNvbT4=","referencesHeader":"PDA2MDUwMWM3MmZkNCRjNjdkZTRhMCQyMTAyZmVhOUBHdWlkZXMubG9jYWw+CSA8Nzk3QkMzREUtQTA1OS00MTRDLUFDQzYtNTBFN0IyRDNGNEE2QGdiaXYuY29tPgkgPEU1Q0QzMjA5LUEwMzItNDZEMy05MTIyLUY4M0VBNUFCMDdENEBhcnRpbWEuY29tPgkgPDExNjgwMDE3NzcuMjM1ODYuMjMuY2FtZWxAbG9jYWxob3N0LmxvY2FsZG9tYWluPgkgPDAwNmIwMWM3MzEyNyRiZDE5MGU5MCQ2NjAxYThjMEBXQUxERU5ERVNLVE9QPgkgPDExNjgxNDU1MzQuMzE3NzIuNTYuY2FtZWxAbG9jYWxob3N0LmxvY2FsZG9tYWluPgkgPDAwMDUwMWM3MzI3MiRjNjc4NDVlMCQ2NjAxYThjMEBXQUxERU5ERVNLVE9QPgkgPDExNjgyNTc1MDcuNjQ0OS41MC5jYW1lbEBsb2NhbGhvc3QubG9jYWxkb21haW4+CSA8RDNCQzk0QTctMEE5NS00NDMwLThEM0QtMUZCOEY1MTQ3RDY3QGdiaXYuY29tPg=="},"prevInTopic":7498,"nextInTopic":7585,"prevInTime":7568,"nextInTime":7570,"topicId":7484,"numMessagesInTopic":8,"msgSnippet":"... Perhaps I have miscommunicated. Leaving aside the definition of resources for the moment, what I have said is that at time t in good REST style a url","rawEmail":"Return-Path: &lt;benjamincarlyle@...&gt;\r\nX-Sender: benjamincarlyle@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 15729 invoked from network); 10 Jan 2007 21:46:31 -0000\r\nReceived: from unknown (66.218.67.36)\n  by m28.grp.scd.yahoo.com with QMQP; 10 Jan 2007 21:46:31 -0000\r\nReceived: from unknown (HELO mail16.syd.optusnet.com.au) (211.29.132.197)\n  by mta10.grp.scd.yahoo.com with SMTP; 10 Jan 2007 21:46:30 -0000\r\nReceived: from c210-49-93-69.rochd2.qld.optusnet.com.au (c210-49-93-69.rochd2.qld.optusnet.com.au [210.49.93.69])\n\tby mail16.syd.optusnet.com.au (8.13.1/8.13.1) with ESMTP id l0ALiiYl017363;\n\tThu, 11 Jan 2007 08:44:45 +1100\r\nTo: &quot;Roy T. Fielding&quot; &lt;fielding@...&gt;\r\nCc: REST Discuss &lt;rest-discuss@yahoogroups.com&gt;\r\nIn-Reply-To: &lt;D3BC94A7-0A95-4430-8D3D-1FB8F5147D67@...&gt;\r\nReferences: &lt;060501c72fd4$c67de4a0$2102fea9@...&gt;\n\t &lt;797BC3DE-A059-414C-ACC6-50E7B2D3F4A6@...&gt;\n\t &lt;E5CD3209-A032-46D3-9122-F83EA5AB07D4@...&gt;\n\t &lt;1168001777.23586.23.camel@...&gt;\n\t &lt;006b01c73127$bd190e90$6601a8c0@WALDENDESKTOP&gt;\n\t &lt;1168145534.31772.56.camel@...&gt;\n\t &lt;000501c73272$c67845e0$6601a8c0@WALDENDESKTOP&gt;\n\t &lt;1168257507.6449.50.camel@...&gt;\n\t &lt;D3BC94A7-0A95-4430-8D3D-1FB8F5147D67@...&gt;\r\nContent-Type: text/plain\r\nDate: Thu, 11 Jan 2007 07:44:43 +1000\r\nMessage-Id: &lt;1168465483.4680.39.camel@...&gt;\r\nMime-Version: 1.0\r\nX-Mailer: Evolution 2.6.3 \r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Benjamin Carlyle &lt;benjamincarlyle@...&gt;\r\nSubject: Re: [rest-discuss] Re: Request for feedback: REST for the\n\tRest\tof\tUs\r\nX-Yahoo-Group-Post: member; u=184797058; y=UTkAtYfd2yTV67rh8AOV-Mw7H03BTLpCLyPEjsZUrlKjQZk\r\nX-Yahoo-Profile: fuzzybsc\r\n\r\nOn Mon, 2007-01-08 at 18:36 -0800, Roy T. Fielding wrote:\n&gt; On Jan 8, 2007, at 3:58 AM, Benjamin Carlyle wrote:\n&gt; &gt; I see identity as the rock of vocabulary that allows unambigous\n&gt; &gt; conversations to be had about what resources are and how we should\n&gt; &gt; interact with them. You can then move on to definitions of resources\n&gt; &gt; that help express the meaning of the classic HTTP methods:\n&gt; ...\n&gt; &gt; This set of definitions defines the resource concept in a different  \n&gt; &gt; way\n&gt; &gt; to REST, and I think forms a subset of theoretical REST that can form\n&gt; &gt; the basis of discussion about which methods a particular architecture\n&gt; &gt; should have. It lies somewhere between the real web and REST theory  \n&gt; &gt; as a\n&gt; &gt; practical bridge of good web style.\n...\n&gt; The problem with your model is that it doesn&#39;t respect reality.\n&gt; By axiomatizing away the notion of resource equivalence you simplify\n&gt; the model, but then your model is incapable of explaining the\n&gt; information theoretic properties of the Web that I just finished\n&gt; describing.  In your model, URI aliases are not an issue because\n&gt; they don&#39;t exist.  In the REST model, URI aliases are an issue\n&gt; because they reduce the perceived importance of a given resource\n&gt; and reduce the efficiency of caching resource representations.\n\nPerhaps I have miscommunicated. Leaving aside the definition of\nresources for the moment, what I have said is that at time t in good\nREST style a url demarcates/selects state as well as defining a\npotentially bidirectonal mapping between representations of various\ntypes and its state. That state can overlap with the state of other\nresources. I think that when the state overlap is perfect (and perhaps\nthe mapping is perfect also) this is what you mean by a URI alias.\nHowever this hides a more general problem of overlapping state.\n\nWe have overlap when a blog front page shows ten articles, each of which\nare accessible as a permantent link. Rather than duplicating content, it\nwould be more scalable to employ a technology such as HInclude[1] to\nconstruct this page on the client side as required. Each individual page\ncan benefit from caching, and the template that sews them together would\nbe smaller. This is a related problem to that of a true alias, and I\nsuggest one that is is clearer when we talk about urls that demarcate\nrelated state than when we talk about whether urls refer to the same\nresource.\n\n&gt; So, the question then isn&#39;t how you might define resources.  The\n&gt; question is what do you intend to accomplish by doing so?  There\n&gt; are many ways to look at any given system, particularly when\n&gt; focusing on only one of the components.  An abstraction like REST\n&gt; is supposed to help the designer identify mismatches in the\n&gt; architecture.  Perhaps you don&#39;t see the problem because you\n&gt; aren&#39;t applying your model to the Web as a whole, but rather\n&gt; something more limited (such as a server-side development\n&gt; framework)?\n\nThe purpose of defining a resource to be a particular thing depends on\nwhat you will use that definition for. I don&#39;t think the &quot;resource is a\nurl is a resource&quot; definition is simply meaningful at the server side.\nThe server has concepts of resource equivalence for its purposes, just\nlike anyone else in the architecture. If the server serves the same\nrepresentations for two urls it may think of them as the same resource.\nHowever a proxy in the middle or a web browser isn&#39;t afforded the same\nluxury. I think that at the machine level the resource and url concepts\ncan&#39;t be separated. Any particular point in the architecture may place\nparticular urls into equivalence classes, but those classes will be\ndifferent throughout the architecuture. At the machine level we can only\ntalk about the 1:1 url&lt;-&gt;resource mapping.\n\nIf we talk about resources being the same a the human level we can work\nwith some latitude. However, the view is still a context-sensitive one.\nWhether two urls refer to the same resource or not may depend on\nlanguage, regional, or other considerations. Apart from the\nscheme-specific equivalence, reordering of query parmeters or matrix url\nparameters, the very fact that multiple URLs are provided for a resource\nis usually an indiciation that the identifications are not equivalent.\n\nMy interest in defining a resource is from a couple of perspectives:\n* REST enthusiasts consistently get an inconsistent picture of what a\nresource is. A central concept of an architectural style should be\nconceptually simple and consistent, but we get into arguments about\nwhether resources are the same when we haven&#39;t clarified the &quot;from which\nperspective&quot; question. url as identity is an impartial way of talking\nabout this concept.\n* REST is not only GET. The dissertation talks about a resource as a\nmapping to a set of values. This is fine for GET but doesn&#39;t provide a\nframework under which we can assess the value of other methods. If\ninstead of talking about a resource as &quot;what you see&quot; we can talk about\na resource is &quot;demarcating state and mapping to representationt types,\ndefining what you see and what it understands&quot; we can then talk about\nwhat a PUT might do. At time t we expect that a PUT will operate on the\nsame state that a GET would retrieve. Without including the definition\nof the demarcated state as part of the resource we don&#39;t really have the\ngrounding to talk about PUT or other mutation methods.\n\nSo when people start arguing about whether two resources are the same or\nnot I am prone to step in and say that no two resources are the same,\nthough they may demarcate the same state. We can then talk generally\nabout resources that have overlapping state and what we should do about\nthem. From this grounding I can also say that PUT replaces this state,\nPOST adds to it, and DELETE PUTs the null state... but that business\nlogic may step in to leave things in states we don&#39;t expect, or change\nstate we didn&#39;t anticipate.\n\nOn Mon, 2007-01-08 at 09:45 -0500, Walden Mathews wrote: \n&gt; Let&#39;s say you have a static page you intend to host forever, and\n&gt; you have one and only one representation you send for that page.\n&gt; You don&#39;t honor POST, PUT or DELETE (or any other unsafe\n&gt; method that may appear someday).  But, for reasons we don&#39;t\n&gt; care about right now, you support two URL&#39;s for that page:\n&gt; http://benjamin.com/thepage and http://benjamin.com/page1\n&gt; Clearly you have two identifiers here.  But are you willing to\n&gt; allow that they simply identify the same resource, and so there are\n&gt; not two resources, just one?  If not, why?\n\nMaybe I&#39;ll run out of money someday or die, and someone else will take\nover the domain. No machine in the architecture can infer that these are\ndifferent resources to themselves any more than a machine in the\narchitecture can infer that these are the same resource. All of the old\nhyperlinks will be intact... but the server may now treat them\ndifferently. Maybe they are two different files in the filesystem and\none becomes corrupt but the other doesn&#39;t. How sure do you need to be\nthat for all time they return the same values to call them the same?\n\nOn Mon, 2007-01-08 at 12:36 +0000, Jon Hanna wrote: \n&gt; Benjamin Carlyle wrote:\n&gt; &gt; I see this suggestion as a practical breakdown of the system. No node in\n&gt; &gt; the system can sustainably claim equivalence of two urls except as\n&gt; &gt; defined by scheme without adding &quot;for my purposes&quot;.\n&gt; Sure it can.\n&gt; Just like I can say that the identifiers &quot;Norma Jean Mortenson&quot; and \n&gt; &quot;Marilyn Monroe&quot; identify the same person.\n\n... for the purposes of identifying a natural individual.\n\nNow, for the purposes of talking about the movie actress vs her private\nlife we might have to rethink things. We can talk about Marilyn Monroe\noutliving Norma Jean. Are they still the same resource? The very fact\nthat we constructed two identifiers suggests that the two will not\nalways be equivalent, certainaly not for all purposes. So same,\ndifferent? It depends on the purpose or intent of the entity who makes\nthe claim of equivalence. Should the identification of which resources\nare the same depend on subjective perspectives? I would rather not for\nsuch a central concept to the architectural style... but that is a\npersonal perspective.\n\nBenjamin\n[1] http://www.mnot.net/javascript/hinclude/\n\n\n\n"}}