{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":164939419,"authorName":"Jon Hanna","from":"Jon Hanna &lt;jon@...&gt;","profile":"hack_poet","replyTo":"SENDER","senderId":"BQO81J0FRqPxGv9fWdv16jvzXKNkDBHmNUel66H-Ia3XIqsL_ZWLMMewm_vAleTQWXhOi8UtFTX0WooTpfdygBUKzEI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Is REST Winning?","postDate":"1180652809","msgId":8723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NUY1NTA5LjIwNzAxMDBAaGFja2NyYWZ0Lm5ldD4=","inReplyToHeader":"PDAwMWQwMWM3YTNjOSRlZTZlNTJiMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","referencesHeader":"PDE0M0NCNTVELUFEMTktNEZBMy1BRURGLURBMUJDOTgxRUEwMEBpbm5vcS5jb20+IDw0NjVGMUE5MS4yMDgwNUBkZWhvcmEubmV0PiA8NmZiMTczZjUwNzA1MzExMjI3aDYyMThkNDc3aGM2NDhmNGNmZGYxNmJkOTlAbWFpbC5nbWFpbC5jb20+IDwwMDFkMDFjN2EzYzkkZWU2ZTUyYjAkMDcwMmE4YzBAR3VpZGVzLmxvY2FsPg=="},"prevInTopic":8722,"nextInTopic":8724,"prevInTime":8722,"nextInTime":8724,"topicId":8703,"numMessagesInTopic":59,"msgSnippet":"Mike Schinkel wrote: Okay, I agree with the basic idea that cookbooks are, or at least can be good. ... At this point I disagree. The cookbook would have to be","rawEmail":"Return-Path: &lt;jon@...&gt;\r\nX-Sender: jon@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 94020 invoked from network); 31 May 2007 23:08:02 -0000\r\nReceived: from unknown (66.218.67.36)\n  by m46.grp.scd.yahoo.com with QMQP; 31 May 2007 23:08:02 -0000\r\nReceived: from unknown (HELO mail.arena1.com) (63.116.216.131)\n  by mta10.grp.scd.yahoo.com with SMTP; 31 May 2007 23:08:01 -0000\r\nReceived: from ip-83-147-166-27.dub-fng.metro.digiweb.ie [83.147.166.27] by mail.arena1.com with SMTP;\n   Thu, 31 May 2007 19:06:48 -0400\r\nMessage-ID: &lt;465F5509.2070100@...&gt;\r\nDate: Fri, 01 Jun 2007 00:06:49 +0100\r\nUser-Agent: Thunderbird 2.0.0.0 (Windows/20070326)\r\nMIME-Version: 1.0\r\nTo: &#39;REST Discuss&#39; &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;143CB55D-AD19-4FA3-AEDF-DA1BC981EA00@...&gt; &lt;465F1A91.20805@...&gt; &lt;6fb173f50705311227h6218d477hc648f4cfdf16bd99@...&gt; &lt;001d01c7a3c9$ee6e52b0$0702a8c0@...&gt;\r\nIn-Reply-To: &lt;001d01c7a3c9$ee6e52b0$0702a8c0@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-Declude-Sender: jon@... [83.147.166.27]\r\nX-Declude-Spoolname: -157462426646.eml\r\nX-Declude-RefID: \r\nX-Declude-Note: Scanned by Declude 4.3.14 for spam. &quot;http://www.declude.com/x-note.htm&quot;\r\nX-Declude-Scan: Score [0] at 19:06:58 on 31 May 2007\r\nX-Declude-Fail: Whitelisted\r\nX-Country-Chain: \r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Jon Hanna &lt;jon@...&gt;\r\nSubject: Re: [rest-discuss] Is REST Winning?\r\nX-Yahoo-Group-Post: member; u=164939419; y=45S0-epmJnjkuFHWGMeZ366WmU0_o-6l7Vz-nDBSQ-SRumTo\r\nX-Yahoo-Profile: hack_poet\r\n\r\nMike Schinkel wrote:\n\nOkay, I agree with the basic idea that cookbooks are, or at least can be \ngood.\n\n&gt; But the cookbook would\n&gt; need to be authoritative.\n\nAt this point I disagree. The cookbook would have to be a good cookbook. \nIt would have to get at least 90% of things better than how they are \ndone otherwise in some measurable way and would have to be at least 98% \naccurate in terms of what it describing actually being REST (it could \nsurvive a few SNAFUs, but bullschildt is worse than useful) and at least \n50% of it would have to be about REST (a not-purely-REST book that could \nalso do, take our recent discussion on URI design, as long as that was \nin a separate section clearly not labelled REST, then coolyaboolya).\n\nIt would not have to be authoritative, indeed it would benefit \nconsiderably from not being authoritative on various counts:\n\nFirstly; Whether something is REST of not and whether something gets a \nbenefit from using REST or not is a matter of computer science. You want \nto be authoritative you&#39;re going to have to write a computer science \nbook. Computer science books are mainly read by computer scientists, \nthey&#39;re sometimes written by hackers (but mainly those hackers that are \nalso language lawyers; most hackers will read computer science too of \ncourse, but not in the same way or for the same reasons as computer \nscientists) and never by my-mother-said-all-the-money-was-in-computers \ntype programmers.\n\nThe computer scientists are already as well served or well disserved by \nthe material out there as they&#39;re going to get (and they are the sort of \npeople who read PhD dissertations anyway).\n\nThe hackers like effiency, scalability and Good Things and have a \nnatural distrust of some of ther personalities that we are (with varying \ndegrees of accuracy) seen as arguing against. For various reasons they \nare well motivated as a community to come on board here.\n\nE.g. these are the two groups that are already here, and most of us on \nthis list are already in one or the other camps (indeed, mostly both to \nsome extent though describing my own accumen in computer science as \nprimative is practically inflating it).\n\nThe whole point of a cookbook is to get the \nmy-mother-said-all-the-money-was-in-computers (those that stayed after \ndot-bomb because they realised that whatever their mother was saying \nthey weren&#39;t cut out for a career in bio-science).\n\nThe constraints necessary to be authoritative are counter to this; we \nneed informative not normative descriptions here.\n\nSecond; Authoritative means &quot;set in stone&quot; at least as far as some sort \nof versioning goes. Set in stone is good when either you have attained \nperfection (a hubristic idea) or there is some pressing technical need \nfor such immutability (why standards tend to be immutable in any given \nversion, though even they can be obsoleted by a different version).\n\nThirdly; Authoritative implies an authority. There is no absolute \nauthority here (not even Roy, on which matter more below, though he&#39;s as \nclose as can be, still it&#39;s being a style means he can&#39;t be quite as \nmuch an authority on REST as say K&R were on C before ISO replaced them \nas the authority). There is no technical basis for selecting one and no \nmoral basis for asserting one; if we go ahead and proclaim an authority \nwhy should anyone else listen to us on the matter. We do have people who \nknow what they&#39;re talking about on either the entirety or a portion of \nthe matter, and we also have some that are well-known (Roy being the \nfirst person to come to mind, Mark the second) but that&#39;s not the same \nas being able to be authoritative.\n\nThe only advantage I can see in being authoritative is that more people \nwould by that book than any rival. Good for royalties, but not good for \nadoption.\n\nA chapter giving &quot;a description of REST so fast it&#39;ll make your head \nspin&quot;, then a breakdown of HTTP in the abstract with concrete examples \nfrom various client-side and server-side technologies, followed by a \nbunch of chapters showing how particular matters before (and this is an \nimportant bit) a chapter on &quot;how it all fits together&quot; (which will \nhopefully be when a lot of people have their moment of Satori is an \napproach I think. Then some general &quot;these are also good things&quot; on a \nbunch of web matters that are clearly not REST but which are not counter \nto it (your hobby-horse of URI design, a good basic understanding of \nUnicode [take my C++ examples out of \nhttp://www.hackcraft.net/xmlUnicode/ and fix it up a bit and you have \nwhat IMHO every hacker on the web should know - if not necessarily \nwithout having to check things every now and again - about that one] and \nso on as a value-add [hmm, some stuff on AJAX and how it can fit in or \nfail to fit in with REST would be good]).\n\nBaggsy I the chapter on how to deal with caching :)\n\n&gt; Either the core REST community is going to come together with Roy&#39;s\n&gt; blessing, to shepherd the market maturation and to define an authoritative\n&gt; interpretation of the REST architecture style of common use cases, or it\n&gt; will all devolve into chaos and the term REST will be much sullied.\n\nI disagree here too, on three different points.\n\nFirstly, I read about an architectural style and came to the conclusion \nthat it was good theory that was also proven in practice. I didn&#39;t drink \nany Kool-Aid. I have a great amount of respect for Roy, but I don&#39;t \nthink we need his blessing for anything. Certainly such a blessing is a \nvery good sign that one is getting things right (and disagreement from \nhim would be a serious warning sign), but the man is a great computer \nscientist and a lucid and clear writer, not a god. Devolving into chaos \nis preferable to descending into a personality-cult.\n\nSecondly, I think the only thing we *need* to do as a community is write \ngood code. Ideally we should be writing publicly-visible, \npublicly-accessible code that is demonstrably successful. However some \nof us often get no further than reducing the amount of dependency upon \nsession state in a bunch of code and replacing a few links that take \nharmful action with posts so that GET isn&#39;t being abused quite as much \nin an application that is still buggy in this regard when we&#39;re finished \nwith it. Still, we do that and demonstrate the advantages to our \ncolleagues and we&#39;re moving things forward.\n\nThe only thing &quot;shepherding market maturation&quot; is likely to do is to \ndevelop a reputation for some of us. This is all good, but it&#39;s not \nimportant.\n\nThirdly, the term REST will get sullied if it&#39;s successful. It just \nwill. Think of any other concept in programming, e.g. OOP. Think of the \nhissy-fits over whether language A has OOP despite it not having \nguarantee B. With any term in computing if you can&#39;t hold up a CD-ROM \nand say &quot;this is X here&quot; then it&#39;ll get sullied. The only \nconter-examples I can think of are a few terms that were originally \nanalogies and so actually sullied another word (e.g. &quot;computer&quot;) or \nbecame obsoleted but outlived that obsolecence becoming identified with \nsomething they were no longer appropriate to (e.g. &quot;program&quot;).\n\nWhile I&#39;m making my posts way to long I&#39;ll also add that the best \ncomputing books are generally short.\n\n\n"}}