{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":164939419,"authorName":"Jon Hanna","from":"Jon Hanna &lt;jon@...&gt;","profile":"hack_poet","replyTo":"SENDER","senderId":"d-6DwUR9rI1fpKB-2MCu8lJE1-RPqigdOSQb414PlxNLdEQwapX8WvkFTH4n40Vgj5psEbLj81UFeqQhk0JN2nqz7wM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Is REST Winning?","postDate":"1180659010","msgId":8732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NUY2RDQyLjMwNjA2MDVAaGFja2NyYWZ0Lm5ldD4=","inReplyToHeader":"PDAwMWUwMWM3YTNkZCRkYTBhMGM2MCQyMTAyZmVhOUBHdWlkZXMubG9jYWw+","referencesHeader":"PDE0M0NCNTVELUFEMTktNEZBMy1BRURGLURBMUJDOTgxRUEwMEBpbm5vcS5jb20+IDw0NjVGMUE5MS4yMDgwNUBkZWhvcmEubmV0PiA8NmZiMTczZjUwNzA1MzExMjI3aDYyMThkNDc3aGM2NDhmNGNmZGYxNmJkOTlAbWFpbC5nbWFpbC5jb20+IDwwMDFkMDFjN2EzYzkkZWU2ZTUyYjAkMDcwMmE4YzBAR3VpZGVzLmxvY2FsPiA8NDY1RjU1MDkuMjA3MDEwMEBoYWNrY3JhZnQubmV0PiA8MDAxZTAxYzdhM2RkJGRhMGEwYzYwJDIxMDJmZWE5QEd1aWRlcy5sb2NhbD4="},"prevInTopic":8731,"nextInTopic":8733,"prevInTime":8731,"nextInTime":8733,"topicId":8703,"numMessagesInTopic":59,"msgSnippet":"... It makes sense for Catholics to favour a Pope, since they believe he is infallible when speaking ex cathedra. There isn t even any sense in which someone","rawEmail":"Return-Path: &lt;jon@...&gt;\r\nX-Sender: jon@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 65066 invoked from network); 1 Jun 2007 00:51:21 -0000\r\nReceived: from unknown (66.218.67.33)\n  by m44.grp.scd.yahoo.com with QMQP; 1 Jun 2007 00:51:21 -0000\r\nReceived: from unknown (HELO mail.arena1.com) (63.116.216.131)\n  by mta7.grp.scd.yahoo.com with SMTP; 1 Jun 2007 00:51:21 -0000\r\nReceived: from ip-83-147-166-27.dub-fng.metro.digiweb.ie [83.147.166.27] by mail.arena1.com with SMTP;\n   Thu, 31 May 2007 20:50:10 -0400\r\nMessage-ID: &lt;465F6D42.3060605@...&gt;\r\nDate: Fri, 01 Jun 2007 01:50:10 +0100\r\nUser-Agent: Thunderbird 2.0.0.0 (Windows/20070326)\r\nMIME-Version: 1.0\r\nTo: &#39;REST Discuss&#39; &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;143CB55D-AD19-4FA3-AEDF-DA1BC981EA00@...&gt; &lt;465F1A91.20805@...&gt; &lt;6fb173f50705311227h6218d477hc648f4cfdf16bd99@...&gt; &lt;001d01c7a3c9$ee6e52b0$0702a8c0@...&gt; &lt;465F5509.2070100@...&gt; &lt;001e01c7a3dd$da0a0c60$2102fea9@...&gt;\r\nIn-Reply-To: &lt;001e01c7a3dd$da0a0c60$2102fea9@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-Declude-Sender: jon@... [83.147.166.27]\r\nX-Declude-Spoolname: -157462422425.eml\r\nX-Declude-RefID: \r\nX-Declude-Note: Scanned by Declude 4.3.14 for spam. &quot;http://www.declude.com/x-note.htm&quot;\r\nX-Declude-Scan: Score [0] at 20:50:21 on 31 May 2007\r\nX-Declude-Fail: Whitelisted\r\nX-Country-Chain: \r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Jon Hanna &lt;jon@...&gt;\r\nSubject: Re: [rest-discuss] Is REST Winning?\r\nX-Yahoo-Group-Post: member; u=164939419; y=zoSnina6hiGx41yon3ZPofzsIaYr96TAySerO5LJU-iz9fy9\r\nX-Yahoo-Profile: hack_poet\r\n\r\nMike Schinkel wrote:\n&gt; We need a Pope, not a group of waring Mullahs.\n\nIt makes sense for Catholics to favour a Pope, since they believe he is \ninfallible when speaking ex cathedra.\n\nThere isn&#39;t even any sense in which someone can speak ex cathedra about \nREST, and I personally wouldn&#39;t believe they were infallible if they could.\n\nI&#39;m for warring Mullahs. (Or autonomous High Priestesses, which is much \nthe same but generally without as much bloodshed).\n\n&gt; Lots of books would be good.  Lots of books with comflicting descriptions of\n&gt; good REST would be bad.\n\nGood in some ways.\n\nThe core idea of REST is simple. It&#39;s relatively simple to point out \nbasic flaws in the core description of REST. Of course that doesn&#39;t make \nit impossible for people to write books, but an orchestrated campaign of \nbook-burning is probably outside of our capabilities :) Bad books can&#39;t \nbe prevented (why we have the term bullshildt in the first place, hey \nShildt&#39;s publishers say he&#39;s an authority too) only good ones encouraged.\n\nOutside of that, when dealing with concrete cases matters will very \nquickly get into cases where differences of opinion will enter and also \nwhere matters outside of REST will have to be addressed (you can&#39;t \ncookbook without going beyond REST, your very first example will have to \ninclude some server settings or some code or at least some markup and \nimmediately you&#39;ve got something there that isn&#39;t just REST).\n\nBetter to have disagreement than Lysenko-Michurinism.\n\n&gt; I&#39;ve assumed that the whole community felt the need for his blessing based\n&gt; on comments from some. If I&#39;m wrong, then no need for Roy after all I guess.\n\nI&#39;m of the opinion that Roy is an extremely smart person and very good \nat conveying his ideas to the rest of us, along with being the person \nwho we all have a debt to in this matter. For that reason any effort \nwith his support is probably a safer bet than any he thinks is a bad \nidea. That&#39;s not the same as needing him.\n\n&gt;&gt; Devolving into chaos is preferable to descending into a \n&gt;&gt; personality-cult.\n&gt; \n&gt; Not that I don&#39;t necessarily agree with, assuming the personality is\n&gt; benevolent. \n\nNo, it always has negative effects, even in the cases where those who \nare so favoured have the good nature not to offend their fans combined \nwith modesty not to believe in the personality cult themselves (you \nmention TimBL elsewhere, from his writing sthe man seems to be composed \nof at least 60% modesty sometimes :)\n\nIt&#39;s also unfair on the poor personality (who became so admired because \nthey were smart enough not to appreciate such a position).\n\n&gt; I respectfully say this is an idealistic view that misunderstands human\n&gt; nature.  A large percentage of the population want to just be told what to\n&gt; do and how to do it, and for that they need a well known and well respected\n&gt; source.\n\nPoint them to the code. Say, e.g. &quot;see how that&#39;s faster and doesn&#39;t \nhave that bug you get when the user opens another tab&quot;. Let them read \nthe code (if it&#39;s not readable then I don&#39;t really count it as &quot;publicly \naccessible&quot;). This step towards copy-paste with a hope of it sometimes \nbeing copy-paste-understand is the same as a cookbooks (why we call them \n&quot;cookbooks&quot;).\n\nNot to say a cookbook couldn&#39;t *also* help though. But writing code is \nthe one thing that we&#39;re screwed if we don&#39;t do.\n\n&gt; We can&#39;t all be experts on all things, and that&#39;s where and why\n&gt; well-known and well-respected sources play such a key role.\n\nYes, but we can&#39;t expect to be the one field were the experts all agree \neither.\n\n&gt;&gt; The only thing &quot;shepherding market maturation&quot; is likely to \n&gt;&gt; do is to develop a reputation for some of us. This is all \n&gt;&gt; good, but it&#39;s not important.\n&gt; \n&gt; So what TimBL did for the web was not important?\n\nI don&#39;t think what TimBL did was shepherding market maturation either.\n\nOkay, there was some shepherding, or rather cat-herding, but that came \nfrom a mixture of relatively high-level education (which plenty here are \nalready doing) and the W3C producing concrete specs (which isn&#39;t very \ndirectly applicable to what we&#39;re talking about apart from RFC 2616, and \nwe don&#39;t need to write RFC 2616 because Roy et al already have) and TAG \nfindings (quite a few of which already impact upon REST and already give \nus things to point to (or sadly to point away from).\n\nI like the idea of a cookbook becuase it&#39;s a clear idea to obtain a \nclear improvement: people read book =&gt; people understand REST.\n\nI&#39;m not at all in agreement that there&#39;s any need for an authoritative \nbook or any possibility of one.\n\nI don&#39;t think we&#39;re even able to prevent &quot;REST&quot; as a term being sullied, \nbut we can get to the point where when management mis-use a term at \nleast the better people at the codeface know what the word is meant to mean.\n\nYou know what. I want REST to be sullied if we can keep actual techies \nknowing what it does mean. When it&#39;s being misused and salespeople are \nsaying &quot;of course it can do that, it&#39;s RESTful&quot; in response to every \ncustomer query we&#39;ll have come a long way. Since I can&#39;t actually think \nof a single reason why most salespeople should have the vaugest clue \nhypermedia is better than &quot;the machine just knowing where everything is \nalready&quot; so I can&#39;t get too upset that most won&#39;t.\n\nIt&#39;s also inevitable because REST doesn&#39;t happen in a vacuum. As someone \npointed out the sort of discussion we had earlier this week on URIs has \na very real risk of sullying peoples definition of REST - and the people \nit&#39;s most important to get right. But expecting people to talk about \nURIs and to then say nothing more on them beyond &quot;oh, they&#39;re opaque \nstrings&quot; is impossible to expect. Still, hype from the same old \nhype-merchants is likely to be less damaging that someone coming onto \nthis list and thinking URI design is directly relevant to REST because \nthey got the wrong end of the stick.\n\n\n"}}