{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":164939419,"authorName":"Jon Hanna","from":"Jon Hanna &lt;jon@...&gt;","profile":"hack_poet","replyTo":"SENDER","senderId":"dBh-eR7JE9MD8k0T5TXSn2eQi3_jVKZE6hnMF80aMAzMxHn1izYfIbgAr8qfHydtosvdFQ4YneGDYMjKVTYrJ17bOkI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] A humble terminological proposal","postDate":"1181210491","msgId":8868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NjdENzdCLjUwOTA4MDlAaGFja2NyYWZ0Lm5ldD4=","inReplyToHeader":"PDAwNzMwMWM3YThjNiQyN2JjMjBhMCQwNzAyYThjMEBHdWlkZXMubG9jYWw+","referencesHeader":"PDIwMDcwNjA3MDQyOTIyLkdBMjExNzNAa2xhbmdyYXVtPiA8MDA3MzAxYzdhOGM2JDI3YmMyMGEwJDA3MDJhOGMwQEd1aWRlcy5sb2NhbD4="},"prevInTopic":8867,"nextInTopic":8869,"prevInTime":8867,"nextInTime":8869,"topicId":8859,"numMessagesInTopic":41,"msgSnippet":"... Nope, if the construction isn t coming from the media it isn t REST. I ve sided with you on the wider argument about the importance of URI design (though I","rawEmail":"Return-Path: &lt;jon@...&gt;\r\nX-Sender: jon@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 33325 invoked from network); 7 Jun 2007 10:02:31 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m47.grp.scd.yahoo.com with QMQP; 7 Jun 2007 10:02:31 -0000\r\nReceived: from unknown (HELO mail.arena1.com) (63.116.216.131)\n  by mta9.grp.scd.yahoo.com with SMTP; 7 Jun 2007 10:02:30 -0000\r\nReceived: from UnknownHost [83.70.80.115] by mail.arena1.com with SMTP;\n   Thu, 7 Jun 2007 06:01:24 -0400\r\nMessage-ID: &lt;4667D77B.5090809@...&gt;\r\nDate: Thu, 07 Jun 2007 11:01:31 +0100\r\nUser-Agent: Thunderbird 2.0.0.0 (Windows/20070326)\r\nMIME-Version: 1.0\r\nTo: &#39;rest-discuss&#39; &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;20070607042922.GA21173@klangraum&gt; &lt;007301c7a8c6$27bc20a0$0702a8c0@...&gt;\r\nIn-Reply-To: &lt;007301c7a8c6$27bc20a0$0702a8c0@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 8bit\r\nX-Declude-Sender: jon@... [83.70.80.115]\r\nX-Declude-Spoolname: -157462092413.eml\r\nX-Declude-RefID: \r\nX-Declude-Note: Scanned by Declude 4.3.14 for spam. &quot;http://www.declude.com/x-note.htm&quot;\r\nX-Declude-Scan: Score [4] at 06:01:33 on 07 Jun 2007\r\nX-Declude-Fail: Whitelisted\r\nX-Country-Chain: \r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Jon Hanna &lt;jon@...&gt;\r\nSubject: Re: [rest-discuss] A humble terminological proposal\r\nX-Yahoo-Group-Post: member; u=164939419; y=haUzSzhV36NykCc7EVyxzVVQILusvREBBqwGkZlaf2vd40JD\r\nX-Yahoo-Profile: hack_poet\r\n\r\nMike Schinkel wrote:\n&gt; Personally, I think that &quot;hypermedia as engine of application state&quot; has\n&gt; been hijacked (even by Roy himself) to prematurely quash any exploration of\n&gt; URL construction. As such, I&#39;m always sensitive when I hear people want to\n&gt; draw more attention to it.  \n\nNope, if the construction isn&#39;t coming from the media it isn&#39;t REST.\n\nI&#39;ve sided with you on the wider argument about the importance of URI \ndesign (though I think most of it&#39;s advantages are irrelevant to REST \nand the exceptions only obliquely relevant), but the possibility of URI \nconstruction is a disadvantage to &quot;nice&quot; URIs, not and advantage.\n\n&gt; What I&#39;m advocating here,  and have been on and off as I&#39;ve had time, is\n&gt; that we should be looking at using &quot;hypermedia AND url construction&quot; instead\n&gt; of having the false dichotomy of &quot;hypermedia OR url construction.&quot; More\n&gt; specifically, I&#39;m referring to the use of URI Templates for servers to\n&gt; convey their intentions to the client via hypermedia.  \n\nIf the server communicates a URI template and how it should be used then \nit IS hypermedia.\n\nIf the client &quot;just knows&quot; how to construct a URI then it isn&#39;t.\n\nHypermedia is any medium from which a parser can derive a URI and its \npurpose (though it may rely upon passing a human-readable string, image \nor similar to a user to determine the purpose) from the document without \nany knowledge beyond the contents of that document, the URI that \ndocument represents (if relevant) and the general rules for parsing that \ndocument.\n\nA good test of this is whether it can deal with a change of URIs in the \npath, host, scheme and query string portion (moving information between \neach of these parts I&#39;d consider a plus but not a vital necessity).\n\nURI templates in an entity received from the server is hence hypermedia.\n\n&gt; Wow. Given&#39;s Roy&#39;s past comments regarding interpretations of his thesis, I\n&gt; ain&#39;t touchin that one with a ten foot pole! &#39;-)\n\nA more balanced approach seems to me to be to interpret it plenty, but \nlisten to any objections he has on that interpretation.\n\nIt&#39;s no use to us if we don&#39;t interpret it to some extent. The problem \nis only if we get this wrong. Personally since I&#39;m not so hubristic as \nto think I&#39;m always right I wouldn&#39;t be upset if Roy criticised \nsomething I said about his thesis, rather I&#39;d be glad of an opportunity \nto learn from the master.\n\n&gt; One of the reasons I believe it hasn&#39;t received &quot;enough attention&quot; is\n&gt; because it&#39;s reference in Roy&#39;s thesis was fleeting (only one sentence?),\n&gt; and particulars of it&#39;s implementation has been nebulous. \n\nAgreed. That concision isn&#39;t a flaw though, but it does mean that there \nis a place for more discussion.\n\n&gt; Here on the list when someone has asked for examples to demostrate the\n&gt; hypermedia constraint they have frequently been dismissively told that &quot;any\n&gt; web page with links is an example.&quot;  While that answer might make the\n&gt; answerers feel smug, it has not provided acceptable guidance for people\n&gt; trying to implement the constraint for use in RESTful services not targeting\n&gt; the browser.\n\nActually, it&#39;s a pretty good example in a lot of ways. The one real \ndisservice I think we do in that example is not saying &quot;with links or \nforms&quot;.\n\nThat it doesn&#39;t directly relate to what people are thinking about when \nthey think about media types aimed at other uses (particularly web \nservices) is a point rather than an excuse to feel smug - web pages work \nand are presumably getting something right. Ignoring the case of \nwebservices here is a bit like a kōan that can bring enlightenment. I \ndon&#39;t feel smug when I refer to web pages as an example of hypermedia, I \nthink &quot;why did it take me so long to get this myself?&quot;\n\nIf people don&#39;t get it from that example, I think they may need *lots* \nof examples. Adding RSS, ATOM, SVG, Google Sitemaps, RDF documents with \nseeAlso and so on may still not be enough.\n\nReally hypermedia is almost too simple that some people (focusing on \nother concerns, especially if their background makes RPC or other \nnon-RESTful solutions seem more obvious) can&#39;t change gears.\n\nReminds me of the IRC conversation that lead to one of the participants \ndesigning http://www.cafepress.com/rest.2592837\n\n\n"}}