{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":228155998,"authorName":"Mike Schinkel","from":"&quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;","profile":"mikeschinkel","replyTo":"SENDER","senderId":"YJzFIMK3hazZpKLRrJuA0UWONeYg8smuimJRQx3qr8gr_uP8xPsJXOvlhYUqslu-romwuJ0zb1lz5x0vNwkeTMENnL-rcYoR9KmiMjkhww","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [rest-discuss] Re: A humble terminological proposal","postDate":"1181933402","msgId":9049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNmMwMWM3YWY3ZCRmZDdhYmE0MCQyMTAyZmVhOUBHdWlkZXMubG9jYWw+","inReplyToHeader":"PDIwMDcwNjE1MDYyMzQwLkdDMzM2MUBrbGFuZ3JhdW0+","referencesHeader":"PDIwMDcwNjA3MDQyOTIyLkdBMjExNzNAa2xhbmdyYXVtPiA8MDA3MzAxYzdhOGM2JDI3YmMyMGEwJDA3MDJhOGMwQEd1aWRlcy5sb2NhbD4gPDQ2NjdENzdCLjUwOTA4MDlAaGFja2NyYWZ0Lm5ldD4gPDAxMmIwMWM3YWFkNiQ1MzFmZTE3MCQwNzAyYThjMEBHdWlkZXMubG9jYWw+IDwyMDA3MDYxNTA2MjM0MC5HQzMzNjFAa2xhbmdyYXVtPg=="},"prevInTopic":9037,"nextInTopic":9051,"prevInTime":9048,"nextInTime":9050,"topicId":8859,"numMessagesInTopic":41,"msgSnippet":"... And *your* harping is not tiresome?!?  Just because you don t appreciate my position doesn t give you moral authority to elevate yours over mine. And ","rawEmail":"Return-Path: &lt;mikeschinkel@...&gt;\r\nX-Sender: mikeschinkel@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 70138 invoked from network); 15 Jun 2007 18:50:08 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m48.grp.scd.yahoo.com with QMQP; 15 Jun 2007 18:50:08 -0000\r\nReceived: from unknown (HELO wr-out-0506.google.com) (64.233.184.233)\n  by mta5.grp.scd.yahoo.com with SMTP; 15 Jun 2007 18:50:08 -0000\r\nReceived: by wr-out-0506.google.com with SMTP id 76so872097wra\n        for &lt;rest-discuss@yahoogroups.com&gt;; Fri, 15 Jun 2007 11:50:07 -0700 (PDT)\r\nDKIM-Signature: a=rsa-sha1; c=relaxed/relaxed;\n        d=gmail.com; s=beta;\n        h=domainkey-signature:received:received:from:to:references:subject:date:message-id:mime-version:content-type:content-transfer-encoding:x-mailer:in-reply-to:x-mimeole:thread-index;\n        b=lL5QaceicFHKI9AcoI/WlDMs3DepWwQrl86tyheUulIyp2mFJ+NhoFS1oq5zrkB6/Kn9ue8VwEPOD0oFwsLYO8A9Km58xKPIL5tWi1sd5LhaXAXQZ5pVqb44lzBwKaCXfcBIFkc7qsN7/quhUrOorXxe5VsQcoWr0Cxy8MyM4Fc=\r\nReceived: by 10.90.97.11 with SMTP id u11mr3012876agb.1181933407493;\n        Fri, 15 Jun 2007 11:50:07 -0700 (PDT)\r\nReturn-Path: &lt;mikeschinkel@...&gt;\r\nReceived: from desktop ( [69.94.221.21])\n        by mx.google.com with ESMTP id 32sm4830225wri.2007.06.15.11.50.05\n        (version=SSLv3 cipher=RC4-MD5);\n        Fri, 15 Jun 2007 11:50:06 -0700 (PDT)\r\nTo: &quot;&#39;A. Pagaltzis&#39;&quot; &lt;pagaltzis@...&gt;,\n\t&quot;&#39;rest-discuss&#39;&quot; &lt;rest-discuss@yahoogroups.com&gt;\r\nReferences: &lt;20070607042922.GA21173@klangraum&gt; &lt;007301c7a8c6$27bc20a0$0702a8c0@...&gt; &lt;4667D77B.5090809@...&gt; &lt;012b01c7aad6$531fe170$0702a8c0@...&gt; &lt;20070615062340.GC3361@klangraum&gt;\r\nDate: Fri, 15 Jun 2007 14:50:02 -0400\r\nMessage-ID: &lt;016c01c7af7d$fd7aba40$2102fea9@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook 11\r\nIn-Reply-To: &lt;20070615062340.GC3361@klangraum&gt;\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.3138\r\nThread-Index: AcevFczjb+6sP/wLQzOuTos3fKU52QAYHAlQ\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Mike Schinkel&quot; &lt;mikeschinkel@...&gt;\r\nSubject: RE: [rest-discuss] Re: A humble terminological proposal\r\nX-Yahoo-Group-Post: member; u=228155998; y=IKS9lSMcEsDDkJI9AV17NZXXV53K2JwQMFwOoMdBf2IYLJG8hf7G\r\nX-Yahoo-Profile: mikeschinkel\r\n\r\nA. Pagaltzis wrote:\n&gt; * Mike Schinkel &lt;mikeschinkel@...&gt; [2007-06-09 22:45]:\n&gt; &gt; Thanks, you&#39;ve just artfully illustrated my point!  Say &quot;URL \n&gt; &gt; Construction&quot; and the RESTians stick their fingers in their \n&gt; ears and \n&gt; &gt; scream &quot;I don&#39;t hear you&quot; while humming very loudly...\n&gt; &gt; ;-)\n&gt; &gt; \n&gt; &gt; IOW, the phrase &quot;URL construction&quot; it is a trigger that causes most \n&gt; &gt; REST advocates to immediately become defensive rather than to be \n&gt; &gt; willing to explore how to achieve both benefits of hypermedia *and* \n&gt; &gt; URL construction. It&#39;s kinda similar to the feelings that \n&gt; the phrase \n&gt; &gt; &quot;amnesty&quot; evokes in certain people here in the US right now. ;-)\n&gt; \n&gt; Your harping on this matter and your triumphalist &quot;a-ha! gotcha!&quot;\n&gt; responses are getting tiresome, I have to say. Please quit \n&gt; making up controversy that doesn&#39;t exist.\n\nAnd *your* harping is not tiresome?!?  Just because you don&#39;t appreciate my\nposition doesn&#39;t give you moral authority to elevate yours over mine. And\nplease, let&#39;s avoid the ad-hominems because it doesn&#39;t do this list good to\ndevolve to that.  \n\n&gt; The matter is very simple: if the URI is constructed \n&gt; according to promises published in a resource by the server, \n&gt; then it is hypermedia. If the URI is constructed based on a \n&gt; priori client knowledge of the server URI space then it is \n&gt; not hypermedia. Fin.\n&gt; \n&gt; &gt; &gt;If the server communicates a URI template and how it \n&gt; should be used \n&gt; &gt; &gt;then it IS hypermedia.\n&gt; &gt; \n&gt; &gt; Your acknowledgement here is begrudging rather than revelational.\n&gt; \n&gt; No, his acknowledgement is a Rorschach test. Your \n&gt; interpretation of it as begrudged is merely a reflection of \n&gt; your own bias.\n\nI guess I&#39;m the only one on this list whose comments are reflecting a bia?\n&#39;-)\n\n&gt; &gt; It&#39;s my belief we need to stop being afraid of URI \n&gt; construction as a \n&gt; &gt; phrase and instead look for how to achieve most or all of \n&gt; its benefits \n&gt; &gt; without causing harm to the REST architecture.\n&gt; \n&gt; That&#39;s very simple: if the URI is constructed based on \n&gt; hypermedia, then the application is RESTful. If not, it&#39;s not.\n\nBut it is a point that is not even addressed by many when discussing with\npeople who are learning REST, and those newly christened RESTians go forth\nand preach the dogma that URIs cannot be constructed, period.  My &quot;tiresome&quot;\ncomments are meant to shine a light on the issue to discourage even more\nfurture cargo-cultists.\n\n&gt; &gt; &gt;A good test of this is whether it can deal with a change \n&gt; of URIs in \n&gt; &gt; &gt;the path, host, scheme and query string portion (moving \n&gt; information \n&gt; &gt; &gt;between each of these parts I&#39;d consider a plus but not a vital \n&gt; &gt; &gt;necessity).\n&gt; &gt; \n&gt; &gt; Heh. Any and every REST system will fail that test. After \n&gt; all, how do \n&gt; &gt; you change the entry point URL? &#39;-)\n&gt; \n&gt; Not by changing the code, hopefully. \n&gt; \n&gt; In fact, you could make that URI a link in a resource you \n&gt; control, in which case the REST client would in fact not need \n&gt; to change *at all*.\n&gt; \n&gt; See? We could split hairs about the exceptional case of the \n&gt; entry point all day long. :-)\n&gt; \n&gt; What matters is you know what Jon meant; and you do.\n\nThat&#39;s a marginal case on the open Internet.  Publishing an API for others\nto consume ensures that this will almost certainly not be the case.  My\nbringing it up was NOT splitting hairs, it was to make the point that REST\nis not pure as physics is pure, and that there are edge case problems with\nthe hypermedia constraint.  As every REST system could theoretically be\ncomposed to make a larger REST system, the once published entry point now\nbecomes verboten to be constructed. And the converse is also true, that many\nREST services could be decomposed into smaller independent services. When\nthe decomposition occurs, what is the entry point?  Is it a constructed URL,\nor did you have to follow hypermedia from the larger service to get to it?\nAnd if that larger service is then composed with yet more services, where\nare the valid entry points that don&#39;t require hypermedia?  Thus I see a\nproblem with the hypermedia constraint because it does not scale upwards or\ndownwards. While I see it&#39;s theoretical benefit, I see problems in its real\nworld use as just described and that&#39;s why I think it is so important to\nactively encourage the incorporation of URL composition into the mix at all\nlevels.  By encouraging URL construction using templates, REST services will\nbe more easiler able to scale albeit there will still be edge problems but\nless so. Services would compose URLs based on templates, but where the\ntemplate comes from is the edge case yet that can easily be provided by the\nlarger service when services are composed. As is, services faithfully the\nfollowing hypermedia constraint are ironically brittle with respect any\nchanges involving composition or decomposition.\n\nWhat&#39;s more, assuming an arbitrary Internet-published REST-based API, it is\nmuch easier to program a direct resource retrieval using URI composition\nthan it is to program a hypermedia-following resource retrieval, partly\nbecause there are absolutely no standards for such discovery and retrieval\nleaving the hapless developer or entrepreneur to code it themselves. For a\ngreat developers it is trivial, but for many smaller businesses or\nentrepreneurs w/o hotshot developers on staff it is not.  So a company\npublishing a web API can either tell it&#39;s potential users to follow the pure\nREST hypermedia model, or do URI construction. And if they do the former,\nthey are likely to get a lot more people using it.  Which would you chose?\nIf you say hypermedia, I can tell we are discussing a hypothetical question\nand not one on which your livelihood depends.\n\nFinally, for an open API published on the web, I am almost willing to argue\nthat textually publishing the URL format and encouraging people to do URI\nconstruction w/o hypermedia is okay assuming the company is willing to\nmaintain those URLs. After all, I can&#39;t see any reason why Amazon couldn&#39;t\ncommit itself to maintain its services at http://services.amazon.com/ where\nto get info on one of the items they sell you would just append their &quot;ASIN&quot;\nto the end of their &quot;items&quot; URL http://services.amazon.com/items/1234567890/\nThere are many things in life where companies need to put a stake in the\nground and then maintain that stake, i.e. car makers have to maintain spare\nparts for their cars for many years, I see no reason why it should be\nabsolutely forbidden for companies to publish REST apis for the open\nInternet that do not require hypermedia to discover and parse.  \n\nThe hypermedia constraint is simply the web&#39;s example of the more general\nabstraction and indirection pattern used to improve maintainability of\nsystems throughout software development. But as experience has shown us, too\nmuch abstraction and too much indirection make for too much complexity, and\nthat pill can at times be worse than the ailment it attempts to cure.  I\nknow this as I have often tried to over-generalize a system only to find I&#39;d\nmade it too complex to work with. Sometimes it is better to simply hardcode\nsomething than to make it too complex.  And I&#39;d argue that plublished open\napis on the Internet could well be a valid place where URLs could be\nreasonably hardcoded.\n\nThere, I said the heresey.  Let the burning at the stake begin...\n\nMy guess is that you deal with internal systems a lot more than you deal\nwith the open internet. Maybe that&#39;s why your bias differs from mine.\n\n&gt; &gt; &gt;That it doesn&#39;t directly relate to what people are thinking about \n&gt; &gt; &gt;when they think about media types aimed at other uses \n&gt; (particularly \n&gt; &gt; &gt;web services)\n&gt; &gt; \n&gt; &gt; That&#39;s one falicy RESTians often commit; assuming that \n&gt; everyone that \n&gt; &gt; is trying to understand REST is steeped in SOAP or RPC.\n&gt; &gt; Many web developers (myself included) had never used SOAP or RPC so \n&gt; &gt; for us this is unnecessary complication.\n&gt; \n&gt; I realised this today. The reason I have been harping on the \n&gt; hypermedia constraint lately is that it is the only part of \n&gt; REST that I hadn&#39;t already understood.\n\nAh.  There is rarely a man as zealous as the newly converted.  And what was\nthat you said about &quot;bias?&quot; &#39;-)\n\n&gt; &gt; Rather than go round and round on this, will you at least \n&gt; agree that \n&gt; &gt; most people need more guidance than just being told: &quot;any\n&gt; &gt; web page with links and forms is an example?&quot;    \n&gt; \n&gt; Was anyone seriously saying that this is sufficient guidance?\n\nYes.\n\n&gt; I didn&#39;t think anyone was claiming that. \n\nNot in the past week, there wasn&#39;t.  Go back to October of last year when I\nwas learning about REST. I&#39;d dig it up but Google doesn&#39;t seem to be\nindexing Yahoo groups well...\n\n&gt; But I think this matter will straighten itself out over time \n&gt; as more people absorb the lessons and apply it in practice, \n&gt; coming away with examples from experience.\n&gt; \n&gt; It&#39;s just the natural process of adoption.\n\n...and as people like me, and you, have these *tiresome* debates.\n\n-- \n-Mike Schinkel\nhttp://www.mikeschinkel.com/blogs/\nhttp://www.welldesignedurls.org\nhttp://atlanta-web.org - http://t.oolicio.us\n\n\n\n"}}