{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":10266038,"authorName":"Jeff Bone","from":"Jeff Bone &lt;jbone@...&gt;","replyTo":"SENDER","senderId":"v1b5db5Wjjnvp9A5Whl47rbE11npRMVnaPvnJ3buPAkEVmffCBF9_d_Hfh7t4THSGnmR1YgagbNZUwJGMZdXsaI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [rest-discuss] Onions in the Varnish","postDate":"1015540232","msgId":922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDODdFQTA4LkEwNjdDNzdGQGp1bXAubmV0Pg==","referencesHeader":"PDNDODdCMzQ0LkE5NUNCRkIwQGp1bXAubmV0PiA8M0M4N0JGMUMuOUI0MERCOTFAcHJlc2NvZC5uZXQ+IDwzQzg3RDI5NC42RUQ5OTZDMEBqdW1wLm5ldD4gPDNDODdERDAwLjczQzg1MkNBQHByZXNjb2QubmV0Pg=="},"prevInTopic":921,"nextInTopic":927,"prevInTime":921,"nextInTime":923,"topicId":914,"numMessagesInTopic":16,"msgSnippet":"Detailed but concise responses to many incorrect or invalid assertions. ... You opened that line of argument.  I just tossed it back with a winky. ;-)  I would","rawEmail":"Return-Path: &lt;jbone@...&gt;\r\nX-Sender: jbone@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: unknown); 7 Mar 2002 22:37:45 -0000\r\nReceived: (qmail 9626 invoked from network); 7 Mar 2002 22:34:00 -0000\r\nReceived: from unknown (216.115.97.171)\n  by m8.grp.snv.yahoo.com with QMQP; 7 Mar 2002 22:34:00 -0000\r\nReceived: from unknown (HELO blanco.clickfeed.com) (207.8.92.96)\n  by mta3.grp.snv.yahoo.com with SMTP; 7 Mar 2002 22:34:00 -0000\r\nReceived: from jump.net (cust-92-97.customer.jump.net [207.8.92.97])\n\tby blanco.clickfeed.com (8.10.0/8.10.0) with ESMTP id g27MXvO26418;\n\tThu, 7 Mar 2002 16:33:57 -0600\r\nMessage-ID: &lt;3C87EA08.A067C77F@...&gt;\r\nDate: Thu, 07 Mar 2002 16:30:32 -0600\r\nX-Mailer: Mozilla 4.7 [en]C-CCK-MCD {Sony}  (Win98; I)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: Paul Prescod &lt;paul@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nSubject: Re: [rest-discuss] Onions in the Varnish\r\nReferences: &lt;3C87B344.A95CBFB0@...&gt; &lt;3C87BF1C.9B40DB91@...&gt; &lt;3C87D294.6ED996C0@...&gt; &lt;3C87DD00.73C852CA@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Jeff Bone &lt;jbone@...&gt;\r\nX-Yahoo-Group-Post: member; u=10266038\r\n\r\n\nDetailed but concise responses to many incorrect or invalid assertions.\n\nPaul Prescod wrote:\n\n&gt; Jeff Bone wrote:\n&gt; &gt;\n&gt; &gt; Sorry, Paul -- the confusion isn&#39;t in my head, it may or may not be in Tim&#39;s\n&gt; &gt; head, but it&#39;s certainly in yours.  ;-)\n&gt;\n&gt; Why don&#39;t we quit this line of discussion. It&#39;s unnecessarily\n&gt; inflammatory to presume that because someone disagrees with you they\n&gt; must not have thought through the issues.\n\nYou opened that line of argument.  I just tossed it back with a winky. ;-)  I would\nprefer not to engage that way, but you did (and continue to, below) presume the\nvery thing you&#39;re encouraging me not to presume about you.\n\n&gt; In fact I had all of the same\n&gt; questions when I first heard that URIs are opaque.\n\nIt&#39;s incorrect (and, as you&#39;ve asserted above, unnecessarily inflammatory) to\nassume that this is a first reaction to URI opacity on my part.  On the contrary,\nas I&#39;ve mentioned in private correspondance to you previously, my starting point\ncirca my REST gestalt mid last year was to accept all of it --- including URI\nopacity --- on faith.  My current POV is the result of a critical examination of\nthat acceptance of the whole rather than specific parts.  My current conclusions\nare not the result of a process of initial non-acceptance.\n\n&gt; Luckily, there is a\n&gt; document that discusses opacity, query parameters, relative URIs and so\n&gt; forth. It was written in 1996, perhaps years after Tim Berners-Lee went\n&gt; down the same mental paths you are.\n\nI&#39;d be very surprised if, either in the course of the discussion here or in the\npages I&#39;ve been working on in the Wiki, I haven&#39;t cited the document you mention.\nI would be even more surprised if I haven&#39;t already read that document and, indeed,\nbased part of my current thinking on it.\n\n&gt; I haven&#39;t done a comparison to various file systems\n\nThen you are insufficiently prepared.\n\n&gt; As long as you restrict yourself to the semantics described in the URI\n&gt; specifications, I have no argument. Those are shared agreements that\n&gt; software reliably implements. When you start inventing naming\n&gt; conventions you are going beyond that and starting to embed *application\n&gt; semantics* in URIs.\n\nNo, you are embedding information modeling semantics in URI.  HTTP is the\napplication.  And this should be no more or less acceptable than using, say,\narbitrary XML Schemata or RDF.  Again, if it&#39;s not clear, I&#39;m *not* suggesting that\nURI be given &quot;naked semantics.&quot;  I am suggesting that explicit and possibly\nextensible semantics can be given by specific namespace owners to specific sets of\nURI w/o the Web coming to an end.\n\n&gt; Software that depends upon this will be fragile in\n&gt; the face of changes in URIs.\n\nThis is a myth, cf. the Wiki.  Short version:  this is no more a problem than is\nschema evolution, etc. in RDF ontologies.  To the extent that software might be\nfragile in the face of good, disciplined use of structured naming, that&#39;s IMO poor\nsoftware design causing the fragility.\n\n&gt; Insofar as URIs are tied to servers, they\n&gt; will be fragile in the face of resource moves to other servers. This can\n&gt; only be mitigated through expensive redirects.\n\nThis is a red herring.  URIs are already tied to servers.  Recognizing and\nexploiting the semantics of the path component of a URI doesn&#39;t make the URI any\nmore or less susceptible to this problem.\n\n&gt; URIs are opaque at the application level. Client software should not\n&gt; inspect URIs to try and figure out the structure of a server&#39;s data\n&gt; model.\n\nThis is trivially incorrect.  Relative URI are an example of how client software\ncan and does inspect URI to determine certain things about the structure of a\nserver&#39;s data model.\n\n&gt; Relative URIs are a syntactic shortcut like a macro. Like a macro, they\n&gt; are provided by the person who created the data. If the *client* started\n&gt; inventing relative URIs, by adding &quot;..&quot;s etc., it would be a violation\n&gt; of application-level URI opacity.\n\nBig deal.  If the server (or some other agency) provides explicit information about\nthe structure of its names and their associated semantics then there&#39;s no downside.\n\n&gt; You have to make a case that there is value in enriching those\n&gt; semantics.\n\nNo, you have to make the case that there isn&#39;t.  Extraordinary claims require\nextraordinary proof.  TBL&#39;s assertion of the axiom is the extraordinary claim,\ncounter to the majority of all namespace and filesystem research out there today.\n\n&gt; So far all I&#39;ve seen is: &quot;this thing that can be done with\n&gt; hypertext. We could also do it in a different way with namespaces.&quot;\n\nThat&#39;s not true, I have already given you a very particular example of how\ngenerative names can be used that is impossible to accomplish with hypertext.  With\ngenerative names, it might be possible to crawl a site to &quot;find the page that isn&#39;t\nlinked to by any other page.&quot;  Using strictly the hypergraph topology, this is\nimpossible.  This is a trivial but I think evocative example.\n\n&gt; &gt; Invalid analogy.  URI aren&#39;t variable names in a flat namespace, they are\n&gt; &gt; semi-hierarchical names in a structured namespace.\n&gt;\n&gt; &gt;From the client&#39;s point of view it *is* a flat namespace. That&#39;s just\n&gt; the point.\n\nOnly by virtue of the Axiom of Opacity.  You can&#39;t use the Axiom of Opacity to\nprove the validity of the Axiom of Opacity.  Next thing you know you&#39;ll be telling\nme that everything in the Bible is true because it&#39;s God&#39;s Word, and we know that\nbecause the Bible tells us so.\n\n&gt; &gt; ... Consider:  every piece of\n&gt; &gt; *Web server software* on the planet builds log files.  These log files are\n&gt; &gt; often named and managed in a hierarchical log space, with log file names\n&gt; &gt; constructed generatively according to some rules or grammar.\n&gt;\n&gt; So software ignores web architecture. What a surprise! This could easily\n&gt; be handled with either hypertext links or query parameters.\n\nMy point is to illustrate that useful and simple examples of generative naming\nabound throughout all types of software.  Why do you think Web server\nimplementations use such a non-Webby concept as structured naming to manage\nlogfiles, rather than using some other hypermedia concept or what have you?  Could\nit be because there are benefits to doing so?\n\njb\n\n\n"}}