{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"eQ39BecDfV74g_NcWbHsIiJLh0LKulvIayrtrkc18qaw8ax9jya4OFAn3NpAAz5ylCqw35g-LD_x4hqcERVPXfrCwi6vOuckd7kpQFPdRA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Fun with DELETE","postDate":"1183761657","msgId":9363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFc1OTYwNzI4NjI2OTE1MTE4Mzc2MTY1N0BtYWlsLm1haWxzbmFyZS5uZXQ+"},"prevInTopic":9362,"nextInTopic":9364,"prevInTime":9362,"nextInTime":9364,"topicId":8604,"numMessagesInTopic":107,"msgSnippet":"... Nope, a 404 response is a representation of the resource s unavailability. ... A resource is a conceptual mapping to a set of entities... The default","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 1906 invoked from network); 6 Jul 2007 22:41:07 -0000\r\nReceived: from unknown (66.218.67.33)\n  by m39.grp.scd.yahoo.com with QMQP; 6 Jul 2007 22:41:07 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (209.236.228.78)\n  by mta7.grp.scd.yahoo.com with SMTP; 6 Jul 2007 22:41:07 -0000\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nX-Message-ID: 749f92e98ac7daa1b40c7093adeba4681e7bd0d5869d272e49d9ebde58f8da29\r\nReceived: from mail.mailsnare.net (unknown [209.236.228.74])\n\tby mail.mailsnare.net (Postfix) with ESMTP id F3E3879191\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Fri,  6 Jul 2007 22:40:56 +0000 (UTC)\r\nTo: rest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W59607286269151183761657@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Fri, 06 Jul 2007 22:40:57 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;utf-8&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: Re: Fun with DELETE\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\n&gt;\n&gt;Nope. 404 means no representation is available.\n&gt;\n\nNope, a 404 response is a representation of the resource&#39;s unavailability.\n\n&gt;\n&gt;Please define &quot;undefined resource&quot;.\n&gt;\n\n&quot;A resource is a conceptual mapping to a set of entities...&quot;\n\nThe default response of any naming authority is a 404 error, right?  \nThat&#39;s because no conceptual mapping exists to any set of entities, \ni.e. the resource is undefined by the naming authority (server).  Once \na conceptual mapping exists, the resource has been defined (by its \nconceptual mapping).  This is a precondition for sending a 410 \nresponse -- the resource must have been defined by the naming authority, \nat some point in time.\n\nIf the resource still exists, but has been moved, the response could be \na 30x to redirect the client.  But, does deleting a resource delete the \nconceptual mapping that was already established?  Not necessarily, the \n410 response in no way indicates that the resource _wasn&#39;t_ moved, the \ncase may be that the resource was moved to a new domain on a new ISP \nwhile the old ISP is no longer under contract to maintain the forwarding.  \nThe 4xx response codes imply nothing about the existence of a resource.  \nAn undefined resource can only respond 404 to a GET request, which in no \nway precludes a defined resource from responding 404.  The 404 and 410 \nresponse codes only indicate _that_ the request has failed, not _why_.\n\n&gt;\n&gt;Sorry, I think you&#39;re reading things into RFC2616 which just aren&#39;t\n&gt;there. 410 is a special case of 404, &quot;not found&quot;. That&#39;s all.\n&gt;\n\nSorry, but RFC 2616 clearly states that the resource may still exist \nregardless of a 404 or a 410 response.  Those status codes just mean \nthe request failed, and I think you&#39;re the one reading stuff in \nbeyond that if you are saying that I can&#39;t make anything but a GET or \na PUT request if the response code is 404 or 410 because those somehow \nimply that the resource does not exist.\n\n&gt;\n&gt;404 is different from 200 + empty body, just like an empty file is\n&gt;different from an absent file.\n&gt;\n\nHow is an empty file different from an absent file, in terms of REST, \nwhich could care less about how a resource is generated?  The server \nis opaque from the client perspective, a client receiving a 404 or a \n410 response can make no assumptions about whether a file exists or \ndoes not exist on the server, or used to exist, or won&#39;t exist again \nat some point in the future.  The 404 and 410 responses simply mean \nthe request failed.\n\n&gt;\n&gt;At this point I&#39;m really confused about the whole point of this\n&gt;discussion. Are you proposing this as a general solution? To what problem?\n&gt;\n\nI merely posted my solution to a problem I had, for the sake of discussion \nand as an example of how DELETE doesn&#39;t only have to mean &quot;remove a file \nfrom the server&quot;.  Imagine my surprise when I am told that I can&#39;t use \na 410 Gone after a DELETE, or that I can&#39;t send a DELETE message to a \nresource just because it is responding 410 Gone, or that I don&#39;t understand \nthe RFCs, or etc. etc. etc. which comes across as a pissing match instead \nof the help I was looking for.\n\nWhich, by the way, I already thanked Aristotle for and we are changing the \nif-none-match on the first DELETE to an if-match on the second DELETE.  \nBeyond that, I was hardly expecting anyone to respond, &quot;Hey, that&#39;s pretty \nneat&quot; because I have grown accustomed to any unorthodox solution I present \nbeing attacked from all sides.  Yet nobody ever specifically states what \nis un-RESTful about my implementation or why they think that, they only \nseem to make statements about how I *must* be doing something wrong or \nquoting RFC 2616 to me even though that isn&#39;t where REST is defined.\n\nSo as to the question of what is the point of this discussion, I never \nreally know, for the most part.  But overall, if the takeaway is that I \nor someone else lurking here learns something, then I&#39;m pretty happy.  \nI am willing to both teach what I know of REST and learn what I do not \nknow of REST.  At this point, I&#39;m convinced that I have a perfectly \nRESTful implementation, and I am not afraid to defend it from those who \ndo not understand or explain it to those who are trying to understand, \nor learn from those who can explain to me in terms of REST _why_ what I \nam doing is &quot;wrong&quot; in specific terms of REST constraints or standards \nviolation -- and convince me that their own interpretation is more \ncorrect than mine.\n\n-Eric\n\n\n\n\n"}}