{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":10266038,"authorName":"Jeff Bone","from":"Jeff Bone &lt;jbone@...&gt;","replyTo":"SENDER","senderId":"Ws6verm6i_tFQri6L1NdeVr-QeQfPJWlTfEyyDP905ayKDkwy0igzZHfmj4zBVtTHkMsqdumu1Jq7TP5wytMV_M","spamInfo":{"isSpam":false,"reason":"0"},"subject":"More for Paul","postDate":"1015626074","msgId":944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDODkzOTU5LjczN0U5RDhBQGp1bXAubmV0Pg==","referencesHeader":"PDNDODY5ODNGLjFDRkIxN0VBQGp1bXAubmV0PiA8M0M4NjlGMDQuNEJBNDk1MzRAcHJlc2NvZC5uZXQ+IDwzQzg2QTZDQy5CM0M3OUE1MUBqdW1wLm5ldD4gPDNDODZBQjA3LjhFRjlDNDMxQHByZXNjb2QubmV0PiA8M0M4NkFFMTUuNTEzRTA0MjJAanVtcC5uZXQ+IDwzQzg2QjJERC5ENERCMUYwOEBwcmVzY29kLm5ldD4gPDNDODZDQkM3LjUyQjU3RTM0QGp1bXAubmV0PiA8M0M4NkQxNEEuOEQwRkE5RTdAcHJlc2NvZC5uZXQ+IDwzQzg2REQ4RC5ENDQwOEI3NUBqdW1wLm5ldD4gPDNDODZFODIyLkI5MDM0NjJAcHJlc2NvZC5uZXQ+IDwzQzg3MEJBNy45Q0M5QjZCMUBqdW1wLm5ldD4gPDNDODdBRDhGLjEzQ0RENDE0QHByZXNjb2QubmV0PiA8M0M4ODA5QTkuMkM5RTZBNkFAanVtcC5uZXQ+IDwzQzg4MTFCMC5DMEU3QjAwREBwcmVzY29kLm5ldD4gPDNDODg0OEMxLkRBODQyQjY1QGp1bXAubmV0PiA8M0M4ODVCNTQuRDBDN0MxQTNAcHJlc2NvZC5uZXQ+IDwzQzg4RTIxNy44N0ExRDc1NkBqdW1wLm5ldD4gPDNDODkxMEY5LjkzNDAyOUU0QHByZXNjb2QubmV0Pg=="},"prevInTopic":0,"nextInTopic":946,"prevInTime":943,"nextInTime":945,"topicId":944,"numMessagesInTopic":13,"msgSnippet":"See the Wiki: [1] ... No.  The above is an artificially bogus problem statement, I wouldn t do that to you.  The problem I have offered is a much more","rawEmail":"Return-Path: &lt;jbone@...&gt;\r\nX-Sender: jbone@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (EGP: unknown); 8 Mar 2002 23:47:33 -0000\r\nReceived: (qmail 91161 invoked from network); 8 Mar 2002 22:23:15 -0000\r\nReceived: from unknown (216.115.97.167)\n  by m8.grp.snv.yahoo.com with QMQP; 8 Mar 2002 22:23:15 -0000\r\nReceived: from unknown (HELO sm10.texas.rr.com) (24.93.35.222)\n  by mta1.grp.snv.yahoo.com with SMTP; 8 Mar 2002 22:23:15 -0000\r\nReceived: from jump.net (rrcs-sw-24-242-137-238.biz.rr.com [24.242.137.238])\n\tby sm10.texas.rr.com (8.12.0.Beta16/8.12.0.Beta16) with ESMTP id g28MNC15005615;\n\tFri, 8 Mar 2002 16:23:13 -0600\r\nMessage-ID: &lt;3C893959.737E9D8A@...&gt;\r\nDate: Fri, 08 Mar 2002 16:21:14 -0600\r\nOrganization: Straytech / Clickfeed / Deepfile\r\nX-Mailer: Mozilla 4.7 [en] (Win95; I)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: Paul Prescod &lt;paul@...&gt;\r\nCc: rest-discuss@yahoogroups.com\r\nSubject: More for Paul\r\nReferences: &lt;3C86983F.1CFB17EA@...&gt; &lt;3C869F04.4BA49534@...&gt; &lt;3C86A6CC.B3C79A51@...&gt; &lt;3C86AB07.8EF9C431@...&gt; &lt;3C86AE15.513E0422@...&gt; &lt;3C86B2DD.D4DB1F08@...&gt; &lt;3C86CBC7.52B57E34@...&gt; &lt;3C86D14A.8D0FA9E7@...&gt; &lt;3C86DD8D.D4408B75@...&gt; &lt;3C86E822.B903462@...&gt; &lt;3C870BA7.9CC9B6B1@...&gt; &lt;3C87AD8F.13CDD414@...&gt; &lt;3C8809A9.2C9E6A6A@...&gt; &lt;3C8811B0.C0E7B00D@...&gt; &lt;3C8848C1.DA842B65@...&gt; &lt;3C885B54.D0C7C1A3@...&gt; &lt;3C88E217.87A1D756@...&gt; &lt;3C8910F9.934029E4@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Jeff Bone &lt;jbone@...&gt;\r\nReply-To: jbone@...\r\nX-Yahoo-Group-Post: member; u=10266038\r\n\r\n\nSee the Wiki: [1]\n\nPaul Prescod wrote:\n\n&gt; &gt; Sorry, &quot;without links to them.&quot;\n&gt;\n&gt; Oh, I see. We&#39;re back to &quot;Java can&#39;t implement this solution unless you\n&gt; use Java.&quot;\n\nNo.  The above is an artificially bogus problem statement, I wouldn&#39;t do that to you.  The problem I have offered\nis a much more realistic problem statement grounded in the *fact* that, while there are addressible objects on the\nWeb, not all of them are necessarily part of any hypertext structure.\n\n&gt; How do we find things that are part of the Web but not hyperlinked?\n\nYou get URLs to them in e-mail, or on napkins, or whatever.  You ever noticed that field in your browser that you\ncan type things into, or do you always get to every piece of content you access by following links from your home\npage? ;-)\n\n&gt; You\n&gt; say by working with names. But that only works a tiny, tiny, tiny\n&gt; fraction of the time.\n\nNo, it&#39;s guaranteed to work *all* the time.  Hyperlinks depend on names.  Names do not depend on hyperlinks.  How\nyou acquire those names is a different matter, but TBL etc. have made it very explicit that the URI space is\nintentionally constructed to not depend on any given mechanism of name acquisition.\n\n&gt; If you invent a generative grammar language for the Web, I will write a\n&gt; CGI program that allows generative grammars to generate hypertext\n&gt; documents so that the Web subsumes that functionality *through\n&gt; hypertext*.\n\nOk.  ;-)  But first, just to warm up, maybe you should start as follows:  write a program that lists all the\nnatural numbers.  Report back. ;-)  (The fact that you can write a grammar for something doesn&#39;t imply that you\ncan practically generate the possibly infinite set of things that the grammar *can* generate.)\n\n\n&gt; If we define hypertext as &quot;text with links&quot; then it becomes clear that\n&gt; anything you can represent with plan 9 namespaces I can represent with\n&gt; text with links.\n\nIt&#39;s not a question of representation, it&#39;s a question of whether generative, dynamic representations are\nequivalent to static, declarative representations for all purposes.  They aren&#39;t.  Cf. the Wiki for more detailes,\nbut the following should suggest the problem:  while I may be able to write a grammar that generates all possible\nstrings that the grammar can generate, that set may be infinite and might not be enumerable.\n\n&gt; The only question is whether the system is closed over\n&gt; hypertext or closed over namespaces or neither. If we obey the opacity\n&gt; principle then it will become closed over hypertext because things\n&gt; without links to them would by definition not be on the Web.\n\nThis is exactly correct!  And the conclusion I&#39;ve drawn is that (a) the original intent of at least the URI and\nHTTP architectural components of the Web was that the Web was a superset of the hypertext structure, and (b) the\ndeviation away from those precepts is a cultural artifact of the increasing focus and interest on the part of a\nfew people (TBL) on markup-based KR.  But it&#39;s not at all clear that markup-based KR can or can best capture all\nthe kinds of information that inhabits a universal information space.\n\n&gt; But thanks\n&gt; to query parameters and URIs the set of things with links to them is\n&gt; infinite.\n\nYes, but pushing hierarchical / graph-structure inormation into the flat space of query parameters *loses*\ninformation.  This is badness.  See the Wiki.\n\n&gt;\n&gt; &gt; Yes, you are reduced to &quot;hacking&quot; in this case --- *because* of opacity.\n&gt;\n&gt; No, I&#39;m reduced to hacking because I&#39;m trying to get access to\n&gt; information (the listing of files) that was not provided to me.\n\nThis is incorrect.  I am trying to find objects in a space that is not and perhaps cannot be (or cannot\nefficiently be) enumerated.  And I&#39;m not &quot;hacking,&quot; I&#39;m using information about the organization of that space\nthat was explicitly provided to me by the owner of that space to do so.\n\n&gt; Okay you&#39;re the spider writer. I&#39;ve just put ten .gif files on my\n&gt; website. Really. To help you along I put your first name in their file\n&gt; names. Go find them. (Please don&#39;t brute force my service provider.) If\n&gt; you show me how to solve the problem with namespaces I&#39;ll show you how\n&gt; to do it with hypertext.\n\nThis wouldn&#39;t be an appropriate problem for generative names, it would be like the problem I gave you earlier of\nenumerating an infinite set.  Generative names aren&#39;t appropriate for this --- but neither is hypertext, if the\nset is truly infinite or even very large.  I&#39;m not suggesting that generative naming can or should tackle this\nkind of problem.  I am, however, suggesting that there are information spaces which are well-organized, dense, and\nregular for which this is an efficient and useful technique.  Infospaces organized along time and space are good\nexamples.  See the Wiki.\n\n&gt; Either the webiste owner is working with you or not. If they are not\n&gt; working with you then there is no reason to believe the names will be\n&gt; consistent because *they own the server side namespace and can name the\n&gt; graphics whatever they want*. That isn&#39;t unique to the Web. Every\n&gt; operating system I&#39;ve ever used allows you to name things more or less\n&gt; whatever you want. Every programming language I&#39;ve ever used allows you\n&gt; to name things more or less whatever you want. Are you saying the Web\n&gt; should enforce predictable names?\n\nNot at all.\n\n&gt; If they are working with you then the tried and true and 100% effective\n&gt; way for them to do so is to provide hypertext (either static or dynamic)\n&gt; that provides access to the documents.\n\nI&#39;m not suggesting that hypertext isn&#39;t a good thing, and indeed the right tool in many, many cases.  I am\nsuggesting that it is not the right tool for every job, and in many cases where it&#39;s not the right tool generative\nnames in structured namespaces are.  We have both a hammer (hypertext) and a saw (the URI namespace).  We\nshouldn&#39;t use the hammer to try to cut boards.\n\njb\n\n[1] http://conveyor.com/RESTwiki/moin.cgi/GenerativeNaming\n\n\n"}}