{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":266460716,"authorName":"Eric J. Bowman","from":"&quot;Eric J. Bowman&quot; &lt;eric@...&gt;","replyTo":"SENDER","senderId":"KZ8wMNbmjhaw_ey6fEWGS2TNg9cdQv87ilX_nJcTLESjqLzqt8m_SqAuM4LC7i_dXJiE0w4RWR-i1LEULk5qmk8T1EflakJjxW9HjSJLEQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: To PUT things right","postDate":"1184739883","msgId":9510,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFczNzY5NzYyODE5MTcxMTE4NDczOTg4M0BtYWlsLm1haWxzbmFyZS5uZXQ+"},"prevInTopic":9509,"nextInTopic":9511,"prevInTime":9509,"nextInTime":9511,"topicId":9262,"numMessagesInTopic":19,"msgSnippet":"... What happens on the server is opaque to the client.  If the user requests that the representation they have received, be replaced by the representation","rawEmail":"Return-Path: &lt;eric@...&gt;\r\nX-Sender: eric@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 48064 invoked from network); 18 Jul 2007 06:24:55 -0000\r\nReceived: from unknown (66.218.66.71)\n  by m44.grp.scd.yahoo.com with QMQP; 18 Jul 2007 06:24:55 -0000\r\nReceived: from unknown (HELO mail.mailsnare.net) (209.236.228.78)\n  by mta13.grp.scd.yahoo.com with SMTP; 18 Jul 2007 06:24:55 -0000\r\nX-Virus-Scanned: by ClamAV at mailsnare.net\r\nX-Message-ID: 749f92e98ac7daa1b40c7093adeba4681e7bd0d5869d272e49d9ebde58f8da29\r\nReceived: from mail.mailsnare.net (unknown [209.236.228.74])\n\tby mail.mailsnare.net (Postfix) with ESMTP id B7223795CA\n\tfor &lt;rest-discuss@yahoogroups.com&gt;; Wed, 18 Jul 2007 06:24:44 +0000 (UTC)\r\nTo: rest-discuss@yahoogroups.com\r\nImportance: Normal\r\nSensitivity: Normal\r\nMessage-ID: &lt;W37697628191711184739883@...&gt;\r\nX-Mailer: Mintersoft EdgeDesk, Build 4.03.0105\r\nDate: Wed, 18 Jul 2007 06:24:43 +0000\r\nOrganization: Bison Systems Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;utf-8&quot;\r\nContent-Transfer-Encoding: 8bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Eric J. Bowman&quot; &lt;eric@...&gt;\r\nReply-To: eric@...\r\nSubject: Re: To PUT things right\r\nX-Yahoo-Group-Post: member; u=266460716\r\n\r\n&gt;\n&gt; Oh but that’s *exactly* what the division implies. Once you\n&gt; depart from octet-for-octet equivalence (or any other, a priori\n&gt; prescribed and well-specified form of equivalence), it is no\n&gt; longer testable in any meaningful sense of the word whether the\n&gt; server is merging or replacing things. In fact, it would often\n&gt; be *undecidable* whether the server is doing one or the other.\n&gt;\n\nWhat happens on the server is opaque to the client.  If the user \nrequests that the representation they have received, be replaced \nby the representation they PUT to that URI, the next GET of that \nURI should reflect the replacement that was requested.  It simply \ndoes not matter how the server honors that request, so long as \nthat request is honored.  If the server merged something, so be \nit, provided that from the client perspective something appears \nto have been replaced.\n\nYou must look at this from the client perspective.  Again, HTML \nresources on my server are derived from Atom files.  If I accept \na PUT of the HTML representation, then the server is expected to \nalter the Atom file in such a way that a subsequent GET of the \nsame HTML representation reflects the changes the user requested \n-- as transformed from the server-altered Atom source file.  I do \nnot claim that this must be a full replacement, just as I do not \nclaim that a partial replacement is the same thing as a merge.\n\nThe client did not request a replacement of the Atom file, the \nrequest was to change the HTML representation derived from that \nAtom file.  When that HTML representation is next retrieved, it \nreflects the change the user requested, without the server ever \naltering any HTML code.  Because, you see, that HTML is merely the \ncached output stream of an XSLT transformation, not a file which \ncan be replaced -- a la FTP or WebDAV.  The client is not required \nto alter the Atom source directly, the server takes care of that \nimplementation detail.\n\nThe result of the PUT interaction must have replacement semantics, \nnot merge semantics, as judged from the client perspective on a \nsubsequent GET.  Such semantics would, from the client perspective, \nbe indistinguishable from having used FTP STOR to replace that HTML \nrepresentation, assuming a different system where the HTML \nrepresentation is a file saved on a disk.  We are talking about the \nsemantics of the user interaction here, not the opaque inner \nworkings of the server-side application.\n\n&gt;\n&gt; Say I submit XML to your server and you make PDF out of it.\n&gt; Let’s further assume that my XML did not contain anything that\n&gt; would specify the page margins. The PDF has the same page margins\n&gt; as the PDF representation of the previous version of the\n&gt; resource. Can you decide whether the server used the margin\n&gt; settings from the previous version of the resource, or used some\n&gt; global default? In the context of a single request?\n&gt;\n\nIf the PDF was not modified, as in the client requested that some \nsnippet of XML be PUT to some URI, the PDF derived from that snippet \nis still subject to the same transformation on the server as the \nlast XML snippet PUT to that URI.  Why should a PUT of new XML \ncontent change the page margins of a derived PDF, when that PDF was \nnot the subject of the PUT request?  If the user interaction desired, \nis a change to the margins of the PDF representation, and such a \nchange is allowed by the server then it would make much more sense \nto PUT a new PDF representation wouldn&#39;t it?  Since the margins of \nthe PDF representation have nothing to do with the source content \nused to create the PDF.\n\n&gt;\n&gt; Conflating PUT and PATCH deprives the\n&gt; client of expressiveness, which in turn limit’s the server’s\n&gt; options in interpreting the request in the client’s interests.\n&gt;\n\nIOW, you&#39;re agreeing with me again.  Assigning merge semantics to \nPUT breaks the Uniform Interface constraint of REST.\n\n&gt;\n&gt; However, the server *is* free to interpret PUT requests as it\n&gt; sees fit.\n&gt;\n\nNot if the result of a subsequent GET for the resource in question \nyields some representation which has merged the PUT request into \nwhat was there before, instead of replacing something -- in that \ncase, the Uniform Interface constraint is violated and the app is \nnot RESTful.\n\n-Eric\n\n\n\n\n"}}