{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":136218993,"authorName":"Story Henry","from":"Story Henry &lt;henry.story@...&gt;","profile":"hjsatdoc","replyTo":"SENDER","senderId":"TS9Dhv_0w6-6NIpaRd0qJ8y9Bwk2JBDbg-VaNK6ATLfbS70aQQ0dhtF4dBcZGUzWL1avkWjeu6tCaxza0S3ju1ICI7aDqJ4T_hHpUQ","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [rest-discuss] unrestful OpenId attribute exchange draft ?","postDate":"1185487701","msgId":9540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwNjVDNjlCLUMzMjQtNDgxNy1CRUE3LTBBNjY0MkNCNTAyMEBiYmxmaXNoLm5ldD4=","inReplyToHeader":"PEQ0Q0FFMDYwLTlENTctNDY2MS1CRDhDLUIyOURBOTc0MjQzNUBhc3Ryby5nbGEuYWMudWs+","referencesHeader":"PDBBMkI4Q0I3LTk2RDItNDc2Ri1CODVCLTVEOEU0QzIyQkI0RUBTdW4uQ29tPiA8RDRDQUUwNjAtOUQ1Ny00NjYxLUJEOEMtQjI5REE5NzQyNDM1QGFzdHJvLmdsYS5hYy51az4="},"prevInTopic":9534,"nextInTopic":0,"prevInTime":9539,"nextInTime":9541,"topicId":9530,"numMessagesInTopic":3,"msgSnippet":"Thanks for the feedback Norman.  I am forwarding this back to the openid group, because your responses have really helped me understand the issues better. By","rawEmail":"Return-Path: &lt;henry.story@...&gt;\r\nX-Sender: henry.story@...\r\nX-Apparently-To: rest-discuss@yahoogroups.com\r\nReceived: (qmail 39920 invoked from network); 26 Jul 2007 22:10:25 -0000\r\nReceived: from unknown (66.218.67.36)\n  by m50.grp.scd.yahoo.com with QMQP; 26 Jul 2007 22:10:25 -0000\r\nReceived: from unknown (HELO zone5.gridzones.com) (69.90.133.49)\n  by mta10.grp.scd.yahoo.com with SMTP; 26 Jul 2007 22:10:25 -0000\r\nReceived: from [192.168.1.11] (ALagny-152-1-111-80.w86-218.abo.wanadoo.fr [86.218.125.80])\n\t(authenticated bits=0)\n\tby zone5.gridzones.com (8.13.8/8.13.7) with ESMTP id l6QM8H8k019778\n\t(version=TLSv1/SSLv3 cipher=AES128-SHA bits=128 verify=NO);\n\tThu, 26 Jul 2007 15:08:19 -0700 (PDT)\r\nIn-Reply-To: &lt;D4CAE060-9D57-4661-BD8C-B29DA9742435@...&gt;\r\nReferences: &lt;0A2B8CB7-96D2-476F-B85B-5D8E4C22BB4E@...&gt; &lt;D4CAE060-9D57-4661-BD8C-B29DA9742435@...&gt;\r\nMime-Version: 1.0 (Apple Message framework v752.3)\r\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\r\nMessage-Id: &lt;A065C69B-C324-4817-BEA7-0A6642CB5020@...&gt;\r\nCc: Rest List &lt;rest-discuss@yahoogroups.com&gt;,\n        OpenID General &lt;general@...&gt;\r\nContent-Transfer-Encoding: 7bit\r\nDate: Fri, 27 Jul 2007 00:08:21 +0200\r\nTo: Norman Gray &lt;norman@...&gt;\r\nX-Mailer: Apple Mail (2.752.3)\r\nX-Virus-Scanned: ClamAV version 0.88.7, clamav-milter version 0.88.7 on zone5.gridzones.com\r\nX-Virus-Status: Clean\r\nX-eGroups-Msg-Info: 2:3:4:0\r\nFrom: Story Henry &lt;henry.story@...&gt;\r\nSubject: Re: [rest-discuss] unrestful OpenId attribute exchange draft ?\r\nX-Yahoo-Group-Post: member; u=136218993; y=9jKIgCbFW2h8MasTgA1r6j8r63_aqvuIZFGE5fNj_dBS2Y4\r\nX-Yahoo-Profile: hjsatdoc\r\n\r\nThanks for the feedback Norman.  I am forwarding this back to the  \nopenid group, because your responses have really helped me understand  \nthe issues better.\n\nBy the way there is a really useful pdf book on OpenId that is  \navailable for review currently, before it goes to the printer:\n\nhttp://www.openidbook.com\n\nOn 26 Jul 2007, at 18:26, Norman Gray wrote:\n\n&gt; Henry, hello.\n&gt;\n&gt; On 26 Jul 2007, at 15:32, Henry Story wrote:\n&gt;\n&gt;&gt; (2) It does not feel RESTful. If something is to return information\n&gt;&gt; it should have a URL. Here there is very clearly overlapping of\n&gt;&gt; concerns as explained above. What is the url for information for one\n&gt;&gt; identity here? I have a large alarm bell ringing when I read sections\n&gt;&gt; such as: &quot;Fetch message&quot; and &quot;store message&quot;. Is that not the\n&gt;&gt; equivalent of HTTP GET and PUT?\n&gt;\n&gt;&gt;     -b- query language: SPARQL though not yet finished does\n&gt;&gt; everything that is needed here as shown in the example given at [1]\n&gt;\n&gt; Disclaimer: I&#39;ve looked through the attribute exchange draft, but  \n&gt; haven&#39;t studied it; the following is not, I think, dependent on the  \n&gt; fine details.\n\nNeither had I. Chapter 6 of the book I mentioned above goes over it  \nin easier language.\n\n&gt; My feeling is that SPARQL is not a good fit here, because this  \n&gt; might be a case where a RESTful approach is not ideal.\n&gt;\n&gt; Attribute exchange is pretty fundamentally a conversation: if I  \n&gt; want to get a set of Ignatius&#39;s attributes from you, I have to  \n&gt; assure myself of who you are, but you also have to either (a)  \n&gt; assure yourself of who I am, and that I am permitted to get all of  \n&gt; Ignatius&#39;s attributes, or (b) I have some other legitimate need to  \n&gt; get this information, which fits in with a pre-existing policy:\n&gt;\n&gt;   me: tell me Ignatius&#39;s age\n&gt;   you: why do you want to know?\n&gt;   me: I&#39;ll only sell him drink if he&#39;s over 18\n&gt;   you: OK: he&#39;s over 18, but I&#39;m not telling you his birthday\n&gt;   me: that&#39;ll do\n\nHehe. That would indeed be very cool. One could I am sure do that in  \nSPARQL too, but one would need a relation such as  \nquery:IWillAnswerOnlyIfYouAnswerThisFirst relation.\n\n\n&gt; When fully general, this turns into a decidedly non-trivial problem.\n\nIndeed... Interesting idea. But I don&#39;t think that this is what they  \nare proposing... as I just realized you admit below.\n\n&gt; The simpler case which seems to be suggested in OpenID docs and the  \n&gt; attribute exchange draft, of allowing the (human) OpenID owner to  \n&gt; choose on the fly what attributes are released to a relying party,  \n&gt; still involves a three-way interaction, between the relying party,  \n&gt; the IdP and the human.\n\nAh thanks for pointing that out. I just found that stated in the book\n\n&quot;In general, any time a Consumer requests these additional parameters  \nfor user registration purpose, the identity provider should prompt  \nthe End User before sending these parameters to the Consumer. The End  \nUser should be given a choice which parameters it wants to send to  \nthe Identity Provider&quot;\n\nI had not picked up on this.\n\n&gt; Although you can characterise that as a GET which might take a long  \n&gt; while to be retrieved (when will the user come back from coffee?),  \n&gt; it feels a bit forced to me.  It&#39;s doable, but it&#39;s not clear how  \n&gt; `this is who I am and why I want your birthday&#39;, or even just `this  \n&gt; is who I am&#39;, would be included in the SPARQL request.\n&gt;\n\nWell I think one could look at this as a form of indirect SELECT  \nSPARQL query where the\nvariables in the SELECT get to be chosen by the end user. Ie the  \nConsumer sends\n\nWHERE {\n    ?p foaf:openid &lt;http://openid.sun.com/bblfish&gt; .\n   OPTIONAL { ?p foaf:birthday ?bday } .\n   OPTIONAL { ?p foaf:mbox ?mbox } .\n}\n\nand the End User gets to prepend the SELECT clause\n\nSELECT ?bday\n\nif he only wants the birthday to be passed on but not the mbox.\n\nIt is not done as a SPARQL request because that would make for URL  \nredirects that are much too long. So really the protocol is working  \nwith a predefined template SPARQL query, and the\nfield names are the names of the variables passed around without the  \n&#39;?&#39;.\n\nMhh looked at this way, it seems easier to understand to me, and it  \nmakes more sense.\n\nMind you in that case it should be easy to define how to change the  \ninformation on the server: do a PUT of some foaf there. That would  \nremove the I think clearly unRESTful storage protocol. I mean clearly  \nhere they are reinventing HTTP response codes, with things such as  \nstorage success, storage failure, etc...\n\nAnother thought: if one thinks about it, this redirect to the server  \nhas to happen because the end user does not have a rdf database to  \nquery. If he did then the client could query the user directly.\n\n&gt; The case which you describe in your (excellent) [1] is, I think,  \n&gt; the most basic case, where all the attributes are available without  \n&gt; any policy at all, and the problem is simply how does one associate  \n&gt; Ignatius&#39;s FOAF file with his OpenID.  Now, OpenID is about keeping  \n&gt; things simple, and it might be deemed valuable to keep things  \n&gt; precisely this simple; in that case, a pointer to a FOAF file would  \n&gt; indeed be hugely simpler than a new protocol.\n&gt;\n&gt;&gt; [1] http://blogs.sun.com/bblfish/entry/foaf_openid\n&gt;\n\n:-) ok happy to have contributed something.\n\nI had tried to deal with the problem by having the foaf file return  \nmore or less information. I would have required the end user specify  \nwhat should be visible for that Client when entering his password.  \nThere was some hand-waving there, because it was not so clear how one  \ncan identify the server. One would have to:\n\n   - give the client an OpenId too, which I was thinking could be  \nlinked to the server_root\n   - identify the foaf file somehow as being identity dependent,  \nperhaps by adding a new HTTP header pointing to the login point, so  \nthat the client would know to login for more information\n   - and of course the foaf file would have to be served by the same  \nservice as the openid authentication.\n\nBut that may in the end be more complicated than the query part of  \nthe protocol defined above, and does not feel as clean as the  \nindirect query idea.\n\nIt looks like the idea of querying the end user directly would be the  \nbest, once he has been correctly identified. In that case though the  \nend user is not that different from a very slow web server.\n\nIt would be interesting to think more about a SPARQL based service,  \ngiven the flexibility such a language and format make available.\n\n&gt; Separately:\n&gt;\n&gt;&gt; PS.  Now criticism (1) above is a little tricky perhaps because if\n&gt;&gt; the Identity Provider has no say\n&gt;&gt; over the OpenId resource, and that is used to point to personal\n&gt;&gt; information, then the open id could be describing itself in ways that\n&gt;&gt; would be completely unacceptable to the organisation controlling the\n&gt;&gt; Identity Provider. So there may be a good reason to have it have some\n&gt;&gt; control over the OpenId, or  for one to want to ask it questions\n&gt;&gt; regarding the identity of the person associated with that id.\n&gt;&gt;\n&gt;&gt; In my view what will happen is that in the end all identity providers\n&gt;&gt; will have control of their openid they give out. So as Sun gives out\n&gt;&gt; http://openid.sun.com/bblfish so visa will give out\n&gt;&gt; http://visa.com/iod/1231341 and there will then be my personal openid\n&gt;&gt; foaf file, which will link them all together (if I want to).\n&gt;\n&gt; Can you elaborate on this?  Do you just mean that sun.com might not  \n&gt; want openid.sun.com/bblfish to be able to say &#39;My politics are X&#39;?\n\nNo but I suppose they might not want it to say  &quot;My name is Jonathan  \nSchwartz&quot; :-)\n\n&gt; My first reaction to such a prohibition would be that it  \n&gt; misunderstands what (I think) OpenID is clever about.  OpenID  \n&gt; avoids some of X.509&#39;s problems by _not_ making any link between  \n&gt; online and offline entities.  So, pace Tim Bray in [a], all an  \n&gt; OpenID says is that its owner is the same person over time; the IdP  \n&gt; doesn&#39;t warrant that the name means anything.  The IdP doesn&#39;t even  \n&gt; warrant that the attributes it&#39;s supplying are true, simply that  \n&gt; these are honestly what the offline human told it to say.\n\nThat is a good response. And so having the OpenId be a FoafDocument,  \nor point to a FoafDocument that is outside of the sphere of influence  \nof the Identity Provider is ok. As OpenId is specified currently.\n\nBut!\n\nSun stated that all OpenIds starting with http://blogs.sun.com/ \nbblfish identify Sun employees. They have had to do that verbally  \nsince OpenId by itself does not make any tools available to make this  \npossible.\n\nNow in my last post I showed how Sun could make this statement with a  \nfew simple additional foaf relations [2], and by creating itself a  \ncorporate foaf file. Essentially you can think of the Identity  \nProvider service as a group identifier, that can also identify the  \nmembers of the group.  This would then give a mechanical way for sun  \nto make a statement about that service. The service could also make  \nthe same point by pointing back in a rdf/xml representation back to  \nthe Sun Microsystems foaf file.\n\nIn that situation it is clear that Sun will not want the attributes  \non its service endpoint to be all equally updatable, because they are  \nnow making claims about the members of the Sun group, with legal  \nresponsibilities. Neither would Sun want the foaf file linked to from  \nthe openid.sun.com/bblfish to be completely in the hands of the  \nemployee. Some attributes may, but others may not.\n\nSo I think I have shown in [2] that OpenId could be used for a lot  \nmore than what it is used for currently, with a little bit of extra  \nmetadata, which is neat.\n\n\n&gt; Or am I missing your point?\n&gt;\n&gt; Best wishes,\n&gt;\n&gt; Norman\n&gt;\n&gt; [a] http://www.tbray.org/ongoing/When/200x/2007/02/24/OpenID#p-3\n&gt;\n\n[2] http://blogs.sun.com/bblfish/entry/a_foaf_file_for_sun\n\n\n&gt; -- \n&gt; ------------------------------------------------------------\n&gt; Norman Gray  :  http://nxg.me.uk\n&gt; eurovotech.org  :  University of Leicester, UK\n&gt;\n&gt;\n\n\n"}}